/*$T MapServer/Server/Obj/Visitor/InitBeastieVisitor.h GC 1.140 10/10/07 10:07:35 */


/*$6
 +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 */


#ifndef _INIT_BEASTIE_VISITOR_H_
#define _INIT_BEASTIE_VISITOR_H_
#include "CharacterVisitor.h"

class	Character;
struct _INIT_OBJECT;

// 初始小动物访问器
class InitBeastieVisitor :
	public CharacterVisitor
{
/*
 -----------------------------------------------------------------------------------------------------------------------
 -----------------------------------------------------------------------------------------------------------------------
 */
public:
	InitBeastieVisitor();
	virtual ~InitBeastieVisitor();

/*
 -----------------------------------------------------------------------------------------------------------------------
 -----------------------------------------------------------------------------------------------------------------------
 */
public:
	// 类型
	virtual CharacterVisitor::VisitorType	GetType();

	// 初始化
	virtual void VisitInitMonster(Character *pChar)
	{
	};
};
#endif
