/*$T MapServer/Server/Obj/TrapManager.h GC 1.140 10/10/07 10:07:35 */


/*$6
 +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 */


#ifndef __SPECIALMANAGER_H__
#define __SPECIALMANAGER_H__

#include "TypeDefine.h"
#include "ObjectSingleManager.h"

class	SpecialCreature;

//ÏÝÚå¹ÜÀíÆ÷
class SpecialObjectManager :
	public ObjectSingleManager
{
/*
 -----------------------------------------------------------------------------------------------------------------------
 -----------------------------------------------------------------------------------------------------------------------
 */
public:
	SpecialObjectManager(void);
	virtual		~SpecialObjectManager(void);

	virtual BOOL	HeartBeat(uint32 uTime = 0);

	SpecialCreature *GetSpecial(ObjID_t idObj);

/*
 -----------------------------------------------------------------------------------------------------------------------
 -----------------------------------------------------------------------------------------------------------------------
 */
public:
	BOOL	RemoveAllSpecial(void);
};
#endif
