x302505_g_ScriptId 		= 302505
x302505_g_MissionKind 	= 	1                       --任务类型
x302505_g_MissionName	= "【个人】领取节日礼品"

x302505_g_GameId		= 1056			--玩法ID
x302505_g_LimitLevel	= 40			--最低级别

x302505_g_DataInfo = {
	{day = 0  , data ="1月1日",		name = "元旦节", 								info = "\t今天是一年一度的元旦佳节，中国人习惯把新年的第一天叫做“元旦”，“元”有“初”、“始”之意，“旦”指天明的时间，也通指白天。元旦合称即是“初始的日子”，也就是新年的第一天。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--1月1日
	{day = 10 , data ="1月11日", 	name = "腊八节", 								info = "\t今天是十二月初八腊八节，也是腊月最重大的节日，古代称为“腊日”。从先秦起，腊八节都是用来祭祀祖先和神灵，祈求丰收和吉祥。据说，佛教创始人释迦牟尼的成道之日也在十二月初八，因此腊八也是佛教徒的节日，称为“佛成道节”。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--腊月初八 1.11
	{day = 33 , data ="2月3日", 	name = "春节", 									info = "\t今天是我国的传统节日：春节。相传尧舜时期，我国就有了这个节日。殷商甲骨文的卜辞中，亦有关于春节的记载。公元前104年汉武帝太初元年，我国人民创造了“太初历”，明确规定以农历正月为岁首。农历新年的习俗从此流传了2000多年。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--正月初一 2.3
	{day = 44 , data ="2月14日", 	name = "情人节", 								info = "\t今天是情人节，又称圣瓦伦丁节。起源于古代罗马，瓦伦丁是基督教徒，因反抗罗马统治者于公元270年2月14日被处死刑，行刑前，曾给典狱长的女儿写了封信，表明自己光明磊落的心迹和对她的一片情怀。自此，基督教便把2月14日定为情人节。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--2月14日
	{day = 47 , data ="2月17日", 	name = "元宵节", 								info = "\t今天是农历正月十五日，一年一度的元宵佳节。元宵节起源于汉朝，据说是汉文帝时为纪念“平吕”而设。正月为元月，古人称夜为“宵”，而十五日又是一年中第一个月圆之夜，所以称正月十五为元宵节。又称为“上元节”。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--正月十五   2.17
	{day = 66 , data ="3月8日", 	name = "国际妇女节", 						info = "\t今天是国际妇女节，是世界各国劳动妇女为争取和平、民主、解放而斗争的节日。1910年3月在丹麦哥本哈根召开的第二次国际社会主义妇女代表会议中，德国社会主义革命家克拉拉·蔡特金建议每年3月8日为世界妇女斗争日，该提议获得一致通过。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--3月8日
	{day = 73 , data ="3月15日",	name = "国际消费者权益日",			info = "\t今天是国际消费者权益日，消费者权益保护运动起源于欧洲，兴起于第二次世界大战后各发达资本主义国家。二战后，各消费者组织便应运而生，并迅速扩展到发展中国家。1983年国际消费者联盟组织确定每年的3月15日为“国际消费者权益日”。 \n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--3月15日
	{day = 90 , data ="4月1日", 	name = "愚人节", 								info = "\t今天是愚人节，也称万愚节，起源于法国。1564年，法国国王查理九世决定改变过去以四月一日作为新年开端的历法。历法推行过程中，顽固保守分子和拥护新法的人们在这天互相愚弄，日久天长便成为一种风俗。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--4月1日
	{day = 94 , data ="4月5日",	 	name = "清明节", 								info = "\t今天是二十四节气之一的清明节，清明节起源于春秋时期，晋文公在介子推死后第二年登山祭奠是发现介子推死时所在的老柳树又长出了新芽，便赐名为”清明柳“，并把寒食节的后一天定为清明节。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--4月5日
	{day = 111, data ="4月22日", 	name = "世界地球日", 						info = "\t今天是世界地球日，2009年4月22日，第63届联合国大会一致通过决议，决定将今后每年的4月22日定为“世界地球日”。今天的“地球日”已真正成为全地球的节日，提醒着人类保护地球、善待地球。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--4月22日
	{day = 120, data ="5月1日", 	name = "国际劳动节", 						info = "\t今天是国际劳动节。1889年, 在英法等各国工运领袖组织的“国际劳动者同盟”大会上通过了法国代表提出的议案，把劳工运动的五月一日定为劳动节。从此，世界各地纷纷效仿，各国工人团体在这一天举行盛大庆祝会，工矿厂商放假一天。 \n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--5月1日
	{day = 123, data ="5月4日", 	name = "中国青年节", 						info = "\t今天是中国青年节。中国青年节起源于中国1919年著名的反帝爱国运动——五四运动，它表现了中国人民保卫民族独立与争取民主自由的坚强意志，标志着中国新民主主义革命的开始。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--5月4日
	{day = 127, data ="5月8日", 	name = "国际母亲节", 						info = "\t今天是国际母亲节。1919年，美国的嘉维丝女士发起母亲节，以纪念在战争中受苦的母亲。后来将嘉维丝的母亲逝世的日子（1905年五月的第二个星期日）订为母亲节，把嘉维丝的母亲生前喜爱的康乃馨作为母爱的象征。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--每年5月第二个星期日 5.8
	{day = 131, data ="5月12日", 	name = "国际护士节", 						info = "\t今天是国际护士节。英国人南丁格尔女士于1820年5月12日出生于意大利。1853年，英俄克里米亚战争爆发,南丁格尔甘愿放弃贵族的生活，毅然投身于战地救护工作。国际上为纪念她的杰出贡献和护士精神，把五月十二日定为国际护士节。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--5月12日
	{day = 151, data ="6月1日", 	name = "国际儿童节", 						info = "\t今天是国际儿童节。为了悼念全世界所有在反法西斯战争中死难的儿童，保障全世界儿童的生存、保健和受教育的权利，1949年11月，国际民主妇女联合会正式决定每年6月1日为全世界少年儿童的节日，即国际儿童节。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--6月1日
	{day = 155, data ="6月5日", 	name = "世界环境日", 						info = "\t今天是世界环境日。1972年10月，联合国大会第27届会议将6月5日定为 “世界环境日”。其作用在于唤起全世界人民都来注意保护人类赖以生存的环境，自觉采取行动参与保护环境，同时要求各国政府和联合国单位为推进环境保护进程做出贡献。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--6月5日
	{day = 156, data ="6月6日", 	name = "端午节", 								info = "\t今天是一年一度的端午佳节。端午节是我国较为古老的传统节日。每逢阴历五月初五这天，人们都要在江河湖海上举行赛龙舟，还要吃粽子、戴香袋、踏青采艾蒿等，这些活动已成为千古不变的习俗，从古至今一直在沿续着。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--五月初五	6.6
	{day = 169, data ="6月19日", 	name = "父亲节",								info = "\t今天是父亲节，1972年，美国总统尼克松签署了建立父亲节的议会决议，使其成为全国性的节日。在父亲节这天，人们会在胸前佩带特定的花朵，佩带红玫瑰表示对健在父亲的爱戴，佩带白玫瑰则表达对故去父亲的悼念。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--6月第三个星期日	6.19
	{day = 173, data ="6月23日", 	name = "国际奥林匹克日", 				info = "\t今天是国际奥林匹克日，1894年6月23日，国际奥委会 在巴黎正式成立，为了纪念这一具有历史意义的经过国际奥林匹克委员会的赞同，把这一日称为“奥林匹克日”或运动日。国际奥委会从1948年起将每年的6月23日定为国际奥林匹克日。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--6月23日
	{day = 176, data ="6月26日", 	name = "国际反毒品日", 					info = "\t今天是世界反毒品日，1987年6月12日至26日，联合国在麻醉品滥用和非法贩运问题部长级会议上提出了“爱生命，不吸毒”的口号。同年12月，第42届联合国大会通过决议，决定把每年的6月26日定为“禁止药物滥用和非法贩运国际日”。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--6月26日
	{day = 181, data ="7月1日", 	name = "中国共产党诞生日",			info = "\t今天是中国共产党成立纪念日。 1921年7月各地共产主义小组派出代表召开了中国共产党第一次代表大会。1941年党中央决定召开“一大”确定1921年7月的首日即7月1日作为党的生日和纪念日。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--7月1日
	{day = 187, data ="7月7日", 	name = "中国人民抗日战争纪念日",info = "\t今天是中国人民抗日战争纪念日，1945年8月14日，日本政府无条件投降。9月2日，日本签署投降书。1951年8月13日政务院发布了规定9月3日为抗日战争胜利纪念日的通告。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--7月7日
	{day = 191, data ="7月11日", 	name = "世界人口日", 						info = "\t今天是世界人口日。1987年7月11日，前南斯拉夫的一个婴儿降生，被联合国象征性地认定为是地球上第50亿个人，并宣布地球人口突破50亿大关。1990年，联合国决定将每年的7月11日定为“世界人口日”，以唤起人们对人口问题的关注。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--7月11日
	{day = 212, data ="8月1日", 	name = "建军节", 								info = "\t今天是中国建军节。1927年8月1日周恩来、贺龙等同志在江西南昌举行了武装起义。起义部队于1928年4月到达井冈山，和毛泽东领导的部队胜利会师，组成了今天的中国人民解放军。 \n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--8月1日
	{day = 217, data ="8月6日", 	name = "七夕情人节", 						info = "\t农历七月初七是我们中国人的情人节，也有人称之为乞巧节七夕或女儿节，这一天是女儿家们最为重视的日子。民间俗信这天牛郎和织女会在天河相聚。 \n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--七月初七	8.6
	{day = 225, data ="8月14日", 	name = "中元节", 								info = "\t今天是中元节，也称鬼节。每年农历七月十五为“中元节”，有些地方又俗称“鬼节”、“施孤”。民间认为这天是地官大帝的生日，要打开阴间或地狱之门，人们可以犒劳安慰，从地狱来到人间的祖先鬼魂。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--七月十五	8.14
	{day = 252, data ="9月10日", 	name = "中国教师节", 						info = "\t今天是中国教师节。是中国仅有的包括护士节、记者节在内的三个行业性节日之一。第六届人大常委会第9次会议决定，每年的9月10日为教师节。1985年9月10日是新中国恢复设立的第一个教师节。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--9月10日
	{day = 254, data ="9月12日", 	name = "中秋节", 								info = "\t今天是中秋佳节，按照中国的历法，农历七、八、九三个月是秋季。八月是秋季中间的一个月，八月十五又是八月中间的一天，所以这一个节日叫“中秋节”，又因这天的月亮非常圆，故叫作“团圆节”。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--八月十五	9.12
	{day = 273, data ="10月1日",	name = "国庆节", 								info = "\t今天是国庆节。1949年10月1日，是新中国成立的纪念日。1949年10月1日下午3时，北京三十万人在天安门广场隆重举行典礼，庆祝中华人民共和国中央人民政府成立。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--10月1日
	{day = 277, data ="10月5日", 	name = "重阳节", 								info = "\t今天是农历九月初九重阳节。因为古老的《易经》中把“六”定为阴数，把“九”定为阳数，九月九日是日月并阳，两九相重，故而叫重阳，也叫重九。“重阳节”的名称始见于记载是三国时代。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--九月初九 10.5
	{day = 320, data ="11月17日", name = "国际大学生节", 					info = "\t今天是国际大学生节，1946年11月17日，为了在大学生中倡导追求和平、民主和自由，也为了纪念反法西斯的大学生运动，世界各国学生代表建立了第一个国际大学生节。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--11月17日------上面是2011年 下面是2010年
	{day = 336, data ="12月3日", 	name = "世界残疾人日", 					info = "\t今天是世界残疾人日，1992年10月12日至13日，第47届联大举行了自联合国成立以来首次关于残疾人问题的特别会议。大会通过决议，将每年的12月3日定为“国际残疾人日”。 \n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--12月3日
	{day = 354, data ="12月21日", name = "冬至节", 								info = "\t今天是冬至节，俗称“冬节”，在古代是很隆重的节日。冬至在大雪（节气）后的第十五天，这一天北半球白天最短，夜间最长，是一年中最为寒冷之日，标志冬尽春来，是冬春转变之时。\n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--12月21日
	{day = 358, data ="12月25日", name = "圣诞节", 								info = "\t今天是圣诞节，圣诞节是基督教世界最大的节日。是纪念耶稣出生的节日，耶苏是因着圣灵成孕，由童女马利亚所生的。起名为“耶苏”，意思是要他把百姓从罪恶中救出來。 \n\t每名40级以上的玩家今天可以在我这里领取到一份节日的礼物，你现在要领取吗？"},--12月25日
}


x302505_g_ItemInfo = {12035100,12035101,12035102,12035103,12035104,12035105,12035106,12035107,12035108,12035109}


----------------------------------------------------------------------------------------------
--枚举
----------------------------------------------------------------------------------------------
function x302505_GetItem( sceneId, selfId )
	local level = GetLevel(sceneId,selfId)
	if level>=40 then
		if level<60 then
			return x302505_g_ItemInfo[1]
		elseif 	level <70 then 
			return x302505_g_ItemInfo[2]
		elseif 	level <80 then 
			return x302505_g_ItemInfo[3]
		elseif 	level <90 then 
			return x302505_g_ItemInfo[4]
		elseif 	level <100 then 
			return x302505_g_ItemInfo[5]
		elseif 	level <110 then 
			return x302505_g_ItemInfo[6]
		elseif 	level <120 then 
			return x302505_g_ItemInfo[7]
		elseif 	level <130 then 
			return x302505_g_ItemInfo[8]
		elseif 	level <140 then 
			return x302505_g_ItemInfo[9]
		elseif 	level <160 then 
			return x302505_g_ItemInfo[10]
		end
	end
end


function x302505_ProcEnumEvent( sceneId, selfId, targetId, MissionId )
		--local today = GetDayOfYear() 
		--print ("--------------------today is "..today)
	--检查玩家等级
	local level = GetLevel(sceneId,selfId)
	if level<x302505_g_LimitLevel then
		return
	end
	
	--local state = GetQuestState(sceneId,selfId,targetId,-1)
	AddQuestNumText(sceneId,x302505_g_ScriptId,x302505_g_MissionName,3,-1)
end

----------------------------------------------------------------------------------------------
--脚本默认事件
----------------------------------------------------------------------------------------------
function x302505_ProcEventEntry( sceneId ,selfId, npcId,idScript,idExt )

	--活动未开启
	if GetGameOpenById(x302505_g_GameId) ~= 1 then
		
		--给出相关提示
		BeginQuestEvent(sceneId)
			AddQuestText(sceneId,"节日领奖功能已经关闭！")				
		EndQuestEvent(sceneId)
		DispatchQuestEventList(sceneId,selfId,npcId)
		return
	end
	
	local today = GetDayOfYear() 
	local next = 1

	for i, item in x302505_g_DataInfo do
		if item.day == today then
			BeginQuestEvent(sceneId)
			AddQuestText(sceneId, "#Y【个人】领取节日礼品#W")
			AddQuestText(sceneId, item.info)		
			local itemid = x302505_GetItem( sceneId, selfId )
			AddQuestItemBonus(sceneId, x302505_GetItem( sceneId, selfId ), 1)
			EndQuestEvent()
			DispatchQuestInfo(sceneId ,selfId, npcId, x302505_g_ScriptId, -1)
			return
		elseif item.day > today then
			next = i
			break
		end
	end
	
	BeginQuestEvent(sceneId)          
	AddQuestText(sceneId, "#Y【个人】领取节日礼品#W")
	AddQuestText(sceneId, "\t很抱歉，今天不能领节日礼品。\n\t下一次领取时间是#G"..x302505_g_DataInfo[next].data.."#W的"..x302505_g_DataInfo[next].name.."。")
	EndQuestEvent()
	DispatchQuestInfo(sceneId ,selfId, npcId, x302505_g_ScriptId, -1, 1)
end

function x302505_ProcAcceptCheck( sceneId, selfId, NPCId )
    return 1
end

----------------------------------------------------------------------------------------------
--接受
----------------------------------------------------------------------------------------------
function x302505_ProcAccept( sceneId, selfId )
	local today = GetDayOfYear() 
	local lastday = GetQuestData(sceneId, selfId, MD_HUODONG_JIERILINGJIANG_DATE[1], MD_HUODONG_JIERILINGJIANG_DATE[2],MD_HUODONG_JIERILINGJIANG_DATE[3])
	print ("lastday", lastday)
	if lastday ~= 0 and today == lastday-1 then
	
		local next = 1
		for i, item in x302505_g_DataInfo do
			if item.day == today then
				next = i
				break
			end
		end
		if next == getn(x302505_g_DataInfo) then
			next = 1
		else
			next = next+1
		end
	
		local msg = "#cffcf00您领过礼品了,请在#G"..x302505_g_DataInfo[next].data.."#cffcf00的#G"..x302505_g_DataInfo[next].name.."#cffcf00再来。"
		Msg2Player(sceneId,selfId,msg,8,3)
		Msg2Player(sceneId,selfId,msg,8,2)
		return
	end
	
	for i, item in x302505_g_DataInfo do
		if item.day == today then
			BeginAddItem(sceneId)
		
			AddItem( sceneId, x302505_GetItem( sceneId, selfId ) , 1 )
			--AddItem( sceneId, x302505_GetItem( sceneId, selfId ) , 1 )
			local ret = EndAddItem(sceneId,selfId)
			if ret > 0 then
				AddItemListToPlayer(sceneId,selfId)
				
				local today = GetDayOfYear() 
				SetQuestData(sceneId, selfId, MD_HUODONG_JIERILINGJIANG_DATE[1], MD_HUODONG_JIERILINGJIANG_DATE[2], MD_HUODONG_JIERILINGJIANG_DATE[3], today+1)
				GamePlayScriptLog(sceneId, selfId, 1711)
				local msg = format("您领取到一个#{_ITEM%d}。", x302505_GetItem( sceneId, selfId ))
				Msg2Player(sceneId,selfId,msg,8,3)
			else
				Msg2Player(sceneId,selfId,"背包已满，请整理后再来！",8,2)
				Msg2Player(sceneId,selfId,"背包已满，请整理后再来！",8,3)
			end
		end
	end
end

----------------------------------------------------------------------------------------------
--放弃
----------------------------------------------------------------------------------------------
function x302505_ProcQuestAbandon( sceneId, selfId, MissionId )

end

----------------------------------------------------------------------------------------------
--继续
----------------------------------------------------------------------------------------------
function x302505_OnContinue( sceneId, selfId, targetId )

end

----------------------------------------------------------------------------------------------
--检测是否可以提交
----------------------------------------------------------------------------------------------
function x302505_CheckSubmit( sceneId, selfId )

end

----------------------------------------------------------------------------------------------
--提交
----------------------------------------------------------------------------------------------
function x302505_ProcQuestSubmit( sceneId, selfId, targetId,selectRadioId, MissionId )

end

----------------------------------------------------------------------------------------------
--杀死怪物或玩家
----------------------------------------------------------------------------------------------
function x302505_ProcQuestObjectKilled( sceneId, selfId, objdataId, objId, MissionId )
end

----------------------------------------------------------------------------------------------
--进入区域事件
----------------------------------------------------------------------------------------------
function x302505_ProcAreaEntered( sceneId, selfId, zoneId, MissionId )
end

----------------------------------------------------------------------------------------------
--道具改变
----------------------------------------------------------------------------------------------
function x302505_ProcQuestItemChanged( sceneId, selfId, itemdataId, MissionId )
end
