---------------------------------------------------------------------
-- fuben common logic
------------------------------------------------------------------
x700081_g_ScriptId			=	700081
---------------------------------------------
--# define 0-20 for common,  240-255 for common
-----------------------------------------------
x700081_CSP_FUBENTYPE				= 	0
x700081_CSP_SCRIPTID				=	1
x700081_CSP_TICKCOUNT				= 	2
x700081_CSP_BACKSCENEID				= 	3
x700081_CSP_ISCLOSING				= 	4
x700081_CSP_LEAVECOUNTDOWN			= 	5
x700081_CSP_TEAMID					=	6
x700081_CSP_TICKTIME				=	7
x700081_CSP_HOLDTIME				=	8
x700081_CSP_FUBENLEVEL				=	9

x700081_CSP_FUBEN_SCENE_ID			=	10
x700081_CSP_CLOSETICK				=	11
x700081_CSP_TICKCOUNT_ADD			=	12
x700081_CSP_TICKCOUNT_SUB			=	13
x700081_CSP_B_TOPLIST_ABLE			=	14
x700081_CSP_PLAYER_DEAD				=	15
x700081_CSP_FUBEN_KIND				=	16  --现仅针对轮回台副本

x700081_CSP_XINSHOU_FLAG			=   17  --新手模式，现仅针对轮回台副本
x700081_CSP_XINSHOU_LEVEL			=	221  --是否为新手副本等级

x700081_CSP_HUMAN_COUNT				=	240
x700081_CSP_PLAYER_ENTER_START		=	241

x700081_CSP_LAST_TICKOUNT			=	247
x700081_CSP_GUID_START              =   248  --空6个
x700081_CSP_FUBEN_TYPE				=	254	--试炼，普通，英雄，三种类型
x700081_CSP_FUBEN_MODE				=   255


x700081_g_SanfanTimes				=   3
x700081_g_ZhouSanfanTimes			=   21

------------------------------------------------ fuben register data start ----------------------------------
x700081_g_ChallengeNpcGuid			= {123831,126070,129176,132070}   --挑战赛NPC

x700081_g_ToplistInfo       =   {   --Index 为在x700081_g_FubenNameList中的位置
		{ClassName = "祝家庄", ClassIndex = 1,TitleClassID = 57, Index = 54,Desc = "祝家庄排行榜只有三番模式下才能入榜。请注意，如果副本中每环剩余怪物数过多，其成绩将不会被记入排行榜。完成此副本时间最短的前100名玩家可以登上排行榜。",    --祝家庄排行榜
           TitleInfo =
            {
                   {LevelStart=1,LevelEnd=1,TitleID = 71},
                   {LevelStart=2,LevelEnd=3,TitleID = 72},
                   {LevelStart=4,LevelEnd=20,TitleID = 73},
                   {LevelStart=21,LevelEnd=50,TitleID = 74},
                   {LevelStart=51,LevelEnd=100,TitleID = 75}
            }
       	} ,
       {ClassName = "战场等级", ClassIndex = 2,TitleClassID = 17, Desc = "战场等级排行榜记录着真正的PK强者。玩家初始战场等级为500，战场等级超过500的玩家才有资格出现在排行榜上。参与阔亦田战场每胜利一场+1，每失败一场-1。战场等级最高的前100名玩家可以登上排行榜。",   --战场等级排行榜
       TitleInfo =
             {
                    {LevelStart=1,LevelEnd=1,TitleID = 51},
                    {LevelStart=2,LevelEnd=3,TitleID = 52},
                    {LevelStart=4,LevelEnd=20,TitleID = 53},
                    {LevelStart=21,LevelEnd=50,TitleID = 54},
                    {LevelStart=51,LevelEnd=100,TitleID = 55}
             }
        } ,
        {ClassName = "夏王墓", ClassIndex = 3,TitleClassID = 63, Index = 58, Desc = "夏王墓排行榜只有三番模式下才能入榜。请注意，如果副本中每环剩余怪物数过多，其成绩将不会被记入排行榜。完成此副本时间最短的前100名玩家可以登上排行榜。",   --战神墓排行榜
       TitleInfo =
             {
                    {LevelStart=1,LevelEnd=1,TitleID = 92},
                    {LevelStart=2,LevelEnd=3,TitleID = 93},
                    {LevelStart=4,LevelEnd=20,TitleID = 94},
                    {LevelStart=21,LevelEnd=50,TitleID = 95},
                    {LevelStart=51,LevelEnd=100,TitleID = 96}
             }
        } ,
        {ClassName = "放烟花", ClassIndex = 4,TitleClassID = 49, Desc = "燃放任何种类的烟花都将增长你在烟花排行榜内的分数，烂漫烟花分数最高的前100名玩家可以登上排行榜。",   --放烟花排行榜
           TitleInfo =
            {
                   {LevelStart=1,LevelEnd=1,TitleID = 46},
                   {LevelStart=2,LevelEnd=3,TitleID = 47},
                   {LevelStart=4,LevelEnd=20,TitleID = 48},
                   {LevelStart=21,LevelEnd=50,TitleID = 49},
                   {LevelStart=51,LevelEnd=100,TitleID = 50}
            }
       } ,
        {ClassName = "印度河", ClassIndex = 5,TitleClassID = 65, Index = 61, Desc = "印度河排行榜只有三番模式下才能入榜。请注意，如果副本中每环剩余怪物数过多，其成绩将不会被记入排行榜。完成此副本时间最短的前100名玩家可以登上排行榜。",   --印度神庙排行榜
           TitleInfo =
            {
                   {LevelStart=1,LevelEnd=1,TitleID = 97},
                   {LevelStart=2,LevelEnd=3,TitleID = 98},
                   {LevelStart=4,LevelEnd=20,TitleID = 99},
                   {LevelStart=21,LevelEnd=50,TitleID = 100},
                   {LevelStart=51,LevelEnd=100,TitleID = 101}
            }
       } ,
        {ClassName = "智力竞赛", ClassIndex = 6,TitleClassID = 37, Desc = "智力竞赛排行榜将累计一周每次智力竞赛的总分数，总分最高的前100名玩家可以登上排行榜。",   --智力竞赛
                TitleInfo =
                 {
                        {LevelStart=1,LevelEnd=1,TitleID = 31},
                        {LevelStart=2,LevelEnd=3,TitleID = 32},
                        {LevelStart=4,LevelEnd=20,TitleID = 33},
                        {LevelStart=21,LevelEnd=50,TitleID = 34},
                        {LevelStart=51,LevelEnd=100,TitleID = 35}
                 }
            } ,
        {ClassName = "轮回台", ClassIndex = 7,TitleClassID = 59, Index = 35, Desc = "轮回台排行榜记录着守卫国家轮回台的勇士。如果完成副本时剩余怪物数过多，其成绩将不会被记入排行榜。完成此副本时间最短的前100名玩家可以登上排行榜",  --轮回台
            TitleInfo =
             {
                    {LevelStart=1,LevelEnd=1,TitleID = 76},
                    {LevelStart=2,LevelEnd=3,TitleID = 77},
                    {LevelStart=4,LevelEnd=20,TitleID = 78},
                    {LevelStart=21,LevelEnd=50,TitleID = 79},
                    {LevelStart=51,LevelEnd=100,TitleID = 80}
             }
        } ,
		{ClassName = "玫瑰", ClassIndex = 8,TitleClassID = 31, Desc = "收到过玫瑰花的男女玩家将入驻玫瑰排行榜，任何玫瑰花都会增加1点恋爱指数，恋爱指数最高的前100名玩家可以登上排行榜。",    --	玫瑰排行榜
           TitleInfo =
            {
                   {LevelStart=1,LevelEnd=1,TitleID = 26},
                   {LevelStart=2,LevelEnd=3,TitleID = 27},
                   {LevelStart=4,LevelEnd=20,TitleID = 28},
                   {LevelStart=21,LevelEnd=50,TitleID = 29},
                   {LevelStart=51,LevelEnd=100,TitleID = 30}
            }
		} ,
		{ClassName = "大教堂", ClassIndex = 9,TitleClassID = 61, Index = 64,Desc = "大教堂排行榜只有三番模式下才能入榜。请注意，如果副本中每环剩余怪物数过多，其成绩将不会被记入排行榜。完成此副本时间最短的前100名玩家可以登上排行榜。",    --	景教堂排行榜
           TitleInfo =
            {
                   {LevelStart=1,LevelEnd=1,TitleID = 111},
                   {LevelStart=2,LevelEnd=3,TitleID = 112},
                   {LevelStart=4,LevelEnd=20,TitleID = 113},
                   {LevelStart=21,LevelEnd=50,TitleID = 114},
                   {LevelStart=51,LevelEnd=100,TitleID = 91}
            }
		} ,
        {ClassName = "神龙宝藏", ClassIndex = 10,TitleClassID = 43, Desc = "神龙宝藏排行榜会记录下寻宝数量最多的探宝家，每使用一张神龙藏宝图挖掘宝藏都将被记录，挖宝次数最高的前100名玩家可以登上排行榜。",  		--神龙宝藏排行榜 

           TitleInfo =
            {
                   {LevelStart=1,LevelEnd=1,TitleID = 36},
                   {LevelStart=2,LevelEnd=3,TitleID = 37},
                   {LevelStart=4,LevelEnd=20,TitleID = 38},
                   {LevelStart=21,LevelEnd=50,TitleID = 39},
                   {LevelStart=51,LevelEnd=100,TitleID = 40}
            }
       } ,
       
	    {ClassName = "囚龙岛", ClassIndex = 11,TitleClassID = 51, Index = 52 ,Desc = "囚龙岛排行榜只有三番模式下才能入榜。请注意，如果副本中每环剩余怪物数过多，其成绩将不会被记入排行榜。完成此副本时间最短的前100名玩家可以登上排行榜。", --囚龙岛海滩排行榜
                TitleInfo =
                 {
                        {LevelStart=1,LevelEnd=1,TitleID = 56},
                        {LevelStart=2,LevelEnd=3,TitleID = 57},
                        {LevelStart=4,LevelEnd=20,TitleID = 58},
                        {LevelStart=21,LevelEnd=50,TitleID = 59},
                        {LevelStart=51,LevelEnd=100,TitleID = 60}
                 }
            } ,
	    
		{ClassName = "屠龙", ClassIndex = 12,TitleClassID = 45, Desc = "屠龙排行榜会记录下真正的屠龙勇士，每杀死一只天龙之魂都将增加你的屠龙数，屠龙数最高的前100名玩家可以登上排行榜。",   --屠龙排行榜
		
           TitleInfo =
            {
                   {LevelStart=1,LevelEnd=1,TitleID = 41},
                   {LevelStart=2,LevelEnd=3,TitleID = 42},
                   {LevelStart=4,LevelEnd=20,TitleID = 43},
                   {LevelStart=21,LevelEnd=50,TitleID = 44},
                   {LevelStart=51,LevelEnd=100,TitleID = 45}
            }
       } ,     
       {ClassName = "和氏璧", ClassIndex = 13,TitleClassID = 53, Index = 45,Desc = "和氏璧排行榜只有三番模式下才能入榜。请注意，如果副本中每环剩余怪物数过多，其成绩将不会被记入排行榜。完成此副本时间最短的前100名玩家可以登上排行榜。",   --和氏璧排行榜
           TitleInfo =
            {
                   {LevelStart=1,LevelEnd=1,TitleID = 61},
                   {LevelStart=2,LevelEnd=3,TitleID = 62},
                   {LevelStart=4,LevelEnd=20,TitleID = 63},
                   {LevelStart=21,LevelEnd=50,TitleID = 64},
                   {LevelStart=51,LevelEnd=100,TitleID = 65}
            }
       } ,
       {ClassName = "小喇叭", ClassIndex = 14,TitleClassID = 47,  --"用小喇叭尽情的表达您的高谈阔论吧！您的声音将传遍整个世界！使用小喇叭广播次数最多的前100名玩家可以登上排行榜。",
                TitleInfo =
                 {
                        {LevelStart=1,LevelEnd=1,TitleID = 102},
                        {LevelStart=2,LevelEnd=3,TitleID = 103},
                        {LevelStart=4,LevelEnd=20,TitleID = 104},
                        {LevelStart=21,LevelEnd=50,TitleID = 105},
                        {LevelStart=51,LevelEnd=100,TitleID = 106}
                 }
            } ,
       {ClassName = "赤血号", ClassIndex = 15,TitleClassID = 55, Index = 46,Desc = "赤血号排行榜只有三番模式下才能入榜。请注意，如果副本中每环剩余怪物数过多，其成绩将不会被记入排行榜。完成此副本时间最短的前100名的玩家可以登上排行榜。",   --对马岛排行榜

           TitleInfo =
            {
                   {LevelStart=1,LevelEnd=1,TitleID = 66},
                   {LevelStart=2,LevelEnd=3,TitleID = 67},
                   {LevelStart=4,LevelEnd=20,TitleID = 68},
                   {LevelStart=21,LevelEnd=50,TitleID = 69},
                   {LevelStart=51,LevelEnd=100,TitleID = 70}
            }
       } ,
        {ClassName = "杀敌", ClassIndex = 16,TitleClassID = 15, Desc = "杀敌排行榜记录着异国有效杀敌数最多的勇士们。杀死不低于自己等级20级以上的异国玩家才能增加杀敌数，如果2小时内杀死同一个异国玩家超过10次，则再次杀死该玩家将不再增加杀敌数。有效杀敌数最多的前100名玩家可以登上排行榜。",  --杀敌
            TitleInfo =
             {
                    {LevelStart=1,LevelEnd=1,TitleID = 21},
                    {LevelStart=2,LevelEnd=3,TitleID = 22},
                    {LevelStart=4,LevelEnd=20,TitleID = 23},
                    {LevelStart=21,LevelEnd=50,TitleID = 24},
                    {LevelStart=51,LevelEnd=100,TitleID = 25}
             }
        },
	 }

x700081_g_RegisterFuben				= {--npc guid ==0 表示不直接挂NPC, fubentype=0:正常副本， fubentype=1, 试炼， fubentype=2,英雄
										{ id = 700107, npcguid = {145103,145103,145103,145103}, fubentype=0,loopindex=0},  			    -- 画皮
										{ id = 710000, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},  			    					-- 天赋副本_比武
										{ id = 700229, npcguid = {0,0,0,0}, fubentype=1,loopindex=0},                                   --【试炼】藏宝洞             
										{ id = 700206, npcguid = {0,0,0,0}, fubentype=1,loopindex=0},                                   --【试炼】景教堂             
										{ id = 700004, npcguid = {150503,150503,150503,150503}, fubentype=1,loopindex=2},               --【试炼】囚笼堡               
										{ id = 700022, npcguid = {123712,126011,129009,132011}, fubentype=1,loopindex=0},               --【试炼】轮回台             
										{ id = 700013, npcguid = {150535,150535,150535,150535}, fubentype=1,loopindex=2},               --【试炼】虚空境             
										{ id = 700221, npcguid = {0,0,0,0}, fubentype=1,loopindex=0},  					                --【试炼】战神墓             
										{ id = 700008, npcguid = {150511,150511,150511,150511}, fubentype=1,loopindex=2},               --【试炼】和氏璧           
										{ id = 700009, nid=700008,npcguid = {150509,150509,150509,150509}, fubentype=1,loopindex=2},               --【试炼】金銮殿          
										{ id = 700212, npcguid = {0,0,0,0}, fubentype=1,loopindex=0},                                   --【试炼】金矿洞             
										{ id = 700024, nid=700009,npcguid = {123744,126040,129041,132040}, fubentype=1, loopindex=1}, 				--【试炼】禁宫大内           
										{ id = 700108, nid=700027,npcguid = {123744,126040,129041,132040}, fubentype=1, loopindex=1}, 			    --【试炼】对马岛         
										{ id = 700109, npcguid = {0,0,0,0}, fubentype=1,loopindex=0},                                   --【试炼】赤血号            
										{ id = 700023, nid=700004,npcguid = {150501,150501,150501,150501}, fubentype=1,loopindex=2},               --【试炼】囚龙岭           
										{ id = 700028, nid=700023,npcguid = {123744,126040,129041,132040}, fubentype=1, loopindex=1},  			--【试炼】囚龙岛海滩          
										{ id = 700210, npcguid = {0,0,0,0}, fubentype=1,loopindex=2},                                   --【试炼】永夜天牢           
										{ id = 700027, nid=700109,npcguid = {150533,150533,150533,150533}, fubentype=1,loopindex=2},               --【试炼】水师大营 
										{ id = 700030, npcguid = {123744,126040,129041,132040}, fubentype=1, loopindex=1},  			--【试炼】三打祝家庄（一）            
										{ id = 700031, npcguid = {150551,150551,150551,150551}, fubentype=1,loopindex=2},  				--【试炼】三打祝家庄（二）  
										{ id = 700032, npcguid = {150553,150553,150553,150553}, fubentype=1,loopindex=2},  				--【试炼】三打祝家庄（三）             
										{ id = 700084, nid=700085,npcguid = {123744,126040,129041,132040}, fubentype=1, loopindex=1}, 			    --【试炼】探索战神墓（一）  
										{ id = 700085, nid=700086,npcguid = {150574,150574,150574,150574}, fubentype=1,loopindex=2},  				--【试炼】探索战神墓（二）             
										{ id = 700086, npcguid = {150575,150575,150575,150575}, fubentype=1,loopindex=2},  				--【试炼】探索战神墓（三）  
										{ id = 700087, nid=700088,npcguid = {123744,126040,129041,132040}, fubentype=1, loopindex=1},  			--【试炼】印度神庙（一）             
										{ id = 700088, nid=700089,npcguid = {150565,150565,150565,150565}, fubentype=1,loopindex=2},  				--【试炼】印度神庙（二）  
										{ id = 700089, npcguid = {150566,150566,150566,150566}, fubentype=1,loopindex=2},  				--【试炼】印度神庙（三）             
										{ id = 700090, nid=700091,npcguid = {123744,126040,129041,132040}, fubentype=1, loopindex=1},  			--【试炼】教堂的秘密（一）   
										{ id = 700091, nid=700092,npcguid = {150559,150559,150559,150559}, fubentype=1,loopindex=2},  				--【试炼】教堂的秘密（二） 
										{ id = 700092, npcguid = {150560,150560,150560,150560}, fubentype=1,loopindex=2},  				--【试炼】教堂的秘密（三） 
										{ id = 700001, npcguid = {140910,140910,140910,140910}, fubentype=0,loopindex=0},               --【队伍】钧窑绝迹        
										{ id = 700029, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},                                   --【队伍】藏宝洞          
										{ id = 700006, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},                                   --【队伍】景教堂          
										{ id = 700004, npcguid = {150503,150503,150503,150503}, fubentype=0,loopindex=2},               --【队伍】囚笼堡           
										{ id = 700022, npcguid = {123712,126011,129009,132011}, fubentype=0,loopindex=0,kind = 0, procPlayerEnter=1,procPlayerLeave = 1},               --【队伍】轮回台（经验）     
										{ id = 700022, npcguid = {123712,126011,129009,132011}, fubentype=0,loopindex=0,kind = 1, procPlayerEnter=1,procPlayerLeave = 1},               --【队伍】轮回台（声望）          
										{ id = 700022, npcguid = {123712,126011,129009,132011}, fubentype=0,loopindex=0,kind = 2, procPlayerEnter=1,procPlayerLeave = 1},               --【队伍】轮回台 (天赋80级以上）         
										{ id = 700106, npcguid = {145104,145104,145104,145104}, fubentype=0,loopindex=0},               --【队伍】倩女幽魂         
										{ id = 700013, npcguid = {150535,150535,150535,150535}, fubentype=0,loopindex=2},               --【队伍】虚空境          
										{ id = 700002, npcguid = {139023,139023,139023,139023}, fubentype=0,loopindex=0},               --【队伍】斗戏勾栏院   
										{ id = 700021, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},                                   --【队伍】战神墓          
										{ id = 700008, npcguid = {150511,150511,150511,150511}, fubentype=0,loopindex=2},               --【队伍】和氏璧        
										{ id = 700009,nid=700008, npcguid = {150507,150507,150507,150507}, fubentype=0,loopindex=2},  			    --【队伍】金銮殿       
										{ id = 700012, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},             					    --【队伍】金矿洞          
										{ id = 700024, nid=700009, npcguid = {0,0,0,0}, fubentype=0, loopindex=1},                      --【队伍】禁宫大内  
										{ id = 700108, nid=700027,npcguid = {0,0,0,0}, fubentype=0, loopindex=1},                       --【队伍】对马岛 
										{ id = 700109, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},                                   --【队伍】赤血号         
										{ id = 700025, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},                                   --【队伍】神秘墓穴        
										{ id = 700020, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},                                   --【队伍】神秘墓穴        
										{ id = 700019, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},                                   --【队伍】神秘墓穴        
										{ id = 700023, nid=700004,npcguid = {150501,150501,150501,150501}, fubentype=0,loopindex=2},    --【队伍】囚龙岭           
										{ id = 700028, nid=700023,npcguid = {123744,126040,129041,132040}, fubentype=0, loopindex=1},  	--【队伍】囚龙岛海滩          
										{ id = 700010, npcguid = {0,0,0,0}, fubentype=0,loopindex=2},                                   --【队伍】永夜天牢        
										{ id = 700030, npcguid = {123744,0,0,0}, fubentype=0, loopindex=1},                             --【队伍】三打祝家庄（一）
										{ id = 700031, npcguid = {150551,150551,150551,150551}, fubentype=0,loopindex=2},               --【队伍】三打祝家庄（二）
										{ id = 700032, npcguid = {150553,150553,150553,150553}, fubentype=0,loopindex=2},               --【队伍】三打祝家庄（三）
										{ id = 700027, nid=700109,npcguid = {150533,150533,150533,150533}, fubentype=0,loopindex=2},    --【队伍】水师大营  
										{ id = 700084, nid=700085,npcguid = {0,0,0,0}, fubentype=0, loopindex=1},                                  --【队伍】探索战神墓（一）
										{ id = 700085, nid=700086,npcguid = {150574,150574,150574,150574}, fubentype=0,loopindex=2},               --【队伍】探索战神墓（二）
										{ id = 700086, npcguid = {150575,150575,150575,150575}, fubentype=0,loopindex=2},               --【队伍】探索战神墓（三）
										{ id = 700087, nid=700088,npcguid = {0,0,0,0}, fubentype=0, loopindex=1},                       --【队伍】印度神庙（一）
										{ id = 700088, nid=700089,npcguid = {150565,150565,150565,150565}, fubentype=0,loopindex=2},    --【队伍】印度神庙（二）
										{ id = 700089, npcguid = {150566,150566,150566,150566}, fubentype=0,loopindex=2},               --【队伍】印度神庙（三）
										{ id = 700090, nid=700091,npcguid = {123744,0,0,0}, fubentype=0, loopindex=1},                             --【队伍】教堂的秘密（一）
										{ id = 700091, nid=700092,npcguid = {150559,150559,150559,150559}, fubentype=0,loopindex=2},               --【队伍】教堂的秘密（二）
										{ id = 700092, npcguid = {150560,150560,150560,150560}, fubentype=0,loopindex=2},               --【队伍】教堂的秘密（三）
										{ id = 700012, npcguid = {150581,150582,150583,150584}, fubentype=0,loopindex=0},               --【队伍】产出金矿洞
																														
										{ id = 700097, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},                                   --【队伍】藏宝洞1
										{ id = 700098, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},                                   --【队伍】藏宝洞2
										{ id = 700099, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},                                   --【队伍】藏宝洞3
										{ id = 700100, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},                                   --【队伍】藏宝洞4
										{ id = 700101, npcguid = {0,0,0,0}, fubentype=0,loopindex=0},                                   --【队伍】藏宝洞5
										{ id = 700102, npcguid = {123711,126010,129008,132010}, fubentype=0,loopindex=0},               --【队伍】藏宝洞6
										
										{ id = 700028, npcguid = {123744,126040,129041,132040}, fubentype=2, loopindex=1},              --【英雄】囚龙岛  
										{ id = 700023, npcguid = {150501,150501,150501,150501}, fubentype=2,loopindex=2},               --【英雄】囚龙城堡           
										{ id = 700004, npcguid = {150503,150503,150503,150503}, fubentype=2,loopindex=2},               --【英雄】龙穴
										{ id = 700024, npcguid = {123744,126040,129041,132040}, fubentype=2, loopindex=1},              --【英雄】禁宫大内 
										{ id = 700008, npcguid = {150507,150507,150507,150507}, fubentype=2,loopindex=2},               --【英雄】和氏璧           
										{ id = 700009, npcguid = {150509,150509,150509,150509}, fubentype=2,loopindex=2},               --【英雄】金銮殿
										{ id = 700108, npcguid = {123744,126040,129041,132040}, fubentype=2, loopindex=1},              --【英雄】对马岛            
										{ id = 700013, npcguid = {150535,150535,150535,150535}, fubentype=2,loopindex=2},               --【英雄】虚空境 
										{ id = 700027, npcguid = {150533,150533,150533,150533}, fubentype=2,loopindex=2},               --【英雄】水师大营 
										{ id = 700030, npcguid = {123744,126040,129041,132040}, fubentype=2, loopindex=1},              --【英雄】三打祝家庄（一）            
										{ id = 700031, npcguid = {150551,150551,150551,150551}, fubentype=2,loopindex=2},  			    --【英雄】三打祝家庄（二）  
										{ id = 700032, npcguid = {150553,150553,150553,150553}, fubentype=2,loopindex=2},  			    --【英雄】三打祝家庄（三） 
										{ id = 700084, npcguid = {123744,126040,129041,132040}, fubentype=2, loopindex=1},              --【英雄】探索战神墓（一）  
										{ id = 700085, npcguid = {150574,150574,150574,150574}, fubentype=2,loopindex=2},  			    --【英雄】探索战神墓（二）             
										{ id = 700086, npcguid = {150575,150575,150575,150575}, fubentype=2,loopindex=2},  			    --【英雄】探索战神墓（三）
										{ id = 700087, npcguid = {123744,126040,129041,132040}, fubentype=2, loopindex=1},              --【英雄】印度神庙（一）             
										{ id = 700088, npcguid = {150565,150565,150565,150565}, fubentype=2,loopindex=2},  			    --【英雄】印度神庙（二）  
										{ id = 700089, npcguid = {150566,150566,150566,150566}, fubentype=2,loopindex=2},  			    --【英雄】印度神庙（三）    
										{ id = 700090, npcguid = {123744,126040,129041,132040}, fubentype=2, loopindex=1},              --【英雄】教堂的秘密（一）   
										{ id = 700091, npcguid = {150559,150559,150559,150559}, fubentype=2,loopindex=2},  			    --【英雄】教堂的秘密（二） 
										{ id = 700092, npcguid = {150560,150560,150560,150560}, fubentype=2,loopindex=2},  			    --【英雄】教堂的秘密（三）

																				
									 }

x700081_g_FubenNameList				= {--副本名称
										"【队伍】画皮",
										"天赋副本_比武",
										"【试炼】藏宝洞",
										"【试炼】景教堂",
										"【个人】试炼囚笼堡",
										"【个人】试炼轮回台",
										"【个人】试炼虚空境",
										"【试炼】战神墓",
										"【个人】试炼和氏璧",
										"【个人】试炼金銮殿",
										"【试炼】金矿洞",
										"【个人】试炼和氏璧",
										"【个人】试炼赤血号",
										"【试炼】黄河坞",
										"【个人】试炼囚龙岭",
										"【个人】试炼囚龙岛",
										"【试炼】永夜天牢",
										"【个人】试炼水师大营",
										"【个人】试炼祝家庄",
										"【个人】试炼祝家庄（二）",
										"【个人】试炼祝家庄（三）",
										"【个人】试炼夏王墓",
										"【个人】试炼夏王陵",
										"【个人】试炼夏王墓",
										"【个人】试炼印度河",
										"【个人】试炼象神谷",
										"【个人】试炼印度神庙",
										"【个人】试炼大教堂",
										"【个人】试炼熔岩沼泽",
										"【个人】试炼大教堂",										
										"【队伍】钧窑绝迹",
										"【队伍】藏宝洞（水晶）",
										"【队伍】景教堂",
										"【队伍】囚笼堡",
										"【队伍】轮回台(经验)",
										"【队伍】轮回台(声望)",
										"【队伍】轮回台(天赋)",
										"【队伍】倩女幽魂",
										"【队伍】虚空境",
										"【队伍】斗戏勾栏院",
										"【队伍】战神墓",
										"【队伍】和氏璧",
										"【队伍】金銮殿",
										"【队伍】藏宝洞",
										"【队伍】和氏璧",
										"【队伍】赤血号",
										"【队伍】黄河坞",
										"【队伍】神秘墓穴",
										"【队伍】神秘墓穴",
										"【队伍】神秘墓穴",
										"【队伍】囚龙岭",
										"【队伍】囚龙岛",
										"【队伍】永夜天牢",
										"【队伍】三打祝家庄",
										"【队伍】三打祝家庄（二）",
										"【队伍】三打祝家庄（三）",
										"【队伍】水师大营",
										"【队伍】夏王墓",
										"【队伍】夏王陵",
										"【队伍】夏王墓",
										"【队伍】印度河",
										"【队伍】象神谷",
										"【队伍】印度神庙",
										"【队伍】大教堂",
										"【队伍】熔岩沼泽",
										"【队伍】大教堂",
										"【队伍】产出金矿洞", 
										"【队伍】藏宝洞（龙眼石）",
										"【队伍】藏宝洞（声望）",
										"【队伍】藏宝洞（金钱）",
										"【队伍】藏宝洞（图谱）",
										"【队伍】藏宝洞（材料）",
										"【队伍】藏宝洞",   
										"【队伍】挑战囚龙岛", 
										"【队伍】挑战囚龙城堡",            
										"【队伍】挑战龙穴",                
										"【队伍】挑战和氏璧",            
										"【队伍】挑战和氏璧",          
										"【队伍】挑战金銮殿",          
										"【队伍】挑战对马岛",          
										"【队伍】挑战虚空境",              
										"【队伍】挑战水师大营",          
										"【队伍】挑战祝家庄",    
										"【队伍】挑战祝家庄（二）",    
										"【队伍】挑战祝家庄（三）",    
										"【队伍】挑战夏王墓",    
										"【队伍】挑战夏王陵",    
										"【队伍】挑战夏王墓",    
										"【队伍】挑战印度神庙",     
										"【队伍】挑战象神谷",     
										"【队伍】挑战印度神庙",     
										                        
										"【队伍】挑战大教堂",    
										"【队伍】挑战熔岩沼泽",    
										"【队伍】挑战大教堂",    
										

									  }
									  
x700081_g_FubenClassMenu = {
									npcguid = {123744,126040,129041,132040},
									classmenu = 
									{
										{name = "【个人】试炼副本",fubentype = 1, mode = 0, },  --   
										{name = "【队伍】三环副本",fubentype = 0, mode = 0, },  --   
										{name = "【队伍】三环副本（三番令）",fubentype = 0, mode = 1, },  --   
--										{name = "【队伍】挑战副本",fubentype = 2, mode = 0, },  --   
									}
									
								}
								
x700081_g_CountModeList			= { --记次模式 0：不记次，1：日记次，2：周记次,  5: 总共次数
									2,	 --画皮
									1,	 --天赋副本_比武
									5,	 --【试炼】藏宝洞          
									5,   --【试炼】景教堂          
									5,   --【试炼】囚笼堡            
									5,   --【试炼】轮回台          
									5,   --【试炼】虚空境          
									5,   --【试炼】战神墓          
									5,   --【试炼】和氏璧        
									5,   --【试炼】金銮殿       
									5,   --【试炼】金矿洞          
									5,   --【试炼】禁宫大内        
									5,   --【试炼】对马岛      
									5,   --【试炼】赤血号         
									5,   --【试炼】囚龙岭        
									5,   --【试炼】囚龙岛海滩          
									5,   --【试炼】永夜天牢        
									5,   --【试炼】水师大营   
									5,   --【试炼】三打祝家庄（一）
									5,   --【试炼】三打祝家庄（二）
									5,   --【试炼】三打祝家庄（三）
									5,   --【试炼】探索战神墓（一）
									5,   --【试炼】探索战神墓（二）
									5,   --【试炼】探索战神墓（三）
									5,   --【试炼】印度神庙（一）
									5,   --【试炼】印度神庙（二）
									5,   --【试炼】印度神庙（三）
									5,   --【试炼】教堂的秘密（一）
									5,   --【试炼】教堂的秘密（二）
									5,   --【试炼】教堂的秘密（三）									   
									2,   --【队伍】钧窑绝迹        
									1,   --【队伍】藏宝洞          
									1,   --【队伍】景教堂          
									1,   --【队伍】囚笼堡            
									1,   --【队伍】轮回台(经验)          
									1,   --【队伍】轮回台(声望)
									1,   --【队伍】轮回台(天赋80级以上)
									2,   --【队伍】倩女幽魂
									1,   --【队伍】虚空境          
									2,   --【队伍】斗戏勾栏院      
									1,   --【队伍】战神墓          
									1,   --【队伍】和氏璧        
									1,   --【队伍】金銮殿       
									1,   --【队伍】金矿洞          
									2,   --【队伍】禁宫大内        
									2,   --【队伍】对马岛      
									1,   --【队伍】赤血号         
									1,   --【队伍】神秘墓穴        
									1,   --【队伍】神秘墓穴        
									1,   --【队伍】神秘墓穴        
									1,   --【队伍】囚龙岭        
									2,   --【队伍】囚龙岛海滩          
									1,   --【队伍】永夜天牢        
									2,   --【队伍】三打祝家庄（一）
									1,   --【队伍】三打祝家庄（二）
									1,   --【队伍】三打祝家庄（三）
									1,   --【队伍】水师大营    
									2,   --【队伍】探索战神墓（一）
									1,   --【队伍】探索战神墓（二）
									1,   --【队伍】探索战神墓（三）
									2,   --【队伍】印度神庙（一）
									1,   --【队伍】印度神庙（二）
									1,   --【队伍】印度神庙（三）
									2,   --【队伍】教堂的秘密（一）
									1,   --【队伍】教堂的秘密（二）
									1,   --【队伍】教堂的秘密（三）
									1,   --【队伍】产出金矿洞
																											
									1,   --【队伍】藏宝洞1
									1,   --【队伍】藏宝洞2
									1,   --【队伍】藏宝洞3
									1,   --【队伍】藏宝洞4
									1,   --【队伍】藏宝洞5
									1,   --【队伍】藏宝洞6
									
									0,	 --【英雄】囚龙岛", 
									0,	 --【英雄】囚龙城堡",            
									0,	 --【英雄】龙穴",                
									0,	 --【英雄】禁宫大内",            
									0,	 --【英雄】和氏璧",          
									0,	 --【英雄】金銮殿",          
									0,	 --【英雄】对马岛",          
									0,	 --【英雄】虚空境",              
									0,	 --【英雄】水师大营",          
									0,	 --【英雄】三打祝家庄（一）",    
									0,	 --【英雄】三打祝家庄（二）",    
									0,	 --【英雄】三打祝家庄（三）",    
									0,	 --【英雄】探索战神墓（一）",    
									0,	 --【英雄】探索战神墓（二）",    
									0,	 --【英雄】探索战神墓（三）",    
									0,	 --【英雄】印度神庙（一） ",     
									0,	 --【英雄】印度神庙（二） ",     
									0,	 --【英雄】印度神庙（三） ",     
									                       
									0,	 --【英雄】教堂的秘密（一）",    
									0,	 --【英雄】教堂的秘密（二）",    
									0,	 --【英雄】教堂的秘密（三）",  

                                  }                      

x700081_g_CountUntilList			= { --每天（周）进入最大次数
									1,   --画皮
									1,   --天赋副本_比武
									1,	 --【试炼】藏宝洞          
									1,   --【试炼】景教堂          
									1,   --【试炼】龙穴            
									1,   --【试炼】轮回台          
									1,   --【试炼】虚空境          
									1,   --【试炼】战神墓          
									1,   --【试炼】和氏璧        
									1,   --【试炼】金銮殿       
									1,   --【试炼】金矿洞          
									1,   --【试炼】禁宫大内        
									1,   --【试炼】对马岛      
									1,   --【试炼】赤血号         
									1,   --【试炼】囚龙城堡        
									1,   --【试炼】囚龙岛          
									1,   --【试炼】永夜天牢        
									1,   --【试炼】水师大营    
									1,   --【试炼】三打祝家庄（一）
									0,   --【试炼】三打祝家庄（二）
									0,   --【试炼】三打祝家庄（三）    
									1,   --【试炼】探索战神墓（一）
									0,   --【试炼】探索战神墓（二）
									0,   --【试炼】探索战神墓（三）
									1,   --【试炼】印度神庙（一）
									0,   --【试炼】印度神庙（二）
									0,   --【试炼】印度神庙（三）
									1,   --【试炼】教堂的秘密（一）
									0,   --【试炼】教堂的秘密（二）
									0,   --【试炼】教堂的秘密（三）									  
									1,   --【队伍】钧窑绝迹        
									5,   --【队伍】藏宝洞          
									5,   --【队伍】景教堂          
									0,   --【队伍】龙穴            
									1,   --【队伍】轮回台(经验)                
									1,   --【队伍】轮回台(声望)        
									1,   --【队伍】轮回台(天赋80级以上)
									1, --【队伍】倩女幽魂
									0,   --【队伍】虚空境          
									1,   --【队伍】斗戏勾栏院      
									5,   --【队伍】战神墓          
									0,   --【队伍】和氏璧        
									0,   --【队伍】金銮殿       
									5,   --【队伍】金矿洞          
									21,  --【队伍】禁宫大内        
									21,  --【队伍】对马岛      
									5,   --【队伍】赤血号         
									3,   --【队伍】神秘墓穴        
									3,   --【队伍】神秘墓穴        
									3,   --【队伍】神秘墓穴        
									0,   --【队伍】囚龙城堡        
									21,  --【队伍】囚龙岛          
									5,   --【队伍】永夜天牢        
									21,  --【队伍】三打祝家庄（一）
									0,   --【队伍】三打祝家庄（二）
									0,   --【队伍】三打祝家庄（三）
									0,   --【队伍】水师大营    
									21,  --【队伍】探索战神墓（一）
									0,   --【队伍】探索战神墓（二）
									0,   --【队伍】探索战神墓（三）
									21,  --【队伍】印度神庙（一）
									0,   --【队伍】印度神庙（二）
									0,   --【队伍】印度神庙（三）
									21,  --【队伍】教堂的秘密（一）
									0,   --【队伍】教堂的秘密（二）
									0,   --【队伍】教堂的秘密（三）
									5,   --【队伍】产出金矿洞
									
									5,  --【队伍】藏宝洞1
									5,  --【队伍】藏宝洞2 
									5,  --【队伍】藏宝洞3 
									5,  --【队伍】藏宝洞4 
									5,  --【队伍】藏宝洞5 
									5,  --【队伍】藏宝洞6 
									
									0,	 --【英雄】囚龙岛", 
									0,	 --【英雄】囚龙城堡",            
									0,	 --【英雄】龙穴",                
									0,	 --【英雄】禁宫大内",            
									0,	 --【英雄】和氏璧",          
									0,	 --【英雄】金銮殿",          
									0,	 --【英雄】对马岛",          
									0,	 --【英雄】虚空境",              
									0,	 --【英雄】水师大营",          
									0,	 --【英雄】三打祝家庄（一）",    
									0,	 --【英雄】三打祝家庄（二）",    
									0,	 --【英雄】三打祝家庄（三）",    
									0,	 --【英雄】探索战神墓（一）",    
									0,	 --【英雄】探索战神墓（二）",    
									0,	 --【英雄】探索战神墓（三）",    
									0,	 --【英雄】印度神庙（一） ",     
									0,	 --【英雄】印度神庙（二） ",     
									0,	 --【英雄】印度神庙（三） ",     
									0,	 --【英雄】教堂的秘密（一）",    
									0,	 --【英雄】教堂的秘密（二）",    
									0,	 --【英雄】教堂的秘密（三）",  								
  
									  }                      

x700081_g_LimitMembersList			= { --队伍最小人数
										3,  --画皮
										3,  --天赋副本_比武
										1,  --【试炼】藏宝洞          
										1,  --【试炼】景教堂          
										1,  --【试炼】龙穴            
										1,  --【试炼】轮回台          
										1,  --【试炼】虚空境          
										1,  --【试炼】战神墓          
										1,  --【试炼】和氏璧        
										1,  --【试炼】金銮殿       
										1,  --【试炼】金矿洞          
										1,  --【试炼】禁宫大内        
										1,  --【试炼】对马岛      
										1,  --【试炼】赤血号         
										1,  --【试炼】囚龙城堡        
										1,  --【试炼】囚龙岛          
										1,  --【试炼】永夜天牢        
										1,  --【试炼】水师大营  
										1,  --【试炼】三打祝家庄（一）
										1,  --【试炼】三打祝家庄（二）
										1,  --【试炼】三打祝家庄（三）
										1,  --【试炼】探索战神墓（一）
										1,  --【试炼】探索战神墓（二）
										1,  --【试炼】探索战神墓（三）
										1,  --【试炼】印度神庙（一）
										1,  --【试炼】印度神庙（二）
										1,  --【试炼】印度神庙（三）
										1,  --【试炼】教堂的秘密（一）
										1,  --【试炼】教堂的秘密（二）
										1,  --【试炼】教堂的秘密（三）										    
										3,  --【队伍】钧窑绝迹        
										3,  --【队伍】藏宝洞          
										3,  --【队伍】景教堂          
										3,  --【队伍】龙穴            
										3,  --【队伍】轮回台   
										3,  --【队伍】轮回台   
										3,  --【队伍】轮回台  
										3,  --【队伍】倩女幽魂   
										3,  --【队伍】虚空境          
										3,  --【队伍】斗戏勾栏院      
										3,  --【队伍】战神墓          
										3,  --【队伍】和氏璧        
										3,  --【队伍】金銮殿       
										3,  --【队伍】金矿洞          
										3,  --【队伍】禁宫大内        
										3,  --【队伍】对马岛      
										3,  --【队伍】赤血号         
										3,  --【队伍】神秘墓穴        
										3,  --【队伍】神秘墓穴        
										3,  --【队伍】神秘墓穴        
										3,  --【队伍】囚龙城堡        
										3,  --【队伍】囚龙岛          
										3,  --【队伍】永夜天牢        
										3,  --【队伍】三打祝家庄（一）
										3,  --【队伍】三打祝家庄（二）
										3,  --【队伍】三打祝家庄（三）
										3,  --【队伍】水师大营
										3,  --【队伍】探索战神墓（一）
										3,  --【队伍】探索战神墓（二）
										3,  --【队伍】探索战神墓（三）
										3,  --【队伍】印度神庙（一）
										3,  --【队伍】印度神庙（二）
										3,  --【队伍】印度神庙（三）
										3,  --【队伍】教堂的秘密（一）
										3,  --【队伍】教堂的秘密（二）
										3,  --【队伍】教堂的秘密（三）
										3,  --【队伍】产出金矿洞
																				
										3,  --【队伍】藏宝洞1
										3,  --【队伍】藏宝洞2
										3,  --【队伍】藏宝洞3
										3,  --【队伍】藏宝洞4
										3,  --【队伍】藏宝洞5
										3,  --【队伍】藏宝洞6
      
     									3,	 --【英雄】囚龙岛", 
										3,	 --【英雄】囚龙城堡",            
										3,	 --【英雄】龙穴",                
										3,	 --【英雄】禁宫大内",            
										3,	 --【英雄】和氏璧",          
										3,	 --【英雄】金銮殿",          
										3,	 --【英雄】对马岛",          
										3,	 --【英雄】虚空境",              
										3,	 --【英雄】水师大营",          
										3,	 --【英雄】三打祝家庄（一）",    
										3,	 --【英雄】三打祝家庄（二）",    
										3,	 --【英雄】三打祝家庄（三）",    
										3,	 --【英雄】探索战神墓（一）",    
										3,	 --【英雄】探索战神墓（二）",    
										3,	 --【英雄】探索战神墓（三）",    
										3,	 --【英雄】印度神庙（一） ",     
										3,	 --【英雄】印度神庙（二） ",     
										3,	 --【英雄】印度神庙（三） ",     
										3,	 --【英雄】教堂的秘密（一）",    
										3,	 --【英雄】教堂的秘密（二）",    
										3,	 --【英雄】教堂的秘密（三）", 
									  }                      


x700081_g_LevelRangeList				= {--进入副本等级限制
										{85, 160}, --画皮
										{80, 100}, --天赋副本_比武
										{160,160},   --【试炼】藏宝洞          
										{160,160},   --【试炼】景教堂          
										{20,160},   --【试炼】龙穴            
										{30,50},   --【试炼】轮回台          
										{50,160},   --【试炼】虚空境          
										{160,160},   --【试炼】战神墓          
										{40,160},   --【试炼】和氏璧        
										{40,160},   --【试炼】金銮殿       
										{160,160},   --【试炼】金矿洞          
										{40,60},   --【试炼】禁宫大内        
										{50,70},   --【试炼】对马岛      
										{50,160},   --【试炼】赤血号         
										{20,160},   --【试炼】囚龙城堡        
										{20,40},   --【试炼】囚龙岛          
										{160,160},   --【试炼】永夜天牢        
										{50,160},   --【试炼】水师大营   
										{60,80},   --【试炼】三打祝家庄（一）
										{60,160},   --【试炼】三打祝家庄（二）
										{60,160},   --【试炼】三打祝家庄（三）
										{35,55},  --【试炼】探索战神墓（一）
										{35,160},  --【试炼】探索战神墓（二）
										{35,160},  --【试炼】探索战神墓（三）
										{55,75},  --【试炼】印度神庙（一）
										{55,160},  --【试炼】印度神庙（二）
										{55,160},  --【试炼】印度神庙（三）
										{45,65},  --【试炼】教堂的秘密（一）
										{45,160},  --【试炼】教堂的秘密（二）
										{45,160},  --【试炼】教堂的秘密（三）	
										{65,160},   --【队伍】钧窑绝迹        
										{25,160},   --【队伍】藏宝洞          
										{40,160},   --【队伍】景教堂          
										{20,160},   --【队伍】龙穴            
										{30,160},   --【队伍】轮回台(经验)                  
										{30,160},   --【队伍】轮回台(声望)        
										{30,160},   --【队伍】轮回台(天赋80级以上)
										{85,160},   --【队伍】倩女幽魂
										{50,160},   --【队伍】虚空境          
										{65,160},   --【队伍】斗戏勾栏院      
										{30,160},   --【队伍】战神墓          
										{40,160},   --【队伍】和氏璧        
										{40,160},   --【队伍】金銮殿       
										{25,160},   --【队伍】金矿洞          
										{40,160},   --【队伍】禁宫大内        
										{50,160},   --【队伍】对马岛      
										{50,160},   --【队伍】赤血号         
										{40,160},   --【队伍】神秘墓穴        
										{40,160},   --【队伍】神秘墓穴        
										{40,160},   --【队伍】神秘墓穴        
										{20,160},   --【队伍】囚龙城堡        
										{20,160},   --【队伍】囚龙岛          
										{25,160},   --【队伍】永夜天牢        
										{60,160},   --【队伍】三打祝家庄（一）
										{60,160},   --【队伍】三打祝家庄（二）
										{60,160},   --【队伍】三打祝家庄（三）
										{50,160},   --【队伍】水师大营
										{35,160},  --【队伍】探索战神墓（一）
										{35,160},  --【队伍】探索战神墓（二）
										{35,160},  --【队伍】探索战神墓（三）
										{55,160},  --【队伍】印度神庙（一）
										{55,160},  --【队伍】印度神庙（二）
										{55,160},  --【队伍】印度神庙（三）
										{45,160},  --【队伍】教堂的秘密（一）
										{45,160},  --【队伍】教堂的秘密（二）
										{45,160},  --【队伍】教堂的秘密（三）
										{25,160},  --【队伍】产出金矿洞
																				
										{30,160},   --【队伍】藏宝洞1
										{25,160},   --【队伍】藏宝洞2
										{25,160},   --【队伍】藏宝洞3
										{40,160},   --【队伍】藏宝洞4
										{50,160},   --【队伍】藏宝洞5
										{25,160},   --【队伍】藏宝洞6
										
										{65,160},	 --【英雄】囚龙岛",160}, 
										{65,160},	 --【英雄】囚龙城堡",160},            
										{65,160},	 --【英雄】龙穴",160},                
										{75,160},	 --【英雄】禁宫大内",160},            
										{75,160},	 --【英雄】和氏璧",160},          
										{75,160},	 --【英雄】金銮殿",160},          
										{85,160},	 --【英雄】对马岛",160},          
										{85,160},	 --【英雄】虚空境",160},              
										{85,160},	 --【英雄】水师大营",160},          
										{95,160},	 --【英雄】三打祝家庄（一）",160},    
										{95,160},	 --【英雄】三打祝家庄（二）",160},    
										{95,160},	 --【英雄】三打祝家庄（三）",160},    
										{70,160},	 --【英雄】探索战神墓（一）",160},    
										{70,160},	 --【英雄】探索战神墓（二）",160},    
										{70,160},	 --【英雄】探索战神墓（三）",160},    
										{90,160},	 --【英雄】印度神庙（一） ",160},     
										{90,160},	 --【英雄】印度神庙（二） ",160},     
										{90,160},	 --【英雄】印度神庙（三） ",160},     
										{80,160},	 --【英雄】教堂的秘密（一）",160},    
										{80,160},	 --【英雄】教堂的秘密（二）",160},    
										{80,160},	 --【英雄】教堂的秘密（三）",160}, 
									
									  }                      

x700081_g_EnterTimeList				={--副本可进入时间段
										{ --画皮
											{min=0*60+0,   max=24*60+0},  
										},
										
										{ --天赋副本_比武
											{min=0*60+0,   max=24*60+0},  
										},
										
										{ --【试炼】藏宝洞                      
											{min=0*60+0,   max=24*60+0},  
										},

										{  --【试炼】景教堂                     
											{min=0*60+0,   max=24*60+0},  
										},

										{  --【试炼】龙穴                     
											{min=0*60+0,   max=24*60+0},  
										},

										{  --【试炼】轮回台                     
											{min=0*60+0,   max=24*60+0},  
										},

										{  --【试炼】虚空境                     
											{min=0*60+0,   max=24*60+0},  
										},

										{  --【试炼】战神墓                     
											{min=0*60+0,   max=24*60+0},  
										},

										{  --【试炼】和氏璧                     
											{min=0*60+0,   max=24*60+0},  
										},

										{  --【试炼】金銮殿                    
											{min=0*60+0,   max=24*60+0},  
										},

										{  --【试炼】金矿洞                     
											{min=0*60+0,   max=24*60+0},  
										},

										{  --【试炼】禁宫大内                     
											{min=0*60+0,   max=24*60+0},  
										},

										{  --【试炼】对马岛
											{min=0*60+0,   max=24*60+0},
										},

										{  --【试炼】赤血号                    
											{min=0*60+0,   max=24*60+0},  
										},

										{  --【试炼】囚龙城堡
											{min=0*60+0,  max=24*60+0}
										},

										{  --【试炼】囚龙岛
											{min=0*60+0,  max=24*60+0}
										},

										{  --【试炼】永夜天牢                     
											{min=0*60+0,   max=24*60+0},  
										},

										{  --【试炼】水师大营                     
											{min=0*60+0,   max=24*60+0},  
										},
										
										{ --【试炼】三打祝家庄（一）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【试炼】三打祝家庄（二）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【试炼】三打祝家庄（三）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【试炼】探索战神墓（一）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【试炼】探索战神墓（二）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【试炼】探索战神墓（三）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【试炼】印度神庙（一）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【试炼】印度神庙（二）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【试炼】印度神庙（三）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【试炼】教堂的秘密（一）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【试炼】教堂的秘密（二）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【试炼】教堂的秘密（三）
											{min=0*60+0,  max=24*60+0},
										},

										{  --【队伍】钧窑绝迹
											{min=0*60+0,  max=24*60+0},
										},

										{  --【队伍】藏宝洞
											{min=0*60+0,  max=24*60+0},
										},

										{  --【队伍】景教堂
											{min=0*60+0,  max=24*60+0},
										},

										{  --【队伍】龙穴
                                            {min=0*60+0,  max=24*60+0},
											--{min=11*60+0,  max=14*60+0},
                                            --{min=19*60+30,  max=24*60+0},

										},

										{  --【队伍】轮回台
                                            {min=11*60+30,  max=13*60+30},
                                            {min=20*60+30,  max=22*60+30},
										},
										{  --【队伍】轮回台
                                            {min=11*60+30,  max=13*60+30},
                                            {min=20*60+30,  max=22*60+30},
										},
										{  --【队伍】轮回台
                                            {min=11*60+30,  max=13*60+30},
                                            {min=20*60+30,  max=22*60+30},
										},
										{  --【队伍】倩女幽魂
                                            {min=0*60+0,   max=24*60+0},
										},
										{  --【队伍】虚空境
                                            {min=0*60+0,   max=24*60+0},  
										},

										{  --【队伍】斗戏勾栏院
											{min=0*60+0,  max=24*60+0},
										},

										{  --【队伍】战神墓
											{min=0*60+0,  max=24*60+0},
										},

										{  --【队伍】和氏璧
											{min=0*60+0,  max=24*60+0},
										},

										{  --【队伍】金銮殿
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】金矿洞
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】禁宫大内
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】对马岛
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】黄河坞
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】神秘墓穴(1)
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】神秘墓穴(2)
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】神秘墓穴(3)
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】囚龙城堡
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】囚龙岛
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】永夜天牢
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】三打祝家庄（一）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】三打祝家庄（二）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】三打祝家庄（三）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】水师大营
											{min=0*60+0,  max=24*60+0},
										},
										{ --【队伍】探索战神墓（一）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】探索战神墓（二）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】探索战神墓（三）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【队伍】印度神庙（一）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】印度神庙（二）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】印度神庙（三）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【队伍】教堂的秘密（一）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】教堂的秘密（二）
											{min=0*60+0,  max=24*60+0},
										},

										{ --【队伍】教堂的秘密（三）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【队伍】产出金矿洞
											{min=0*60+0,  max=24*60+0},
										},
																				
										{  --【队伍】藏宝洞1
											{min=0*60+0,  max=24*60+0},
										},
										{  --【队伍】藏宝洞2
											{min=0*60+0,  max=24*60+0},
										},
										{  --【队伍】藏宝洞3
											{min=0*60+0,  max=24*60+0},
										},
										{  --【队伍】藏宝洞4
											{min=0*60+0,  max=24*60+0},
										},
										{  --【队伍】藏宝洞5
											{min=0*60+0,  max=24*60+0},
										},
										{  --【队伍】藏宝洞6
											{min=0*60+0,  max=24*60+0},
										},
										
				
																				
										{ ----【英雄】囚龙岛
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】囚龙城堡
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】龙穴
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】禁宫大内
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】和氏璧
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】金銮殿
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】对马岛
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】虚空境
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】水师大营
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】三打祝家庄（一）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】三打祝家庄（二）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】三打祝家庄（三）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】探索战神墓（一）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】探索战神墓（二）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】探索战神墓（三）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】印度神庙（一）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】印度神庙（二）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】印度神庙（三）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】教堂的秘密（一）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】教堂的秘密（二）
											{min=0*60+0,  max=24*60+0},
										},
										{ --【英雄】教堂的秘密（三）
											{min=0*60+0,  max=24*60+0},
										},
									 }

x700081_g_EnterDayList				={--副本每周何时可进入
										{0,6}, --画皮       
										{0,1,2,3,4,5,6}, --天赋副本_比武       
										{0,1,2,3,4,5,6}, --【试炼】藏宝洞          
										{0,1,2,3,4,5,6}, --【试炼】景教堂          
										{0,1,2,3,4,5,6}, --【试炼】龙穴            
										{0,1,2,3,4,5,6}, --【试炼】轮回台          
										{0,1,2,3,4,5,6}, --【试炼】虚空境          
										{0,1,2,3,4,5,6}, --【试炼】战神墓          
										{0,1,2,3,4,5,6}, --【试炼】和氏璧        
										{0,1,2,3,4,5,6}, --【试炼】金銮殿       
										{0,1,2,3,4,5,6}, --【试炼】金矿洞          
										{0,1,2,3,4,5,6}, --【试炼】禁宫大内        
										{0,1,2,3,4,5,6}, --【试炼】对马岛      
										{0,1,2,3,4,5,6}, --【试炼】赤血号         
										{0,1,2,3,4,5,6}, --【试炼】囚龙城堡        
										{0,1,2,3,4,5,6}, --【试炼】囚龙岛          
										{0,1,2,3,4,5,6}, --【试炼】永夜天牢        
										{0,1,2,3,4,5,6}, --【试炼】水师大营  
										{0,1,2,3,4,5,6}, --【试炼】三打祝家庄（一）
										{0,1,2,3,4,5,6}, --【试炼】三打祝家庄（二）
										{0,1,2,3,4,5,6}, --【试炼】三打祝家庄（三）
										{0,1,2,3,4,5,6}, --【试炼】探索战神墓（一）
										{0,1,2,3,4,5,6}, --【试炼】探索战神墓（二）
										{0,1,2,3,4,5,6}, --【试炼】探索战神墓（三）
										{0,1,2,3,4,5,6}, --【试炼】印度神庙（一）
										{0,1,2,3,4,5,6}, --【试炼】印度神庙（二）
										{0,1,2,3,4,5,6}, --【试炼】印度神庙（三）
										{0,1,2,3,4,5,6}, --【试炼】教堂的秘密（一）
										{0,1,2,3,4,5,6}, --【试炼】教堂的秘密（二）
										{0,1,2,3,4,5,6}, --【试炼】教堂的秘密（三）										    
										{0,6},           --【队伍】钧窑绝迹        
										{0,1,2,3,4,5,6}, --【队伍】藏宝洞          
										{0,1,2,3,4,5,6}, --【队伍】景教堂          
										{0,1,2,3,4,5,6}, --【队伍】龙穴            
										{0,1,2,3,4,5,6}, --【队伍】轮回台(经验)                  
										{0,1,2,3,4,5,6}, --【队伍】轮回台(声望)                  
										{0,1,2,3,4,5,6}, --【队伍】轮回台(天赋80级以上)  
										{0,6}, --【队伍】倩女幽魂         
										{0,1,2,3,4,5,6}, --【队伍】虚空境          
										{0,6},           --【队伍】斗戏勾栏院      
										{0,1,2,3,4,5,6}, --【队伍】战神墓          
										{0,1,2,3,4,5,6}, --【队伍】和氏璧        
										{0,1,2,3,4,5,6}, --【队伍】金銮殿       
										{0,1,2,3,4,5,6}, --【队伍】金矿洞          
										{0,1,2,3,4,5,6}, --【队伍】禁宫大内        
										{0,1,2,3,4,5,6}, --【队伍】对马岛      
										{0,1,2,3,4,5,6}, --【队伍】赤血号         
										{0,1,2,3,4,5,6}, --【队伍】神秘墓穴        
										{0,1,2,3,4,5,6}, --【队伍】神秘墓穴        
										{0,1,2,3,4,5,6}, --【队伍】神秘墓穴        
										{0,1,2,3,4,5,6}, --【队伍】囚龙城堡        
										{0,1,2,3,4,5,6}, --【队伍】囚龙岛          
										{0,1,2,3,4,5,6}, --【队伍】永夜天牢        
										{0,1,2,3,4,5,6}, --【队伍】三打祝家庄（一）
										{0,1,2,3,4,5,6}, --【队伍】三打祝家庄（二）
										{0,1,2,3,4,5,6}, --【队伍】三打祝家庄（三）
										{0,1,2,3,4,5,6}, --【队伍】水师大营
										{0,1,2,3,4,5,6}, --【队伍】探索战神墓（一）
										{0,1,2,3,4,5,6}, --【队伍】探索战神墓（二）
										{0,1,2,3,4,5,6}, --【队伍】探索战神墓（三）
										{0,1,2,3,4,5,6}, --【队伍】印度神庙（一）
										{0,1,2,3,4,5,6}, --【队伍】印度神庙（二）
										{0,1,2,3,4,5,6}, --【队伍】印度神庙（三）
										{0,1,2,3,4,5,6}, --【队伍】教堂的秘密（一）
										{0,1,2,3,4,5,6}, --【队伍】教堂的秘密（二）
										{0,1,2,3,4,5,6}, --【队伍】教堂的秘密（三）
										{0,1,2,3,4,5,6}, --【队伍】产出金矿洞
																				
										{0,1,2,3,4,5,6}, --【队伍】藏宝洞1
										{0,1,2,3,4,5,6}, --【队伍】藏宝洞2
										{0,1,2,3,4,5,6}, --【队伍】藏宝洞3
										{0,1,2,3,4,5,6}, --【队伍】藏宝洞4
										{0,1,2,3,4,5,6}, --【队伍】藏宝洞5
										{0,1,2,3,4,5,6}, --【队伍】藏宝洞6 
																				
										{0,1,2,3,4,5,6}, --【英雄】囚龙岛",             
										{0,1,2,3,4,5,6}, --【英雄】囚龙城堡",           
										{0,1,2,3,4,5,6}, --【英雄】龙穴",               
										{0,1,2,3,4,5,6}, --【英雄】禁宫大内",           
										{0,1,2,3,4,5,6}, --【英雄】和氏璧",           
										{0,1,2,3,4,5,6}, --【英雄】金銮殿",           
										{0,1,2,3,4,5,6}, --【英雄】对马岛",         
										{0,1,2,3,4,5,6}, --【英雄】虚空境",             
										{0,1,2,3,4,5,6}, --【英雄】水师大营",         
										{0,1,2,3,4,5,6}, --【英雄】三打祝家庄（一）",   
										{0,1,2,3,4,5,6}, --【英雄】三打祝家庄（二）",   
										{0,1,2,3,4,5,6}, --【英雄】三打祝家庄（三）",   
										{0,1,2,3,4,5,6}, --【英雄】探索战神墓（一）",   
										{0,1,2,3,4,5,6}, --【英雄】探索战神墓（二）",   
										{0,1,2,3,4,5,6}, --【英雄】探索战神墓（三）",   
										{0,1,2,3,4,5,6}, --【英雄】印度神庙（一） ",    
										{0,1,2,3,4,5,6}, --【英雄】印度神庙（二） ",    
										{0,1,2,3,4,5,6}, --【英雄】印度神庙（三） ",    
										{0,1,2,3,4,5,6}, --【英雄】教堂的秘密（一）",   
										{0,1,2,3,4,5,6}, --【英雄】教堂的秘密（二）",   
										{0,1,2,3,4,5,6}, --【英雄】教堂的秘密（三）", 
										
									}

x700081_g_SceneMapNavPathList		= {--副本场景路径
										"fuben_huapi/fuben_huapi.nav",								--画皮             
										"fuben_lanyuezhixue/fuben_lanyuezhixue.nav",				--天赋副本_比武       
										"fuben_qianfoku/fuben_qianfoku.nav",						--【试炼】藏宝洞          
										"fuben_jingjiaotang/fuben_jingjiaotang.nav",                --【试炼】景教堂          
										"fuben_qiulongbao/fuben_qiulongbao.nav",                    --【试炼】囚笼堡           
										"fuben_lunhuitai/fuben_lunhuitai.nav",                      --【试炼】轮回台          
										"fuben_xukongjing/fuben_xukongjing.nav",                    --【试炼】虚空境          
										"fuben_zhanshenmu/fuben_zhanshenmu.nav",                    --【试炼】战神墓          
										"fuben_heshibi/fuben_heshibi.nav",                          --【试炼】和氏璧        
										"fuben_jinluandian/fuben_jinluandian.nav",                  --【试炼】金銮殿       
										"fuben_huangjinkuangdong/fuben_huangjinkuangdong.nav",      --【试炼】金矿洞          
										"fuben_jingongdanei/fuben_jingongdanei.nav",                --【试炼】禁宫大内        
										"fuben_duimadao/fuben_duimadao.nav",                        --【试炼】对马岛      
										"fuben_chixuehao/fuben_chixuehao.nav",                      --【试炼】赤血号         
										"fuben_qiulongling/fuben_qiulongling.nav",                  --【试炼】囚龙岭 
										"fuben_qiulongdaohaitan/fuben_qiulongdaohaitan.nav",        --【试炼】囚龙岛海滩        
										"fuben_yongyetianlao/fuben_yongyetianlao.nav",              --【试炼】永夜天牢        
										"fuben_shuishidaying/fuben_shuishidaying.nav",              --【试炼】水师大营  
										"fuben_zhujiazhuang/fuben_zhujiazhuang.nav",                --【试炼】三打祝家庄（一）
										"fuben_zhujiazhuang2/fuben_zhujiazhuang2.nav",              --【试炼】三打祝家庄（二）
										"fuben_zhujiazhuang3/fuben_zhujiazhuang3.nav",              --【试炼】三打祝家庄（三）
										"fuben_helanshangu/fuben_helanshangu.nav",                  --【试炼】探索战神墓（一）
										"fuben_xiawangling/fuben_xiawangling.nav",                  --【试炼】探索战神墓（二）
										"fuben_xiawangmu/fuben_xiawangmu.nav",                      --【试炼】探索战神墓（三）
										"fuben_beiyinduconglin/fuben_beiyinduconglin.nav",          --【试炼】印度神庙（一）
										"fuben_xiangshengu/fuben_xiangshengu.nav",                  --【试炼】印度神庙（二）
										"fuben_yindushenmiao/fuben_yindushenmiao.nav",              --【试炼】印度神庙（三）
										"fuben_maqueling/fuben_maqueling.nav",                      --【试炼】教堂的秘密（一）
										"fuben_rongyanzhaoze/fuben_rongyanzhaoze.nav",              --【试炼】教堂的秘密（二）
										"fuben_dajiaotang/fuben_dajiaotang.nav",                    --【试炼】教堂的秘密（三）										    
										"fuben_junyao/fuben_junyao.nav",                            --【队伍】钧窑绝迹        
										"fuben_qianfoku/fuben_qianfoku.nav",                        --【队伍】藏宝洞          
										"fuben_jingjiaotang/fuben_jingjiaotang.nav",                --【队伍】景教堂          
										"fuben_qiulongbao/fuben_qiulongbao.nav",                    --【队伍】囚笼堡             
										"fuben_lunhuitai/fuben_lunhuitai.nav",                      --【队伍】轮回台(经验)                  
										"fuben_lunhuitai/fuben_lunhuitai.nav",                      --【队伍】轮回台(声望)                  
										"fuben_lunhuitai/fuben_lunhuitai.nav",                      --【队伍】轮回台(天赋80级以上)          
										"fuben_qiannvyouhun/fuben_qiannvyouhun.nav",                      --【队伍】倩女幽魂         
										"fuben_xukongjing/fuben_xukongjing.nav",                    --【队伍】虚空境          
										"fuben_goulanqutai/fuben_goulanqutai.nav",                  --【队伍】斗戏勾栏院      
										"fuben_zhanshenmu/fuben_zhanshenmu.nav",                    --【队伍】战神墓          
										"fuben_heshibi/fuben_heshibi.nav",                          --【队伍】和氏璧        
										"fuben_jinluandian/fuben_jinluandian.nav",                  --【队伍】金銮殿       
										"fuben_huangjinkuangdong/fuben_huangjinkuangdong.nav",      --【队伍】金矿洞          
										"fuben_jingongdanei/fuben_jingongdanei.nav",                --【队伍】禁宫大内        
										"fuben_duimadao/fuben_duimadao.nav",               		    --【队伍】对马岛      
										"fuben_chixuehao/fuben_chixuehao.nav",                      --【队伍】赤血号         
										"fuben_pitianzhixue/fuben_pitianzhixue.nav",                --【队伍】神秘墓穴        
										"fuben_lanyuezhixue/fuben_lanyuezhixue.nav",                --【队伍】神秘墓穴        
										"fuben_zhurizhixue/fuben_zhurizhixue.nav",                  --【队伍】神秘墓穴        
										"fuben_qiulongling/fuben_qiulongling.nav",                  --【队伍】囚龙岭 
										"fuben_qiulongdaohaitan/fuben_qiulongdaohaitan.nav",        --【队伍】囚龙岛海滩           
										"fuben_yongyetianlao/fuben_yongyetianlao.nav",              --【队伍】永夜天牢        
										"fuben_zhujiazhuang/fuben_zhujiazhuang.nav",                --【队伍】三打祝家庄（一）
										"fuben_zhujiazhuang2/fuben_zhujiazhuang2.nav",              --【队伍】三打祝家庄（二）
										"fuben_zhujiazhuang3/fuben_zhujiazhuang3.nav",              --【队伍】三打祝家庄（三）
										"fuben_shuishidaying/fuben_shuishidaying.nav",    		    --【队伍】水师大营
										"fuben_helanshangu/fuben_helanshangu.nav",                  --【队伍】探索战神墓（一）
										"fuben_xiawangling/fuben_xiawangling.nav",                  --【队伍】探索战神墓（二）
										"fuben_xiawangmu/fuben_xiawangmu.nav",                      --【队伍】探索战神墓（三）
										"fuben_beiyinduconglin/fuben_beiyinduconglin.nav",          --【队伍】印度神庙（一）
										"fuben_xiangshengu/fuben_xiangshengu.nav",                  --【队伍】印度神庙（二）
										"fuben_yindushenmiao/fuben_yindushenmiao.nav",              --【队伍】印度神庙（三）
										"fuben_maqueling/fuben_maqueling.nav",                      --【队伍】教堂的秘密（一）
										"fuben_rongyanzhaoze/fuben_rongyanzhaoze.nav",              --【队伍】教堂的秘密（二）
										"fuben_dajiaotang/fuben_dajiaotang.nav",                    --【队伍】教堂的秘密（三）
										"fuben_huangjinkuangdong/fuben_huangjinkuangdong.nav",      --【队伍】产出金矿洞
										
										"fuben_qianfoku/fuben_qianfoku.nav",                        --【队伍】藏宝洞1
										"fuben_qianfoku/fuben_qianfoku.nav",                        --【队伍】藏宝洞2
										"fuben_qianfoku/fuben_qianfoku.nav",                        --【队伍】藏宝洞3
										"fuben_qianfoku/fuben_qianfoku.nav",                        --【队伍】藏宝洞4
										"fuben_qianfoku/fuben_qianfoku.nav",                        --【队伍】藏宝洞5
										"fuben_qianfoku/fuben_qianfoku.nav",                        --【队伍】藏宝洞6										
										
										"fuben_qiulongdao/fuben_qiulongdao.nav",                    --【英雄】囚龙岛          
										"fuben_qiulongchengbao/fuben_qiulongchengbao.nav",          --【英雄】囚龙城堡        
										"fuben_longxue/fuben_longxue.nav",                          --【英雄】龙穴            
										"fuben_donghaiyan/fuben_donghaiyan.nav",                    --【英雄】禁宫大内        
										"fuben_heshibi/fuben_heshibi.nav",                          --【英雄】和氏璧        
										"fuben_jinluandian/fuben_jinluandian.nav",                  --【英雄】金銮殿      
										"fuben_caishendian/fuben_caishendian.nav",                  --【英雄】对马岛 
								        "fuben_xukongjing/fuben_xukongjing.nav",                    --【英雄】虚空境  
										"fuben_zhuluojigongyuan/fuben_zhuluojigongyuan.nav",        --【英雄】水师大营
										"fuben_zhujiazhuang/fuben_zhujiazhuang.nav",                --【英雄】三打祝家庄（一）
										"fuben_zhujiazhuang2/fuben_zhujiazhuang2.nav",              --【英雄】三打祝家庄（二）
										"fuben_zhujiazhuang3/fuben_zhujiazhuang3.nav",              --【英雄】三打祝家庄（三）
										"fuben_helanshangu/fuben_helanshangu.nav",                  --【英雄】探索战神墓（一）
										"fuben_xiawangling/fuben_xiawangling.nav",                  --【英雄】探索战神墓（二）
										"fuben_xiawangmu/fuben_xiawangmu.nav",                      --【英雄】探索战神墓（三）
										"fuben_beiyinduconglin/fuben_beiyinduconglin.nav",          --【英雄】印度神庙（一）
										"fuben_xiangshengu/fuben_xiangshengu.nav",                  --【英雄】印度神庙（二） 
										"fuben_yindushenmiao/fuben_yindushenmiao.nav",              --【英雄】印度神庙（三） 
										"fuben_maqueling/fuben_maqueling.nav",                      --【英雄】教堂的秘密（一）
										"fuben_rongyanzhaoze/fuben_rongyanzhaoze.nav",              --【英雄】教堂的秘密（二）
										"fuben_dajiaotang/fuben_dajiaotang.nav",                    --【英雄】教堂的秘密（三）

									  }

x700081_g_FubenTypeList				= {--副本类型
										FUBEN_HUAPI,				  --画皮
										FUBEN_TIANFU,				  --天赋副本_比武 
										FUBEN_BAMIYANG,				  --【试炼】藏宝洞          
										FUBEN_DAWUSHI,                --【试炼】景教堂          
										FUBEN_DONGHAIHAIYAN,          --【试炼】龙穴            
										FUBEN_FUTUTA4,                --【试炼】轮回台          
										FUBEN_FUTUTA6,                --【试炼】虚空境          
										FUBEN_GUMU,                   --【试炼】战神墓          
										FUBEN_HESHIBI,         		  --【试炼】和氏璧        
										FUBEN_JINLUANDIAN,            --【试炼】金銮殿       
										FUBEN_HUANGJINKUANGDONG,      --【试炼】金矿洞          
										FUBEN_HUDI,                   --【试炼】禁宫大内        
										FUBEN_HUOCAISHENDIAN,         --【试炼】对马岛      
										FUBEN_HUOQIYING,              --【试炼】赤血号         
										FUBEN_LANLONGCHENGBAO,        --【试炼】囚龙城堡        
										FUBEN_QIULONGDAO,             --【试炼】囚龙岛          
										FUBEN_TIANJINGKENG,           --【试炼】永夜天牢        
										FUBEN_ZHULUOJI,               --【试炼】水师大营    
										FUBEN_ZHUJIAZHUANG1,          --【试炼】三打祝家庄（一）
										FUBEN_ZHUJIAZHUANG2,          --【试炼】三打祝家庄（二）
										FUBEN_ZHUJIAZHUANG3,          --【试炼】三打祝家庄（三）
										FUBEN_TANSUO_ZHANSHENMU_1,    --【试炼】探索战神墓（一）
										FUBEN_TANSUO_ZHANSHENMU_2,    --【试炼】探索战神墓（二）
										FUBEN_TANSUO_ZHANSHENMU_3,    --【试炼】探索战神墓（三）
										FUBEN_YINDUSHENMIAO1,         --【试炼】印度神庙（一）
										FUBEN_YINDUSHENMIAO2,         --【试炼】印度神庙（二）
										FUBEN_YINDUSHENMIAO3,         --【试炼】印度神庙（三）
										FUBEN_JIAOTANGMIMI1,          --【试炼】教堂的秘密（一）
										FUBEN_JIAOTANGMIMI2,          --【试炼】教堂的秘密（二）
										FUBEN_JIAOTANGMIMI3,          --【试炼】教堂的秘密（三）
										FUBEN_JUNYAOYAOKOU,           --【队伍】钧窑绝迹        
										FUBEN_BAMIYANG,               --【队伍】藏宝洞          
										FUBEN_DAWUSHI,                --【队伍】景教堂          
										FUBEN_DONGHAIHAIYAN,          --【队伍】龙穴            
										FUBEN_FUTUTA4,                --【队伍】轮回台 (经验)                 
										FUBEN_FUTUTA4,                --【队伍】轮回台 (声望)                 
										FUBEN_FUTUTA4,                --【队伍】轮回台 (天赋80级以上)         
										FUBEN_QIANNVYOUHUN,                --【队伍】倩女幽魂
										FUBEN_FUTUTA6,                --【队伍】虚空境          
										FUBEN_GOULANQUTAI,            --【队伍】斗戏勾栏院      
										FUBEN_GUMU,                   --【队伍】战神墓          
										FUBEN_HESHIBI,           	  --【队伍】和氏璧        
										FUBEN_JINLUANDIAN,            --【队伍】金銮殿       
										FUBEN_HUANGJINKUANGDONG,      --【队伍】金矿洞          
										FUBEN_HUDI,                   --【队伍】禁宫大内        
										FUBEN_HUOCAISHENDIAN,         --【队伍】对马岛      
										FUBEN_HUOQIYING,              --【队伍】赤血号         
										FUBEN_HUOSHANMUDI,            --【队伍】神秘墓穴        
										FUBEN_YONGYISENGLIN,          --【队伍】神秘墓穴        
										FUBEN_SHANGGUMIDAO,           --【队伍】神秘墓穴        
										FUBEN_LANLONGCHENGBAO,        --【队伍】囚龙城堡        
										FUBEN_QIULONGDAO,             --【队伍】囚龙岛          
										FUBEN_TIANJINGKENG,           --【队伍】永夜天牢        
										FUBEN_ZHUJIAZHUANG1,          --【队伍】三打祝家庄（一）
										FUBEN_ZHUJIAZHUANG2,          --【队伍】三打祝家庄（二）
										FUBEN_ZHUJIAZHUANG3,          --【队伍】三打祝家庄（三）
										FUBEN_ZHULUOJI,               --【队伍】水师大营
										FUBEN_TANSUO_ZHANSHENMU_1,    --【队伍】探索战神墓（一）
										FUBEN_TANSUO_ZHANSHENMU_2,    --【队伍】探索战神墓（二）
										FUBEN_TANSUO_ZHANSHENMU_3,    --【队伍】探索战神墓（三）
										FUBEN_YINDUSHENMIAO1,         --【队伍】印度神庙（一）
										FUBEN_YINDUSHENMIAO2,         --【队伍】印度神庙（二）
										FUBEN_YINDUSHENMIAO3,         --【队伍】印度神庙（三）
										FUBEN_JIAOTANGMIMI1,          --【队伍】教堂的秘密（一）
										FUBEN_JIAOTANGMIMI2,          --【队伍】教堂的秘密（二）
										FUBEN_JIAOTANGMIMI3,          --【队伍】教堂的秘密（三）
										FUBEN_HUANGJINKUANGDONG,      --【队伍】产出金矿洞
										FUBEN_QIANFOKU1,              --【队伍】藏宝洞1
										FUBEN_QIANFOKU2,              --【队伍】藏宝洞2
										FUBEN_QIANFOKU3,              --【队伍】藏宝洞3
										FUBEN_QIANFOKU4,              --【队伍】藏宝洞4
										FUBEN_QIANFOKU5,              --【队伍】藏宝洞5
										FUBEN_QIANFOKU6,              --【队伍】藏宝洞6
										
										FUBEN_QIULONGDAO,             --【英雄】囚龙岛",             
										FUBEN_LANLONGCHENGBAO,        --【英雄】囚龙城堡",           
										FUBEN_DONGHAIHAIYAN,          --【英雄】龙穴",               
										FUBEN_HUDI,                   --【英雄】禁宫大内",           
										FUBEN_HESHIBI,           	  --【英雄】和氏璧",           
										FUBEN_JINLUANDIAN,            --【英雄】金銮殿",           
										FUBEN_HUOCAISHENDIAN,         --【英雄】对马岛",         
										FUBEN_FUTUTA6,                --【英雄】虚空境",             
										FUBEN_ZHULUOJI,               --【英雄】水师大营",         
										FUBEN_ZHUJIAZHUANG1,          --【英雄】三打祝家庄（一）",   
										FUBEN_ZHUJIAZHUANG2,          --【英雄】三打祝家庄（二）",   
										FUBEN_ZHUJIAZHUANG3,          --【英雄】三打祝家庄（三）",   
										FUBEN_TANSUO_ZHANSHENMU_1,    --【英雄】探索战神墓（一）",   
										FUBEN_TANSUO_ZHANSHENMU_2,    --【英雄】探索战神墓（二）",   
										FUBEN_TANSUO_ZHANSHENMU_3,    --【英雄】探索战神墓（三）",   
										FUBEN_YINDUSHENMIAO1,         --【英雄】印度神庙（一） ",    
										FUBEN_YINDUSHENMIAO2,         --【英雄】印度神庙（二） ",    
										FUBEN_YINDUSHENMIAO3,         --【英雄】印度神庙（三） ",    
										FUBEN_JIAOTANGMIMI1,          --【英雄】教堂的秘密（一）",   
										FUBEN_JIAOTANGMIMI2,          --【英雄】教堂的秘密（二）",   
										FUBEN_JIAOTANGMIMI3,          --【英雄】教堂的秘密（三）", 
									  }		    
x700081_g_LimitTotalHoldTimeList	= {--副本可以存活的时间（单位：次数）
										540,	    --画皮
										540,	    --天赋副本_比武 
										540,		--【试炼】藏宝洞          
										540,        --【试炼】景教堂        
										180,        --【试炼】龙穴            
										540,        --【试炼】轮回台          
										540,        --【试炼】虚空境          
										540*5/2,        --【试炼】战神墓          
										240,        --【试炼】和氏璧        
										240,        --【试炼】金銮殿       
										540,        --【试炼】金矿洞          
										240,        --【试炼】禁宫大内        
										240,        --【试炼】对马岛      
										300,        --【试炼】赤血号         
										180,        --【试炼】囚龙城堡        
										180,        --【试炼】囚龙岛          
										540,        --【试炼】永夜天牢        
										240,        --【试炼】水师大营   
										540,        --【试炼】三打祝家庄（一）
										540,        --【试炼】三打祝家庄（二）
										540,        --【试炼】三打祝家庄（三）
										180,        --【试炼】探索战神墓（一）
										180,        --【试炼】探索战神墓（二）
										180,        --【试炼】探索战神墓（三）
										240,        --【试炼】印度神庙（一）
										240,        --【试炼】印度神庙（二）
										300,        --【试炼】印度神庙（三）
										240,        --【试炼】教堂的秘密（一）
										240,        --【试炼】教堂的秘密（二）
										300,        --【试炼】教堂的秘密（三）
																				   
										720,        --【队伍】钧窑绝迹        
										540,        --【队伍】藏宝洞          
										540,        --【队伍】景教堂          
										360,        --【队伍】龙穴            
										540,        --【队伍】轮回台 (经验)                 
										540,        --【队伍】轮回台 (声望)                 
										540,        --【队伍】轮回台 (天赋80级以上) 
										540,        --【队伍】倩女幽魂        
										540,        --【队伍】虚空境          
										540,        --【队伍】斗戏勾栏院      
										540*5/2,    --【队伍】战神墓          
										540,        --【队伍】和氏璧        
										540,        --【队伍】金銮殿       
										540,        --【队伍】金矿洞          
										540,        --【队伍】禁宫大内        
										540,        --【队伍】对马岛      
										540,  	    --【队伍】赤血号         
										540,        --【队伍】神秘墓穴        
										540,        --【队伍】神秘墓穴        
										540,        --【队伍】神秘墓穴        
										540,        --【队伍】囚龙城堡        
										540,        --【队伍】囚龙岛          
										540,        --【队伍】永夜天牢        
										540,        --【队伍】三打祝家庄（一）
										540,        --【队伍】三打祝家庄（二）
										540,        --【队伍】三打祝家庄（三）
										540,        --【队伍】水师大营
										540,        --【队伍】探索战神墓（一）
										540,        --【队伍】探索战神墓（二）
										540,        --【队伍】探索战神墓（三）
										540,        --【队伍】印度神庙（一）
										540,        --【队伍】印度神庙（二）
										540,        --【队伍】印度神庙（三）
										540,        --【队伍】教堂的秘密（一）
										540,        --【队伍】教堂的秘密（二）
										540,        --【队伍】教堂的秘密（三）
										540,        --【队伍】产出金矿洞
										                    
                    540,        --【队伍】藏宝洞1
                    540,        --【队伍】藏宝洞2
                    540,        --【队伍】藏宝洞3
                    540,        --【队伍】藏宝洞4
                    540,        --【队伍】藏宝洞5
                    540,        --【队伍】藏宝洞6
										
										540,	    --【英雄】囚龙岛",             
										540,        --【英雄】囚龙城堡",           
										540,        --【英雄】龙穴",               
										540,        --【英雄】禁宫大内",           
										540,        --【英雄】和氏璧",           
										540,        --【英雄】金銮殿",           
										540,        --【英雄】对马岛",         
										540,        --【英雄】虚空境",             
										540,        --【英雄】水师大营",         
										540,        --【英雄】三打祝家庄（一）",   
										540,        --【英雄】三打祝家庄（二）",   
										540,        --【英雄】三打祝家庄（三）",   
										540,        --【英雄】探索战神墓（一）",   
										540,        --【英雄】探索战神墓（二）",   
										540,        --【英雄】探索战神墓（三）",   
										540,        --【英雄】印度神庙（一） ",    
										540,        --【英雄】印度神庙（二） ",    
										540,        --【英雄】印度神庙（三） ",    
										540,        --【英雄】教堂的秘密（一）",   
										540,        --【英雄】教堂的秘密（二）",   
                    540,        --【英雄】教堂的秘密（三）",
									  }						


x700081_g_BackSceneList				= {--返回场景
										{40,40,40,40},	   --画皮        
										{50,150,250,350},	   --天赋副本_比武        
										{50,150,250,350},	  --【试炼】藏宝洞          
										{50,150,250,350},     --【试炼】景教堂            
										{50,150,250,350},     --【试炼】龙穴            
										{50,150,250,350},     --【试炼】轮回台          
										{50,150,250,350},     --【试炼】虚空境          
										{50,150,250,350},     --【试炼】战神墓          
										{50,150,250,350},     --【试炼】和氏璧        
										{50,150,250,350},     --【试炼】金銮殿       
										{50,150,250,350},     --【试炼】金矿洞          
										{50,150,250,350},     --【试炼】禁宫大内        
										{50,150,250,350},     --【试炼】对马岛      
										{50,150,250,350},     --【试炼】赤血号         
										{50,150,250,350},     --【试炼】囚龙城堡        
										{50,150,250,350},     --【试炼】囚龙岛          
										{50,150,250,350},     --【试炼】永夜天牢        
										{50,150,250,350},     --【试炼】水师大营     
										{50,150,250,350},     --【试炼】三打祝家庄（一）
										{50,150,250,350},     --【试炼】三打祝家庄（二）
										{50,150,250,350},     --【试炼】三打祝家庄（三）
										{50,150,250,350},     --【试炼】探索战神墓（一）
										{50,150,250,350},     --【试炼】探索战神墓（二）
										{50,150,250,350},     --【试炼】探索战神墓（三）
										{50,150,250,350},     --【试炼】印度神庙（一）
										{50,150,250,350},     --【试炼】印度神庙（二）
										{50,150,250,350},     --【试炼】印度神庙（三）
										{50,150,250,350},     --【试炼】教堂的秘密（一）
										{50,150,250,350},     --【试炼】教堂的秘密（二）
										{50,150,250,350},     --【试炼】教堂的秘密（三）
										                      
										{39,39,39,39},        --【队伍】钧窑绝迹        
										{50,150,250,350},     --【队伍】藏宝洞          
										{50,150,250,350},     --【队伍】景教堂          
										{50,150,250,350},     --【队伍】龙穴            
										{50,150,250,350},     --【队伍】轮回台 (经验)                 
										{50,150,250,350},     --【队伍】轮回台 (声望)                 
										{50,150,250,350},     --【队伍】轮回台 (天赋80级以上)
										{40,40,40,40},     --【队伍】倩女幽魂         
										{50,150,250,350},     --【队伍】虚空境          
										{39,39,39,39},        --【队伍】斗戏勾栏院      
										{50,150,250,350},     --【队伍】战神墓          
										{50,150,250,350},     --【队伍】和氏璧        
										{50,150,250,350},     --【队伍】金銮殿       
										{50,150,250,350},     --【队伍】金矿洞          
										{50,150,250,350},     --【队伍】禁宫大内        
										{50,150,250,350},     --【队伍】对马岛      
										{50,150,250,350},     --【队伍】赤血号         
										{50,150,250,350},     --【队伍】神秘墓穴        
										{50,150,250,350},     --【队伍】神秘墓穴        
										{50,150,250,350},     --【队伍】神秘墓穴        
										{50,150,250,350},     --【队伍】囚龙城堡        
										{50,150,250,350},     --【队伍】囚龙岛          
										{50,150,250,350},     --【队伍】永夜天牢        
										{50,150,250,350},     --【队伍】三打祝家庄（一）
										{50,150,250,350},     --【队伍】三打祝家庄（二）
										{50,150,250,350},     --【队伍】三打祝家庄（三）
										{50,150,250,350},     --【队伍】水师大营
										{50,150,250,350},     --【队伍】探索战神墓（一）
										{50,150,250,350},     --【队伍】探索战神墓（二）
										{50,150,250,350},     --【队伍】探索战神墓（三）
										{50,150,250,350},     --【队伍】印度神庙（一）
										{50,150,250,350},     --【队伍】印度神庙（二）
										{50,150,250,350},     --【队伍】印度神庙（三）
										{50,150,250,350},     --【队伍】教堂的秘密（一）
										{50,150,250,350},     --【队伍】教堂的秘密（二）
										{50,150,250,350},     --【队伍】教堂的秘密（三）
										{50,150,250,350},     --【队伍】产出金矿洞
																				  
										{50,150,250,350},     --【队伍】藏宝洞1
										{50,150,250,350},     --【队伍】藏宝洞2
										{50,150,250,350},     --【队伍】藏宝洞3
										{50,150,250,350},     --【队伍】藏宝洞4
										{50,150,250,350},     --【队伍】藏宝洞5
										{50,150,250,350},     --【队伍】藏宝洞6 
																				            
										{50,150,250,350},     --【英雄】囚龙岛",                  
										{50,150,250,350},     --【英雄】囚龙城堡",                
										{50,150,250,350},     --【英雄】龙穴",                    
										{50,150,250,350},     --【英雄】禁宫大内",                
										{50,150,250,350},     --【英雄】和氏璧",                
										{50,150,250,350},     --【英雄】金銮殿",                
										{50,150,250,350},     --【英雄】对马岛",              
										{50,150,250,350},     --【英雄】虚空境",                  
										{50,150,250,350},     --【英雄】水师大营",              
										{50,150,250,350},     --【英雄】三打祝家庄（一）",        
										{50,150,250,350},     --【英雄】三打祝家庄（二）",        
										{50,150,250,350},     --【英雄】三打祝家庄（三）",        
										{50,150,250,350},     --【英雄】探索战神墓（一）",        
										{50,150,250,350},     --【英雄】探索战神墓（二）",        
										{50,150,250,350},     --【英雄】探索战神墓（三）",        
										{50,150,250,350},     --【英雄】印度神庙（一） ",         
										{50,150,250,350},     --【英雄】印度神庙（二） ",         
										{50,150,250,350},     --【英雄】印度神庙（三） ",         
										{50,150,250,350},     --【英雄】教堂的秘密（一）",        
										{50,150,250,350},     --【英雄】教堂的秘密（二）",        
										{50,150,250,350},     --【英雄】教堂的秘密（三）",     
																				
										
									  }

x700081_md_List						= { -- md list
										{MD_FUBEN_GOULANQUTAI_DATE,MD_FUBEN_GOULANQUTAI_DAYCOUNT},					--画皮_比武        
										{MD_FUBEN_TIANFU_DATE, MD_FUBEN_TIANFU_DAYCOUNT},							--天赋副本_比武        

										{MD_FUBEN_TRY_BAMIYANG,MD_FUBEN_TRY_BAMIYANG},								--【试炼】藏宝洞          
										{MD_FUBEN_TRY_DAWUSHI,MD_FUBEN_TRY_DAWUSHI},                                --【试炼】景教堂          
										{MD_FUBEN_TRY_DONGHAIHAIYAN,MD_FUBEN_TRY_DONGHAIHAIYAN},                    --【试炼】龙穴            
										{MD_FUBEN_TRY_FUTUTA4,MD_FUBEN_TRY_FUTUTA4},                                --【试炼】轮回台          
										{MD_FUBEN_TRY_FUTUTA6,MD_FUBEN_TRY_FUTUTA6},                                --【试炼】虚空境          
										{MD_FUBEN_TRY_GUMU,MD_FUBEN_TRY_GUMU},                                      --【试炼】战神墓          
										{MD_FUBEN_TRY_HESHIBISHANG,MD_FUBEN_TRY_HESHIBISHANG},                      --【试炼】和氏璧        
										{MD_FUBEN_TRY_HESHIBIXIA,MD_FUBEN_TRY_HESHIBIXIA},                          --【试炼】金銮殿       
										{MD_FUBEN_TRY_HUANGJINKUANGDONG,MD_FUBEN_TRY_HUANGJINKUANGDONG},            --【试炼】金矿洞          
										{MD_FUBEN_TRY_HUDI,MD_FUBEN_TRY_HUDI},                                      --【试炼】禁宫大内        
										{MD_FUBEN_TRY_HUOCAISHENDIAN,MD_FUBEN_TRY_HUOCAISHENDIAN},                  --【试炼】对马岛      
										{MD_FUBEN_TRY_HUOQIYING,MD_FUBEN_TRY_HUOQIYING},                            --【试炼】赤血号         
										{MD_FUBEN_TRY_LANLONGCHENGBAO,MD_FUBEN_TRY_LANLONGCHENGBAO},                --【试炼】囚龙城堡        
										{MD_FUBEN_TRY_QIULONGDAO,MD_FUBEN_TRY_QIULONGDAO},                          --【试炼】囚龙岛          
										{MD_FUBEN_TRY_TIANJINGKENG,MD_FUBEN_TRY_TIANJINGKENG},                      --【试炼】永夜天牢        
										{MD_FUBEN_TRY_ZHULUOJI,MD_FUBEN_TRY_ZHULUOJI},                              --【试炼】水师大营    
										{MD_FUBEN_TRY_ZHUJIAZHUANG1,MD_FUBEN_TRY_ZHUJIAZHUANG1},                    --【试炼】三打祝家庄（一）
										{MD_FUBEN_TRY_ZHUJIAZHUANG2,MD_FUBEN_TRY_ZHUJIAZHUANG2},                    --【试炼】三打祝家庄（二）
										{MD_FUBEN_TRY_ZHUJIAZHUANG3,MD_FUBEN_TRY_ZHUJIAZHUANG3},                    --【试炼】三打祝家庄（三）          
										{MD_FUBEN_TRY_ZHANSHENMU1,MD_FUBEN_TRY_ZHANSHENMU1},       	                --【试炼】探索战神墓（一）        
										{MD_FUBEN_TRY_ZHANSHENMU2,MD_FUBEN_TRY_ZHANSHENMU2},                        --【试炼】探索战神墓（二）        
										{MD_FUBEN_TRY_ZHANSHENMU3,MD_FUBEN_TRY_ZHANSHENMU3},                        --【试炼】探索战神墓（三）        
										{MD_FUBEN_TRY_SHENMIAO1,MD_FUBEN_TRY_SHENMIAO1},          	                --【试炼】印度神庙（一）        
										{MD_FUBEN_TRY_SHENMIAO2,MD_FUBEN_TRY_SHENMIAO2},                            --【试炼】印度神庙（二）         
										{MD_FUBEN_TRY_SHENMIAO3,MD_FUBEN_TRY_SHENMIAO3},                            --【试炼】印度神庙（三）        
										{MD_FUBEN_TRY_JIAOTANG1,MD_FUBEN_TRY_JIAOTANG1},                            --【试炼】教堂的秘密（一）
										{MD_FUBEN_TRY_JIAOTANG2,MD_FUBEN_TRY_JIAOTANG2},                            --【试炼】教堂的秘密（二）
										{MD_FUBEN_TRY_JIAOTANG3,MD_FUBEN_TRY_JIAOTANG3},                            --【试炼】教堂的秘密（三）
										  
										{MD_FUBEN_JUNYAOYAOKOU_DATE,MD_FUBEN_JUNYAOYAOKOU_DAYCOUNT},					      --【队伍】钧窑绝迹        
										{MD_FUBEN_BAMIYANG_DATE,MD_FUBEN_BAMIYANG_DAYCOUNT},                        --【队伍】藏宝洞          
										{MD_FUBEN_DAWUSHI_DATE,MD_FUBEN_DAWUSHI_DAYCOUNT},                          --【队伍】景教堂          
										{MD_FUBEN_DONGHAIHAIYAN_DATE,MD_FUBEN_DONGHAIHAIYAN_DAYCOUNT},              --【队伍】龙穴            
										{MD_FUBEN_FUTUTA4_DATE,MD_FUBEN_FUTUTA4_DAYCOUNT},                          --【队伍】轮回台 (经验)                 
										{MD_FUBEN_FUTUTA4_DATE,MD_FUBEN_FUTUTA4_DAYCOUNT},                          --【队伍】轮回台 (声望)                 
										{MD_FUBEN_FUTUTA4_DATE,MD_FUBEN_FUTUTA4_DAYCOUNT},                          --【队伍】轮回台 (天赋80级以上)         
										{MD_FUBEN_JUNYAOYAOKOU_DATE,MD_FUBEN_JUNYAOYAOKOU_DAYCOUNT},                          --【队伍】倩女幽魂
										{MD_FUBEN_FUTUTA6_DATE,MD_FUBEN_FUTUTA6_DAYCOUNT},                          --【队伍】虚空境          
										{MD_FUBEN_GOULANQUTAI_DATE,MD_FUBEN_GOULANQUTAI_DAYCOUNT},                  --【队伍】斗戏勾栏院      
										{MD_FUBEN_GUMU_DATE,MD_FUBEN_GUMU_DAYCOUNT},                                --【队伍】战神墓          
										{MD_FUBEN_HESHIBISHANG_DATE,MD_FUBEN_HESHIBISHANG_DAYCOUNT},                --【队伍】和氏璧        
										{MD_FUBEN_HESHIBIXIA_DATE, MD_FUBEN_HESHIBIXIA_DAYCOUNT},                   --【队伍】金銮殿       
										{MD_FUBEN_HUANGJINKUANGDONG_DATE,MD_FUBEN_HUANGJINKUANGDONG_DAYCOUNT},      --【队伍】金矿洞          
										{MD_FUBEN_QIULONGDAO_DATE,MD_FUBEN_QIULONGDAO_DAYCOUNT, MD_FUBEN_QIULONGDAO_TODAY, MD_FUBEN_QIULONGDAO_TODAYCOUNT},                    --【队伍】禁宫大内        
										{MD_FUBEN_QIULONGDAO_DATE,MD_FUBEN_QIULONGDAO_DAYCOUNT, MD_FUBEN_QIULONGDAO_TODAY, MD_FUBEN_QIULONGDAO_TODAYCOUNT},                    --【队伍】对马岛      
										{MD_FUBEN_HUOQIYING_DATE,MD_FUBEN_HUOQIYING_DAYCOUNT},                      --【队伍】赤血号         
										{MD_FUBEN_YONGYISENGLIN_DATE,MD_FUBEN_YONGYISENGLIN_DAYCOUNT},              --【队伍】神秘墓穴        
										{MD_FUBEN_YONGYISENGLIN_DATE,MD_FUBEN_YONGYISENGLIN_DAYCOUNT},              --【队伍】神秘墓穴        
										{MD_FUBEN_YONGYISENGLIN_DATE,MD_FUBEN_YONGYISENGLIN_DAYCOUNT},              --【队伍】神秘墓穴        
										{MD_FUBEN_LANLONGCHENGBAO_DATE,MD_FUBEN_LANLONGCHENGBAO_DAYCOUNT},          --【队伍】囚龙城堡        
										{MD_FUBEN_QIULONGDAO_DATE,MD_FUBEN_QIULONGDAO_DAYCOUNT, MD_FUBEN_QIULONGDAO_TODAY, MD_FUBEN_QIULONGDAO_TODAYCOUNT},                    --【队伍】囚龙岛          
										{MD_FUBEN_TIANJINGKENG_DATE,MD_FUBEN_TIANJINGKENG_DAYCOUNT},                --【队伍】永夜天牢        
										{MD_FUBEN_QIULONGDAO_DATE,MD_FUBEN_QIULONGDAO_DAYCOUNT, MD_FUBEN_QIULONGDAO_TODAY, MD_FUBEN_QIULONGDAO_TODAYCOUNT},                    --【队伍】三打祝家庄（一）
										{MD_FUBEN_ZHUJIAZHUANG2_DATE,MD_FUBEN_ZHUJIAZHUANG2_DAYCOUNT},              --【队伍】三打祝家庄（二）
										{MD_FUBEN_ZHUJIAZHUANG3_DATE,MD_FUBEN_ZHUJIAZHUANG3_DAYCOUNT},              --【队伍】三打祝家庄（三）
										{MD_FUBEN_ZHULUOJI_DATE,MD_FUBEN_ZHULUOJI_DAYCOUNT},                        --【队伍】水师大营             
										{MD_FUBEN_QIULONGDAO_DATE,MD_FUBEN_QIULONGDAO_DAYCOUNT, MD_FUBEN_QIULONGDAO_TODAY, MD_FUBEN_QIULONGDAO_TODAYCOUNT},       		        --【队伍】探索战神墓（一）        
										{MD_FUBEN_YONGYISENGLIN_DATE,MD_FUBEN_YONGYISENGLIN_DAYCOUNT},              --【队伍】探索战神墓（二）        
										{MD_FUBEN_YONGYISENGLIN_DATE,MD_FUBEN_YONGYISENGLIN_DAYCOUNT},              --【队伍】探索战神墓（三）        
										{MD_FUBEN_QIULONGDAO_DATE,MD_FUBEN_QIULONGDAO_DAYCOUNT, MD_FUBEN_QIULONGDAO_TODAY, MD_FUBEN_QIULONGDAO_TODAYCOUNT},          			--【队伍】印度神庙（一）        
										{MD_FUBEN_QIULONGDAO_DATE,MD_FUBEN_QIULONGDAO_DAYCOUNT},                    --【队伍】印度神庙（二）         
										{MD_FUBEN_TIANJINGKENG_DATE,MD_FUBEN_TIANJINGKENG_DAYCOUNT},                --【队伍】印度神庙（三）        
										{MD_FUBEN_QIULONGDAO_DATE,MD_FUBEN_QIULONGDAO_DAYCOUNT, MD_FUBEN_QIULONGDAO_TODAY, MD_FUBEN_QIULONGDAO_TODAYCOUNT},                    --【队伍】教堂的秘密（一）
										{MD_FUBEN_ZHUJIAZHUANG2_DATE,MD_FUBEN_ZHUJIAZHUANG2_DAYCOUNT},              --【队伍】教堂的秘密（二）
										{MD_FUBEN_ZHUJIAZHUANG3_DATE,MD_FUBEN_ZHUJIAZHUANG3_DAYCOUNT},              --【队伍】教堂的秘密（三）
										{MD_FUBEN_ZHULUOJI_DATE,MD_FUBEN_ZHULUOJI_DAYCOUNT},                        --【队伍】产出金矿洞    
										
										{MD_FUBEN_GUMU_DATE,MD_FUBEN_GUMU_DAYCOUNT},                                --【队伍】藏宝洞（龙眼石）
										{MD_FUBEN_TIANJINGKENG_DATE,MD_FUBEN_TIANJINGKENG_DAYCOUNT},                --【队伍】藏宝洞（声望）
										{MD_FUBEN_HUANGJINKUANGDONG_DATE,MD_FUBEN_HUANGJINKUANGDONG_DAYCOUNT},      --【队伍】藏宝洞（金钱）
										{MD_FUBEN_DAWUSHI_DATE,MD_FUBEN_DAWUSHI_DAYCOUNT},                          --【队伍】藏宝洞（图谱）
										{MD_FUBEN_HUOQIYING_DATE,MD_FUBEN_HUOQIYING_DAYCOUNT},                      --【队伍】藏宝洞（材料）
										{MD_FUBEN_HUANGJINKUANGDONG_DATE,MD_FUBEN_HUANGJINKUANGDONG_DAYCOUNT},      --【队伍】藏宝洞6
										
										
										
										
										--英雄模式不需要MD！
									  }




x700081_g_EnterInfoList				=	{--副本对话
											"\t灵妖异兽在修炼千年时会遇上天劫，度得过则原丹成型法力大增，度不过则会原丹碎裂魂飞魄灭。更有那些想借机吞食度劫的灵妖异兽灵力以增强自己修为的恶鬼修罗虎视眈眈，趁机夺取法力原丹。本有一只近千年修炼的白狐，无伤无害，渡天劫时却被妖魔堵截。此时，带领将士搜寻天地异像的王生经过此处，发现屋角的柴堆上卧着一只小白狐，嘴角流着丝丝血迹，看来受伤不轻。因不忍小白狐遭受恶鬼的残害，毅然出手相救。\n#Y开放时间：#W周六周日全天开放。\n#Y友情提示：#W挑战分三个阶段，四周的通道内会涌出各种喽罗阻碍你对BOSS的进攻，不提防特殊怪物可能会吃亏哦！组队进入可以提高副本的完成效率，Boss具有超强的伤害力，有治疗系的队友能更轻松游戏。\n#Y副本说明：#W副本存活时间为45分钟，请玩家在该时间内完成。",
											"--天赋副本_比武",
											
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得水晶奖励！",  --【试炼】藏宝洞

											"\t大巫师勃鲁合利用了两个王子重建旧部的野心，招揽了曾经的旧部，并用巫术把那些人变成了自己的信徒，势力渐渐延伸到了边塞，并占据了景教堂。\n\t迦色尼王对他们产生了警惕，带着迦色尼的勇士，包围了景教堂，却被巫法阻挡在了教堂之外……你需要进入教堂之中，尽快的把邪恶的巫师巴桑给驱逐出去。\n#Y开放时间：#W全天\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得制造材料奖励！",  --【试炼】景教堂
											
											"\t刚才击败的只是摩诃末的一个肉身而已，他的真身——三头凶蛟藏身于囚龙堡之中。只有消灭了三头凶蛟，才能真正消灭摩诃末！",  --【试炼】囚龙岭

											"\t为了查清和亲船队失踪的真相，太子利用萨满教的神秘力量创建轮回台，开启时空之门，却被人从中破坏，导致时空错乱，很多史前生物涌现，史前生物随时进攻王城，王城的安危遭受严重的威胁。\n\t太子召集王城的勇士进行抵抗，到轮回台阻止那些史前怪物，消灭一切用心邪恶的人！\n#Y开放时间：#W每天11点-14点，19点30分-24点开放，每天仅能进入一次！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得海量经验奖励！",  --【试炼】轮回台

											"\t贫道经过仔细探查，发现方才赤血号仅仅是通往金山大玉海所在之处的一个入口。赤血号，是金山大玉海灵气外泄所成，而此处，正是灵气最为浓密所在。且待贫道施展道法，将你们送往那里。",  --【试炼】虚空境

											"\t战神大旗被埋葬在战神墓之中，被人们称为战神的旭烈兀在死后，他的灵魂依旧守护者黄金家族的“战神大旗”。察八儿派遣了他最得力的手下，企图进入战神墓盗取战神大旗，以图提高窝阔台家族在黄金家族的地位。察八儿的手下在进入战神墓后，遇上了忽必烈汗派来的守护者。\n#Y开放时间：#W全天\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得龙眼石奖励！",  --【试炼】战神墓

											"\t和氏璧内封印了八位历代枭雄的魂魄。现在这八位枭雄蠢蠢欲动，企图破璧而出重返人间，快去阻止他们！",  --【试炼】和氏璧

											"\t陈理等率领手下的乱贼已经攻入了金銮殿，快去阻止他们的阴谋！\n#Y副本说明：#R敌对势力如果高于50，则会副本失败！",  --【试炼】禁宫大内

											"\t由于过量开采，惊扰了藏在地下了恶魔，金矿洞内的大量的矿工惨死，在矿洞附近的居民受到了生命威胁。赤老温家族奉大汗的命令，率领众勇士前往矿洞，驱逐敌对势力并杀死恶魔。\n#Y开放时间：#W全天\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得金钱奖励！",  --【试炼】金矿洞

											"\t唐末黄巢作乱，攻入长安，唐僖宗南逃入蜀，自秦始皇以来象征着至高无上皇权的玉玺——和氏璧竟然不知所踪。没有和氏璧者，不能一统天下，更不能长治久安，所以不久黄巢败亡，其后朱温篡唐，开始了王朝更替频繁、军阀混战不休的五代十国时期。偏安一隅的宋朝，与割据一方的辽、金、西夏、大理、吐蕃彼此攻伐征战。天下大乱达数百年之久。\n\t自唐末战乱时失落的玉玺和氏璧重现人间，落入成吉思汗之手，大元得以统一天下。但金国、西夏的皇族后裔，中原武林的明教盐帮，大元悍将王保保等人，妄图夺取和氏璧，以实现自己的野心。守卫和氏璧的大元怯薛军和这些野心家在皇宫内连番激战……\n\t保卫和氏璧，就是保卫大元，就是保卫天下的黎民百姓。\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【试炼】禁宫大内

											"\t日本武士盘踞在对马岛，阴谋对大元发起攻击。但这个阴谋被大元商人汪大渊获悉，并报给了忽必烈。忽必烈派大元勇士潜入对马岛，火烧日本舰船，消灭了聚集在岛上的日本武士，消除了大元的隐患！\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【试炼】对马岛

											"\t北条时宗的爪牙和羽翼都已经被翦除，现在是消灭他的时候了！",  --【试炼】赤血号

											"\t登陆囚龙岛海滩之后，是更加阴森恐怖的囚龙岭，摩诃末就躲在那里。勇士，去把他揪出来，斩首示众！",  --【试炼】囚龙岛海滩

											"\t成吉思汗西征时，花剌子模国王摩诃末逃到囚龙岛。因大海所阻，缺少渡船，蒙古军队只能望洋兴叹，率军而返。摩诃末积蓄力量，妄图卷土重来。护国法师丘处机发觉了他的阴谋，于是成吉思汗派出勇士登陆囚龙岛，经过激战，将摩诃末及其部下全部消灭。\n#Y开放时间：#W全天\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【试炼】囚龙岛

											"\t扎兰丁依靠着冰魄银晶获得了不死之身，最后被成吉思汗禁锢在了永夜天牢之中。永夜天牢的封印之力渐渐黯淡，被禁锢在天牢里的扎兰丁试图越狱，重建花剌子模国。\n\t国师苏德延吉儿得悉了扎兰丁的阴谋，派遣你这个王国最杰出的勇士进入永夜天牢，激活封印之力，并打败扎兰丁，从他身上夺得冰魄银晶。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得声望奖励！",  --【试炼】永夜天牢

											"\t前面就是北条时宗的水师大营，妄图侵犯大元的日本战船全都停泊在大营内。速速将这些战船全部烧毁，决不能让敌人的阴谋得逞！",  --【试炼】对马岛
											
											"\t那时迁人送绰号“鼓上蚤”，见众好汉顺利攻入，连忙施展“缩骨法”，逃出牢笼，祝家庄内机关重重，处处伏兵，时迁虽出牢笼却未能逃出火坑……\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【试炼】三打祝家庄（一）

											"\t本以为可以顺利救出时迁哥哥，不想半路又杀出这个“程咬金”来！看来我们非要二入祝家庄不可，听说那一丈青扈三娘善用异术，庄内五行碑便是她施法的根源。\n\t此庄方圆数里，又勾结官府欺压良民，今日前来正好将它连根拔起，庄内财物抬到山上，足够我等弟兄几年吃喝。\n\t只是怕我们破了那扈三娘的五行碑，他们早已抬走了财宝逃之夭夭，若不先破五行碑那扈三娘着实难以对付。\n\t这可如何是好？\n#Y小提示：\n\t#W扈三娘的能力来自五行碑，如果实力足够，可以选择#G尽量少的破坏五行碑#W，这样在击败扈三娘后会得到#G更丰厚的回报#W。",  --【试炼】三打祝家庄（二）

											"\t我乃神行太保戴宗，此次下山特为送信而来，公明哥哥已经向天禀明，祝家为富不仁，欺压良民，草菅人命，梁山今日之举实为替天行道，绝非滥杀无辜！\n\t这位兄弟，快随我一共杀进祝家庄！\n#Y小提示：\n\t#W如果能够在击败祝氏三兄弟之前击败扈三娘，那么你将会得到非常好的回报。",  --【试炼】三打祝家庄（三）

											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【试炼】探索战神墓（一）
											
											"\t前面就是夏王陵了，完颜洪烈手下的精锐都聚集在那里，千万要当心！",--【试炼】探索战神墓（一）
											
											"\t老贼完颜洪烈就在夏王墓穴中，速速将他消灭！",--【试炼】探索战神墓（三）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙…… \n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【试炼】印度神庙（一）
											
											"\t前面的象神谷，隐隐笼罩着一层迷雾，不知什么怪物潜伏其中。也不知有邪神庇护的札兰丁会耍出什么花招，千万要小心。",--【试炼】印度神庙（二）
											
											"\t札兰丁不死之身的秘密，就隐藏在前面的印度神庙之中！只要解开了这个秘密，不死战神札兰丁就会变成凡夫俗子，将会被轻而易举的击败！",--【试炼】印度神庙（二）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【试炼】教堂的秘密（一）
											
											"\t大元将士连战连捷，那些欧洲骑士已经溃不成军，我们应当乘胜追击，决不给敌人喘息之机！",--【试炼】教堂的秘密（二）
											
											"\t大元将士连战连捷，那些欧洲骑士已经溃不成军，我们应当乘胜追击，决不给敌人喘息之机！",--【试炼】教堂的秘密（三）
											
											
											
											

											"\t大都陶家一直有祖训，不得移动此壶，否则就会有妖兽出现，酿成天灾人祸。大奸臣哈嘛手下有一个偏将名叫律罗，因哈嘛大寿在即，又听说陶录一家有宝物，便不顾陶家人的阻拦，带人冲进了钧窑，见到炼妖壶后，一眼便看出此物并非凡品，动手去抢，突然间壶中烈焰突起，将这一干人卷入火海，烈焰腾起，劫火妖魔从壶中幻化而出。\n#Y开放时间：#W仅在每周六、日开放！每周只能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！还可以从陶录那里兑换神传钻石原石！",  --【队伍】钧窑绝迹

											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得水晶奖励！",   --【队伍】藏宝洞

											"\t大巫师勃鲁合利用了两个王子重建旧部的野心，招揽了曾经的旧部，并用巫术把那些人变成了自己的信徒，势力渐渐延伸到了边塞，并占据了景教堂。\n\t迦色尼王对他们产生了警惕，带着迦色尼的勇士，包围了景教堂，却被巫法阻挡在了教堂之外……你需要进入教堂之中，尽快的把邪恶的巫师巴桑给驱逐出去。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得制造材料奖励！",  --【队伍】景教堂

											"\t刚才击败的只是摩诃末的一个肉身而已，他的真身——三头凶蛟藏身于囚龙堡之中。只有消灭了三头凶蛟，才能真正消灭摩诃末！",  --【队伍】囚龙岭

											"\t为了查清和亲船队失踪的真相，太子利用萨满教的神秘力量创建轮回台，开启时空之门，却被人从中破坏，导致时空错乱，很多史前生物涌现，史前生物随时进攻王城，王城的安危遭受严重的威胁。\n\t太子召集王城的勇士进行抵抗，到轮回台阻止那些史前怪物，消灭一切用心邪恶的人！\n#Y开放时间：#W每天11点30分-13点30分，20点30分-22点30分开放，每天仅能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#G副本等级低于五十级时，王城将军将会派出王城中六大护卫协助各位勇士共同完成任务。#R不要放过任何一个怪物，否则可能会导致您无法进入排行榜，怪物到一定时间会消失，消失1个BOSS相当于消失2个小怪！\n#Y副本说明：#W在这个副本中，你可以获得海量经验！当队伍中最低等级的玩家和最高等级的玩家等级差大于等于15级时，怪物难度会大大降低！并且不会降低高级玩家所获得的经验！" ,  --【队伍】(经验)        
											"\t为了查清和亲船队失踪的真相，太子利用萨满教的神秘力量创建轮回台，开启时空之门，却被人从中破坏，导致时空错乱，很多史前生物涌现，史前生物随时进攻王城，王城的安危遭受严重的威胁。\n\t太子召集王城的勇士进行抵抗，到轮回台阻止那些史前怪物，消灭一切用心邪恶的人！\n#Y开放时间：#W每天11点30分-13点30分，20点30分-22点30分开放，每天仅能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#G副本等级低于五十级时，王城将军将会派出王城中六大护卫协助各位勇士共同完成任务。#R不要放过任何一个怪物，否则可能会导致您无法进入排行榜，怪物到一定时间会消失，消失1个BOSS相当于消失2个小怪！\n#Y副本说明：#W在这个副本中，你可以获得海量声望！当队伍中最低等级的玩家和最高等级的玩家等级差大于等于15级时，怪物难度会大大降低！并且不会降低高级玩家所获得的声望！" ,  --【队伍】(声望)        
											"\t为了查清和亲船队失踪的真相，太子利用萨满教的神秘力量创建轮回台，开启时空之门，却被人从中破坏，导致时空错乱，很多史前生物涌现，史前生物随时进攻王城，王城的安危遭受严重的威胁。\n\t太子召集王城的勇士进行抵抗，到轮回台阻止那些史前怪物，消灭一切用心邪恶的人！\n#Y开放时间：#W每天11点30分-13点30分，20点30分-22点30分开放，每天仅能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#G副本等级低于五十级时，王城将军将会派出王城中六大护卫协助各位勇士共同完成任务。#R不要放过任何一个怪物，否则可能会导致您无法进入排行榜，怪物到一定时间会消失，消失1个BOSS相当于消失2个小怪！\n#Y副本说明：#W在这个副本中，你可以获得海量天赋！当队伍中最低等级的玩家和最高等级的玩家等级差大于等于15级时，怪物难度会大大降低！并且不会降低高级玩家所获得的天赋！" ,  --【队伍】(天赋80级以上)
											"\t小倩本是兰若寺的女鬼，受树姥姥控制，为她捕猎男人的精血。心地善良的小倩奉命去勾落魄穷书生宁采臣时，发现酒色财气各种诱惑对他都完全不管用，反而一心只挂记别人安危。小倩被宁采臣感动，非但下不了手伤害他，并爱上了这个质朴憨厚的呆书生。在宁采臣知道小倩是女鬼时，也被她的善良和爱所感动，遂决定帮助她逃出树姥姥的控制。姥姥发现后大怒之下将小倩打入鬼门关。而宁采臣也毅然追入地府寻找小倩。阎王发现宁采臣时，因其乐善好施并阳寿未尽，不予追究。但聂小倩本为女鬼，被黑白无常所羁押。地府一痴情小鬼见二人阴阳相隔却情丝相连，不忍于心遂私自放走聂小倩。地府内是危难阻碍重重，小倩是否能安然逃脱黑白无常的追击与宁采臣重逢，还是未知之数！\n#Y开放时间：#W周六周日，每周仅能进入一次！\n#Y友情提示：#W消灭沿路出现的怪物才能继续前进，而每一次出现的鬼怪会依次递增！触发路边的指明灯可让追击的黑无常停留30秒。\n#Y副本说明：副本存活时间为45分钟，请玩家在该时间内完成。当黑无常追上聂小倩时副本失败！" ,  --【队伍】倩女幽魂

											"\t贫道经过仔细探查，发现方才赤血号仅仅是通往金山大玉海所在之处的一个入口。赤血号，是金山大玉海灵气外泄所成，而此处，正是灵气最为浓密所在。且待贫道施展道法，将你们送往那里。",  --【队伍】虚空境

											"\t大都之内喜气洋洋，张灯结彩，四大才子欲展平生所学，八月十五在勾栏院中将自己的平生之能尽现出来，不想竟遇到了戏中之戏……\n#Y开放时间：#W仅在每周六、日开放！每周只能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得海量经验奖励！还可能获得墨玉钻——第三孔打孔道具！",  --【队伍】斗戏勾栏院

											"\t战神大旗被埋葬在战神墓之中，被人们称为战神的旭烈兀在死后，他的灵魂依旧守护者黄金家族的“战神大旗”。察八儿派遣了他最得力的手下，企图进入战神墓盗取战神大旗，以图提高窝阔台家族在黄金家族的地位。察八儿的手下在进入战神墓后，遇上了忽必烈汗派来的守护者。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！有治疗系的队友能更轻松游戏！\n#Y副本说明：#W在这个副本中，你可以获得龙眼石奖励！",  --【队伍】战神墓

											"\t千百年来无数野心家想要得到这个镇国之宝和氏璧，围绕着它的争夺数不胜数，其中有八位野心家不肯承认自己的失败，一直执着地在留在和氏璧之内，只有击败他们才能让异象消失。",  --【队伍】和氏璧

											"\t恭喜你们，百年来从没有人能击败那八个野心家！现在，我将带你们进入金銮殿，如果你能通过金銮殿的考验，除了会得到非凡的奖励之外更有机会金銮殿，预知未来。\n#Y副本说明：#R敌对势力如果高于50，则会副本失败！",  --【队伍】金銮殿

											"\t由于过量开采，惊扰了藏在地下了恶魔，金矿洞内的大量的矿工惨死，在矿洞附近的居民受到了生命威胁。赤老温家族奉大汗的命令，率领众勇士前往矿洞，驱逐敌对势力并杀死恶魔。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得金钱奖励！",  --【队伍】金矿洞

											"\t宋金大战后，镇国之宝和氏璧流落民间，百年后突然出现在了东海海眼之中，找到和氏璧的人只要能够降伏隐藏于和氏璧之中的八位枭雄的魂魄就能够借助和氏璧的力量，预见未来百年之事。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】禁宫大内

											"\t日本武士盘踞在对马岛，阴谋对大元发起攻击。但这个阴谋被大元商人汪大渊获悉，并报给了忽必烈。忽必烈派大元勇士潜入对马岛，火烧日本舰船，消灭了聚集在岛上的日本武士，消除了大元的隐患！\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】对马岛

											"\t北条时宗的爪牙和羽翼都已经被翦除，现在是消灭他的时候了！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得制造材料奖励！",  --【队伍】水师大营

											"\t木华黎的揽月之杖，哲别的逐日之弓，速不台的劈天之斧是大草原最有价值的宝物，传闻这些宝物藏在以逐日、揽月、劈天三个标记的古迹之中。\n\t有人发现了这些古迹的入口，你的使命，便是到古迹之中探宝！一探究竟！\n#Y开放时间：#W国家发布！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】神秘墓穴

											"\t木华黎的揽月之杖，哲别的逐日之弓，速不台的劈天之斧是大草原最有价值的宝物，传闻这些宝物藏在以逐日、揽月、劈天三个标记的古迹之中。\n\t有人发现了这些古迹的入口，你的使命，便是到古迹之中探宝！一探究竟！\n#Y开放时间：#W国家发布！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】神秘墓穴

											"\t木华黎的揽月之杖，哲别的逐日之弓，速不台的劈天之斧是大草原最有价值的宝物，传闻这些宝物藏在以逐日、揽月、劈天三个标记的古迹之中。\n\t有人发现了这些古迹的入口，你的使命，便是到古迹之中探宝！一探究竟！\n#Y开放时间：#W国家发布！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】神秘墓穴

											"\t登陆囚龙岛海滩之后，是更加阴森恐怖的囚龙岭，摩诃末就躲在那里。勇士，去把他揪出来，斩首示众！",  --【队伍】囚龙岛海滩

											"\t自从郭宝玉将军战败于囚龙岛后，霹雳神火诀落入囚龙岛的魔龙军团手中，而随军大萨满临终前布下的结界随着时间的推移渐渐失效。一旦让魔龙军团脱困，霹雳神火诀将被欧洲诸国所利用，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t郭侃将军奉命前往囚龙岛调查祖父郭宝玉当年战败的原因，并取回遗失的“霹雳神火诀”，在这个时候，极度需要一群武艺高强，勇气十足的勇士，从囚龙岛进入龙穴，在魔龙的手中拿回“霹雳神火诀”。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】囚龙岛

											"\t扎兰丁依靠着冰魄银晶获得了不死之身，最后被成吉思汗禁锢在了永夜天牢之中。永夜天牢的封印之力渐渐黯淡，被禁锢在天牢里的扎兰丁试图越狱，重建花剌子模国。\n\t国师苏德延吉儿得悉了扎兰丁的阴谋，派遣你这个王国最杰出的勇士进入永夜天牢，激活封印之力，并打败扎兰丁，从他身上夺得冰魄银晶。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！有治疗系的队友能更轻松游戏。\n#Y副本说明：#W在这个副本中，你可以获得声望奖励！",  --【队伍】永夜天牢

											"\t那时迁人送绰号“鼓上蚤”，见众好汉顺利攻入，连忙施展“缩骨法”，逃出牢笼，祝家庄内机关重重，处处伏兵，时迁虽出牢笼却未能逃出火坑……\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得海量经验奖励！",  --【队伍】三打祝家庄（一）

											"\t本以为可以顺利救出时迁哥哥，不想半路又杀出这个“程咬金”来！看来我们非要二入祝家庄不可，听说那一丈青扈三娘善用异术，庄内五行碑便是她施法的根源。\n\t此庄方圆数里，又勾结官府欺压良民，今日前来正好将它连根拔起，庄内财物抬到山上，足够我等弟兄几年吃喝。\n\t只是怕我们破了那扈三娘的五行碑，他们早已抬走了财宝逃之夭夭，若不先破五行碑那扈三娘着实难以对付。\n\t这可如何是好？\n#Y小提示：\n\t#W扈三娘的能力来自五行碑，如果实力足够，可以选择#G尽量少的破坏五行碑#W，这样在击败扈三娘后会得到#G更丰厚的回报#W。",  --【队伍】三打祝家庄（二）

											"\t我乃神行太保戴宗，此次下山特为送信而来，公明哥哥已经向天禀明，祝家为富不仁，欺压良民，草菅人命，梁山今日之举实为替天行道，绝非滥杀无辜！\n\t这位兄弟，快随我一共杀进祝家庄！\n#Y小提示：\n\t#W如果能够在击败祝氏三兄弟之前击败扈三娘，那么你将会得到非常好的回报，#G九旄战神#W出现的概率也会#G显著提高#W。",  --【队伍】三打祝家庄（三）

											"\t前面就是北条时宗的水师大营，妄图侵犯大元的日本战船全都停泊在大营内。速速将这些战船全部烧毁，决不能让敌人的阴谋得逞！",  --【队伍】水师大营
											
											"\t前面就是夏王陵了，完颜洪烈手下的精锐都聚集在那里，千万要当心！",--【队伍】探索战神墓
											
											"\t前面就是夏王陵了，完颜洪烈手下的精锐都聚集在那里，千万要当心！",--【队伍】探索战神墓（一）
											
											"\t老贼完颜洪烈就在夏王墓穴中，速速将他消灭！",--【队伍】探索战神墓（三）
											
											"\t前面的象神谷，隐隐笼罩着一层迷雾，不知什么怪物潜伏其中。也不知有邪神庇护的札兰丁会耍出什么花招，千万要小心。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【队伍】印度神庙（一）
											
											"\t前面的象神谷，隐隐笼罩着一层迷雾，不知什么怪物潜伏其中。也不知有邪神庇护的札兰丁会耍出什么花招，千万要小心。",--【队伍】印度神庙（二）
											
											"\t札兰丁不死之身的秘密，就隐藏在前面的印度神庙之中！只要解开了这个秘密，不死战神札兰丁就会变成凡夫俗子，将会被轻而易举的击败！",--【队伍】印度神庙（二）
											
											"\t大元将士连战连捷，那些欧洲骑士已经溃不成军，我们应当乘胜追击，决不给敌人喘息之机！",--【队伍】教堂的秘密（一）
											
											"\t大元将士连战连捷，那些欧洲骑士已经溃不成军，我们应当乘胜追击，决不给敌人喘息之机！",--【队伍】教堂的秘密（二）
											
											"\t大元将士连战连捷，那些欧洲骑士已经溃不成军，我们应当乘胜追击，决不给敌人喘息之机！",--【队伍】教堂的秘密（三）
											
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得奖励！",--【队伍】产出金矿洞
																						
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得龙眼石奖励！",--【队伍】藏宝洞1  
											
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得声望奖励！",--【队伍】藏宝洞2 
											
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得金钱奖励！",--【队伍】藏宝洞3 
											
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得制造材料奖励！",--【队伍】藏宝洞4 
											
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得制造材料奖励！",--【队伍】藏宝洞5 
											
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得水晶、龙眼石、生活技能材料、银子等各种奖励！",--【队伍】藏宝洞6
											
											-- HERO TYPE
											"\t自从郭宝玉将军战败于囚龙岛后，霹雳神火诀落入囚龙岛的魔龙军团手中，而随军大萨满临终前布下的结界随着时间的推移渐渐失效。一旦让魔龙军团脱困，霹雳神火诀将被欧洲诸国所利用，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t郭侃将军奉命前往囚龙岛调查祖父郭宝玉当年战败的原因，并取回遗失的“霹雳神火诀”，在这个时候，极度需要一群武艺高强，勇气十足的勇士，从囚龙岛进入龙穴，在魔龙的手中拿回“霹雳神火诀”。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】囚龙岛
											"\t那些红鼻子蓝眼睛的欧洲大军？他们在塞浦路斯被我们打得屁滚尿流，我们最后却陷入了囚龙岛，被魔龙军团偷袭，没有一个人能活着离开！\n\t这批魔龙军团就在这个岛上的城堡里，他们甘愿服侍两只蓝色的恶龙！我们的士兵无法对付这种怪物！\n\t作为随军的萨满大法师，我燃烧了自己的生命，激活了最强大的禁锢结界，“霹雳神火诀”才不至于流传出去。\n\t我的勇士，进入囚龙城堡，去完成你的使命！",  --【英雄】囚龙城堡
											"\t龙穴位于囚龙城堡的海底之中，里面深藏着一只三头凶蛟和各种海底怪物。丢失的“霹雳神火诀”很有可能就在这洞穴之中。\n\t“霹雳神火诀”记载了最厉害的火器制作方法，一旦落入欧洲诸国手中，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t这关系到国家未来的安危，十分火急！你必须进入龙穴，为天下百姓解决这个巨大的隐患！",  --【英雄】龙穴
											"\t宋金大战后，镇国之宝和氏璧流落民间，百年后突然出现在了东海海眼之中，找到和氏璧的人只要能够降伏隐藏于和氏璧之中的八位枭雄的魂魄就能够借助和氏璧的力量，预见未来百年之事。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】禁宫大内
											"\t千百年来无数野心家想要得到这个镇国之宝和氏璧，围绕着它的争夺数不胜数，其中有八位野心家不肯承认自己的失败，一直执着地在留在和氏璧之内，只有击败他们才能让异象消失。",  --【队伍】和氏璧
											"\t恭喜你们，百年来从没有人能击败那八个野心家！现在，我将带你们进入金銮殿，如果你能通过金銮殿的考验，除了会得到非凡的奖励之外更有机会金銮殿，预知未来。\n#Y副本说明：#R敌对势力如果高于50，则会副本失败！",  --【队伍】金銮殿
											"\t日本武士盘踞在对马岛，阴谋对大元发起攻击。但这个阴谋被大元商人汪大渊获悉，并报给了忽必烈。忽必烈派大元勇士潜入对马岛，火烧日本舰船，消灭了聚集在岛上的日本武士，消除了大元的隐患！\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】对马岛
											"\t贫道经过仔细探查，发现方才赤血号仅仅是通往金山大玉海所在之处的一个入口。赤血号，是金山大玉海灵气外泄所成，而此处，正是灵气最为浓密所在。且待贫道施展道法，将你们送往那里。",  --【队伍】虚空境
											"\t方才贫道已经施法打开了此处与金山大玉海所在之地的封印，但是……贫道万万没有想到，那里竟然渺无人迹，只有无数凶兽横行。\n\t按照贫道的推算，这奇异之地的时光应当是亿年之前，盘古开天辟地之后的蛮荒时期，这世间之奇妙，确非我等能够想象，不过，金山大玉海毕竟是上古奇异之物，藏于此地并不为怪。",  --【英雄】水师大营
											"\t那时迁人送绰号“鼓上蚤”，见众好汉顺利攻入，连忙施展“缩骨法”，逃出牢笼，祝家庄内机关重重，处处伏兵，时迁虽出牢笼却未能逃出火坑……\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得海量经验奖励！",  --【英雄】三打祝家庄（一）

											"\t本以为可以顺利救出时迁哥哥，不想半路又杀出这个“程咬金”来！看来我们非要二入祝家庄不可，听说那一丈青扈三娘善用异术，庄内五行碑便是她施法的根源。\n\t此庄方圆数里，又勾结官府欺压良民，今日前来正好将它连根拔起，庄内财物抬到山上，足够我等弟兄几年吃喝。\n\t只是怕我们破了那扈三娘的五行碑，他们早已抬走了财宝逃之夭夭，若不先破五行碑那扈三娘着实难以对付。\n\t这可如何是好？\n#Y小提示：\n\t#W扈三娘的能力来自五行碑，如果实力足够，可以选择#G尽量少的破坏五行碑#W，这样在击败扈三娘后会得到#G更丰厚的回报#W。",  --【英雄】三打祝家庄（二）

											"\t我乃神行太保戴宗，此次下山特为送信而来，公明哥哥已经向天禀明，祝家为富不仁，欺压良民，草菅人命，梁山今日之举实为替天行道，绝非滥杀无辜！\n\t这位兄弟，快随我一共杀进祝家庄！\n#Y小提示：\n\t#W如果能够在击败祝氏三兄弟之前击败扈三娘，那么你将会得到非常好的回报，#G九旄战神#W出现的概率也会#G显著提高#W。",  --【英雄】三打祝家庄（三）

											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】探索战神墓（一）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【英雄】探索战神墓（二）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【英雄】探索战神墓（三）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】印度神庙（一）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【英雄】印度神庙（二）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【英雄】印度神庙（三）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】教堂的秘密（一）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【英雄】教堂的秘密（二）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【英雄】教堂的秘密（三）
										} 
										
										
x700081_g_EnterMenuDescList				=	{--副本对话
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】藏宝洞

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】景教堂
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】囚龙堡

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】轮回台

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】虚空境

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】战神墓

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】和氏璧

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】金銮殿

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】金矿洞

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】禁宫大内

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】对马岛

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】黄河坞

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】囚龙岭

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】囚龙岛海滩

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】永夜天牢

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】水师大营
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】三打祝家庄（一）

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】三打祝家庄（二）

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【试炼】三打祝家庄（三）

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",--【试炼】探索战神墓（一）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",--【试炼】探索战神墓（二）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",--【试炼】探索战神墓（三）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",--【试炼】印度神庙（一）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",--【试炼】印度神庙（二）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",--【试炼】印度神庙（三）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",--【试炼】教堂的秘密（一）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",--【试炼】教堂的秘密（二）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",--【试炼】教堂的秘密（三）
											
											
											
											

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】钧窑绝迹

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",   --【队伍】藏宝洞

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】景教堂

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】龙穴

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。" ,  --【队伍】(经验)        
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。" ,  --【队伍】(声望)        
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。" ,  --【队伍】(天赋80级以上)
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。" ,  --【队伍】倩女幽魂

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】虚空境

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】斗戏勾栏院

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】战神墓

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】和氏璧

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】金銮殿

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】金矿洞

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】禁宫大内

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】对马岛

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】黄河坞

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】神秘墓穴

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】神秘墓穴

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】神秘墓穴

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】囚龙城堡

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】囚龙岛

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】永夜天牢

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】三打祝家庄（一）

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】三打祝家庄（二）

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】三打祝家庄（三）

											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。",  --【队伍】水师大营
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】探索战神墓（一）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】探索战神墓（二）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】探索战神墓（三）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】印度神庙（一）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】印度神庙（二）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】印度神庙（三）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】教堂的秘密（一）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】教堂的秘密（二）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】教堂的秘密（三）
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】产出金矿洞
																						
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】藏宝洞1  
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】藏宝洞2 
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】藏宝洞3 
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】藏宝洞4 
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】藏宝洞5 
											
											"\t如果你感到自己的实力不足以继续进行挑战，我可以把你送回王城。", --【队伍】藏宝洞6
											
											-- HERO TYPE
											"\t自从郭宝玉将军战败于囚龙岛后，霹雳神火诀落入囚龙岛的魔龙军团手中，而随军大萨满临终前布下的结界随着时间的推移渐渐失效。一旦让魔龙军团脱困，霹雳神火诀将被欧洲诸国所利用，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t郭侃将军奉命前往囚龙岛调查祖父郭宝玉当年战败的原因，并取回遗失的“霹雳神火诀”，在这个时候，极度需要一群武艺高强，勇气十足的勇士，从囚龙岛进入龙穴，在魔龙的手中拿回“霹雳神火诀”。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】囚龙岛
											"\t那些红鼻子蓝眼睛的欧洲大军？他们在塞浦路斯被我们打得屁滚尿流，我们最后却陷入了囚龙岛，被魔龙军团偷袭，没有一个人能活着离开！\n\t这批魔龙军团就在这个岛上的城堡里，他们甘愿服侍两只蓝色的恶龙！我们的士兵无法对付这种怪物！\n\t作为随军的萨满大法师，我燃烧了自己的生命，激活了最强大的禁锢结界，“霹雳神火诀”才不至于流传出去。\n\t我的勇士，进入囚龙城堡，去完成你的使命！",  --【英雄】囚龙城堡
											"\t龙穴位于囚龙城堡的海底之中，里面深藏着一只三头凶蛟和各种海底怪物。丢失的“霹雳神火诀”很有可能就在这洞穴之中。\n\t“霹雳神火诀”记载了最厉害的火器制作方法，一旦落入欧洲诸国手中，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t这关系到国家未来的安危，十分火急！你必须进入龙穴，为天下百姓解决这个巨大的隐患！",  --【英雄】龙穴
											"\t宋金大战后，镇国之宝和氏璧流落民间，百年后突然出现在了东海海眼之中，找到和氏璧的人只要能够降伏隐藏于和氏璧之中的八位枭雄的魂魄就能够借助和氏璧的力量，预见未来百年之事。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】禁宫大内
											"\t千百年来无数野心家想要得到这个镇国之宝和氏璧，围绕着它的争夺数不胜数，其中有八位野心家不肯承认自己的失败，一直执着地在留在和氏璧之内，只有击败他们才能让异象消失。",  --【队伍】和氏璧
											"\t恭喜你们，百年来从没有人能击败那八个野心家！现在，我将带你们进入金銮殿，如果你能通过金銮殿的考验，除了会得到非凡的奖励之外更有机会金銮殿，预知未来。\n#Y副本说明：#R敌对势力如果高于50，则会副本失败！",  --【队伍】金銮殿
											"\t日本武士盘踞在对马岛，阴谋对大元发起攻击。但这个阴谋被大元商人汪大渊获悉，并报给了忽必烈。忽必烈派大元勇士潜入对马岛，火烧日本舰船，消灭了聚集在岛上的日本武士，消除了大元的隐患！\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】对马岛
											"\t贫道经过仔细探查，发现方才赤血号仅仅是通往金山大玉海所在之处的一个入口。赤血号，是金山大玉海灵气外泄所成，而此处，正是灵气最为浓密所在。且待贫道施展道法，将你们送往那里。",  --【队伍】虚空境
											"\t方才贫道已经施法打开了此处与金山大玉海所在之地的封印，但是……贫道万万没有想到，那里竟然渺无人迹，只有无数凶兽横行。\n\t按照贫道的推算，这奇异之地的时光应当是亿年之前，盘古开天辟地之后的蛮荒时期，这世间之奇妙，确非我等能够想象，不过，金山大玉海毕竟是上古奇异之物，藏于此地并不为怪。",  --【英雄】水师大营
											"\t那时迁人送绰号“鼓上蚤”，见众好汉顺利攻入，连忙施展“缩骨法”，逃出牢笼，祝家庄内机关重重，处处伏兵，时迁虽出牢笼却未能逃出火坑……\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得海量经验奖励！",  --【英雄】三打祝家庄（一）

											"\t本以为可以顺利救出时迁哥哥，不想半路又杀出这个“程咬金”来！看来我们非要二入祝家庄不可，听说那一丈青扈三娘善用异术，庄内五行碑便是她施法的根源。\n\t此庄方圆数里，又勾结官府欺压良民，今日前来正好将它连根拔起，庄内财物抬到山上，足够我等弟兄几年吃喝。\n\t只是怕我们破了那扈三娘的五行碑，他们早已抬走了财宝逃之夭夭，若不先破五行碑那扈三娘着实难以对付。\n\t这可如何是好？\n#Y小提示：\n\t#W扈三娘的能力来自五行碑，如果实力足够，可以选择#G尽量少的破坏五行碑#W，这样在击败扈三娘后会得到#G更丰厚的回报#W。",  --【英雄】三打祝家庄（二）

											"\t我乃神行太保戴宗，此次下山特为送信而来，公明哥哥已经向天禀明，祝家为富不仁，欺压良民，草菅人命，梁山今日之举实为替天行道，绝非滥杀无辜！\n\t这位兄弟，快随我一共杀进祝家庄！\n#Y小提示：\n\t#W如果能够在击败祝氏三兄弟之前击败扈三娘，那么你将会得到非常好的回报，#G九旄战神#W出现的概率也会#G显著提高#W。",  --【英雄】三打祝家庄（三）

											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】探索战神墓（一）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【英雄】探索战神墓（二）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【英雄】探索战神墓（三）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】印度神庙（一）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【英雄】印度神庙（二）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【英雄】印度神庙（三）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】教堂的秘密（一）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【英雄】教堂的秘密（二）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【英雄】教堂的秘密（三）
										} 
x700081_g_LeaveMenuDescList				=	{--副本对话
											"出口说明",
											"出口说明",
											
											"出口说明",  --【试炼】藏宝洞

											"出口说明",  --【试炼】景教堂
											
											"出口说明",  --【试炼】龙穴

											"出口说明",  --【试炼】轮回台

											"出口说明",  --【试炼】虚空境

											"\t战神大旗被埋葬在战神墓之中，被人们称为战神的旭烈兀在死后，他的灵魂依旧守护者黄金家族的“战神大旗”。察八儿派遣了他最得力的手下，企图进入战神墓盗取战神大旗，以图提高窝阔台家族在黄金家族的地位。察八儿的手下在进入战神墓后，遇上了忽必烈汗派来的守护者。\n#Y开放时间：#W全天\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得龙眼石奖励！",  --【试炼】战神墓

											"\t千百年来无数野心家想要得到这个镇国之宝和氏璧，围绕着它的争夺数不胜数，其中有八位野心家不肯承认自己的失败，一直执着地在留在和氏璧之内，只有击败他们才能让异象消失。",  --【试炼】和氏璧

											"\t恭喜你们，百年来从没有人能击败那八个野心家！现在，我将带你们进入金銮殿，如果你能通过金銮殿的考验，除了会得到非凡的奖励之外更有机会金銮殿，预知未来。\n#Y副本说明：#R敌对势力如果高于50，则会副本失败！",  --【试炼】金銮殿

											"\t由于过量开采，惊扰了藏在地下了恶魔，金矿洞内的大量的矿工惨死，在矿洞附近的居民受到了生命威胁。赤老温家族奉大汗的命令，率领众勇士前往矿洞，驱逐敌对势力并杀死恶魔。\n#Y开放时间：#W全天\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得金钱奖励！",  --【试炼】金矿洞

											"\t宋金大战后，镇国之宝和氏璧流落民间，百年后突然出现在了东海海眼之中，找到和氏璧的人只要能够降伏隐藏于和氏璧之中的八位枭雄的魂魄就能够借助和氏璧的力量，预见未来百年之事。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【试炼】禁宫大内

											"\t日本武士盘踞在对马岛，阴谋对大元发起攻击。但这个阴谋被大元商人汪大渊获悉，并报给了忽必烈。忽必烈派大元勇士潜入对马岛，火烧日本舰船，消灭了聚集在岛上的日本武士，消除了大元的隐患！\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【试炼】对马岛

											"\t“黄河石人一只眼，此物一出天下反”，相传在黄河坞内，藏着的绝世宝物--黄河独眼石人有争霸天下的能力。\n\t宝物即将出世的消息传出，引起了三大帮忙的哄抢，明教、盐帮、黄河帮三大帮会聚集黄河坞，为宝物而大打出手，纷争四起。\n\t明教韩山童得消息之后，派你前往黄河坞平息三帮，你在打败三帮高手之后，却发现，原来那所谓的绝世宝物独眼石人，竟然是一只凶恶无比的独眼怪兽，只有击败这怪物，你才能逃出生天。\n#Y开放时间：#W全天\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得制造材料奖励！",  --【试炼】黄河坞

											"\t那些红鼻子蓝眼睛的欧洲大军？他们在塞浦路斯被我们打得屁滚尿流，我们最后却陷入了囚龙岛，被魔龙军团偷袭，没有一个人能活着离开！\n\t这批魔龙军团就在这个岛上的城堡里，他们甘愿服侍两只蓝色的恶龙！我们的士兵无法对付这种怪物！\n\t作为随军的萨满大法师，我燃烧了自己的生命，激活了最强大的禁锢结界，“霹雳神火诀”才不至于流传出去。\n\t我的勇士，进入囚龙城堡，去完成你的使命！",  --【试炼】囚龙城堡

											"\t自从郭宝玉将军战败于囚龙岛后，霹雳神火诀落入囚龙岛的魔龙军团手中，而随军大萨满临终前布下的结界随着时间的推移渐渐失效。一旦让魔龙军团脱困，霹雳神火诀将被欧洲诸国所利用，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t郭侃将军奉命前往囚龙岛调查祖父郭宝玉当年战败的原因，并取回遗失的“霹雳神火诀”，在这个时候，极度需要一群武艺高强，勇气十足的勇士，从囚龙岛进入龙穴，在魔龙的手中拿回“霹雳神火诀”。\n#Y开放时间：#W全天\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【试炼】囚龙岛

											"\t扎兰丁依靠着冰魄银晶获得了不死之身，最后被成吉思汗禁锢在了永夜天牢之中。永夜天牢的封印之力渐渐黯淡，被禁锢在天牢里的扎兰丁试图越狱，重建花剌子模国。\n\t国师苏德延吉儿得悉了扎兰丁的阴谋，派遣你这个王国最杰出的勇士进入永夜天牢，激活封印之力，并打败扎兰丁，从他身上夺得冰魄银晶。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得声望奖励！",  --【试炼】永夜天牢

											"\t方才贫道已经施法打开了此处与金山大玉海所在之地的封印，但是……贫道万万没有想到，那里竟然渺无人迹，只有无数凶兽横行。\n\t按照贫道的推算，这奇异之地的时光应当是亿年之前，盘古开天辟地之后的蛮荒时期，这世间之奇妙，确非我等能够想象，不过，金山大玉海毕竟是上古奇异之物，藏于此地并不为怪。",  --【试炼】水师大营
											
											"\t那时迁人送绰号“鼓上蚤”，见众好汉顺利攻入，连忙施展“缩骨法”，逃出牢笼，祝家庄内机关重重，处处伏兵，时迁虽出牢笼却未能逃出火坑……\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【试炼】三打祝家庄（一）

											"\t本以为可以顺利救出时迁哥哥，不想半路又杀出这个“程咬金”来！看来我们非要二入祝家庄不可，听说那一丈青扈三娘善用异术，庄内五行碑便是她施法的根源。\n\t此庄方圆数里，又勾结官府欺压良民，今日前来正好将它连根拔起，庄内财物抬到山上，足够我等弟兄几年吃喝。\n\t只是怕我们破了那扈三娘的五行碑，他们早已抬走了财宝逃之夭夭，若不先破五行碑那扈三娘着实难以对付。\n\t这可如何是好？\n#Y小提示：\n\t#W扈三娘的能力来自五行碑，如果实力足够，可以选择#G尽量少的破坏五行碑#W，这样在击败扈三娘后会得到#G更丰厚的回报#W。",  --【试炼】三打祝家庄（二）

											"\t我乃神行太保戴宗，此次下山特为送信而来，公明哥哥已经向天禀明，祝家为富不仁，欺压良民，草菅人命，梁山今日之举实为替天行道，绝非滥杀无辜！\n\t这位兄弟，快随我一共杀进祝家庄！\n#Y小提示：\n\t#W如果能够在击败祝氏三兄弟之前击败扈三娘，那么你将会得到非常好的回报。",  --【试炼】三打祝家庄（三）

											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【试炼】探索战神墓（一）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【试炼】探索战神墓（二）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【试炼】探索战神墓（三）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【试炼】印度神庙（一）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【试炼】印度神庙（二）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【试炼】印度神庙（三）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【试炼】教堂的秘密（一）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【试炼】教堂的秘密（二）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【试炼】教堂的秘密（三）
											
											
											
											

											"\t大都陶家一直有祖训，不得移动此壶，否则就会有妖兽出现，酿成天灾人祸。大奸臣哈嘛手下有一个偏将名叫律罗，因哈嘛大寿在即，又听说陶录一家有宝物，便不顾陶家人的阻拦，带人冲进了钧窑，见到炼妖壶后，一眼便看出此物并非凡品，动手去抢，突然间壶中烈焰突起，将这一干人卷入火海，烈焰腾起，劫火妖魔从壶中幻化而出。\n#Y开放时间：#W仅在每周六、日开放！每周只能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！还可以从陶录那里兑换神传钻石原石！",  --【队伍】钧窑绝迹

											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得水晶奖励！",   --【队伍】藏宝洞

											"\t大巫师勃鲁合利用了两个王子重建旧部的野心，招揽了曾经的旧部，并用巫术把那些人变成了自己的信徒，势力渐渐延伸到了边塞，并占据了景教堂。\n\t迦色尼王对他们产生了警惕，带着迦色尼的勇士，包围了景教堂，却被巫法阻挡在了教堂之外……你需要进入教堂之中，尽快的把邪恶的巫师巴桑给驱逐出去。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得制造材料奖励！",  --【队伍】景教堂

											"\t龙穴位于囚龙城堡的海底之中，里面深藏着一只三头凶蛟和各种海底怪物。丢失的“霹雳神火诀”很有可能就在这洞穴之中。\n\t“霹雳神火诀”记载了最厉害的火器制作方法，一旦落入欧洲诸国手中，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t这关系到国家未来的安危，十分火急！你必须进入龙穴，为天下百姓解决这个巨大的隐患！",  --【队伍】龙穴

											"\t为了查清和亲船队失踪的真相，太子利用萨满教的神秘力量创建轮回台，开启时空之门，却被人从中破坏，导致时空错乱，很多史前生物涌现，史前生物随时进攻王城，王城的安危遭受严重的威胁。\n\t太子召集王城的勇士进行抵抗，到轮回台阻止那些史前怪物，消灭一切用心邪恶的人！\n#Y开放时间：#W每天11点-14点，19点30分-24点开放，每天仅能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#G副本等级低于五十级时，王城将军将会派出王城中六大护卫协助各位勇士共同完成任务。#R不要放过任何一个怪物，否则可能会导致您无法进入排行榜！\n#Y副本说明：#W在这个副本中，你可以获得海量经验！" ,  --【队伍】(经验)        
											"\t为了查清和亲船队失踪的真相，太子利用萨满教的神秘力量创建轮回台，开启时空之门，却被人从中破坏，导致时空错乱，很多史前生物涌现，史前生物随时进攻王城，王城的安危遭受严重的威胁。\n\t太子召集王城的勇士进行抵抗，到轮回台阻止那些史前怪物，消灭一切用心邪恶的人！\n#Y开放时间：#W每天11点-14点，19点30分-24点开放，每天仅能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#G副本等级低于五十级时，王城将军将会派出王城中六大护卫协助各位勇士共同完成任务。#R不要放过任何一个怪物，否则可能会导致您无法进入排行榜！\n#Y副本说明：#W在这个副本中，你可以获得海量经验！" ,  --【队伍】(声望)        
											"\t为了查清和亲船队失踪的真相，太子利用萨满教的神秘力量创建轮回台，开启时空之门，却被人从中破坏，导致时空错乱，很多史前生物涌现，史前生物随时进攻王城，王城的安危遭受严重的威胁。\n\t太子召集王城的勇士进行抵抗，到轮回台阻止那些史前怪物，消灭一切用心邪恶的人！\n#Y开放时间：#W每天11点-14点，19点30分-24点开放，每天仅能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#G副本等级低于五十级时，王城将军将会派出王城中六大护卫协助各位勇士共同完成任务。#R不要放过任何一个怪物，否则可能会导致您无法进入排行榜！\n#Y副本说明：#W在这个副本中，你可以获得海量经验！" ,  --【队伍】(天赋80级以上)
											"\t为了查清和亲船队失踪的真相，太子利用萨满教的神秘力量创建轮回台，开启时空之门，却被人从中破坏，导致时空错乱，很多史前生物涌现，史前生物随时进攻王城，王城的安危遭受严重的威胁。\n\t太子召集王城的勇士进行抵抗，到轮回台阻止那些史前怪物，消灭一切用心邪恶的人！\n#Y开放时间：#W每天11点-14点，19点30分-24点开放，每天仅能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#G副本等级低于五十级时，王城将军将会派出王城中六大护卫协助各位勇士共同完成任务。#R不要放过任何一个怪物，否则可能会导致您无法进入排行榜！\n#Y副本说明：#W在这个副本中，你可以获得海量经验！" ,  --【队伍】倩女幽魂

											"\t贫道经过仔细探查，发现方才赤血号仅仅是通往金山大玉海所在之处的一个入口。赤血号，是金山大玉海灵气外泄所成，而此处，正是灵气最为浓密所在。且待贫道施展道法，将你们送往那里。",  --【队伍】虚空境

											"\t大都之内喜气洋洋，张灯结彩，四大才子欲展平生所学，八月十五在勾栏院中将自己的平生之能尽现出来，不想竟遇到了戏中之戏……\n#Y开放时间：#W仅在每周六、日开放！每周只能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得海量经验奖励！还可能获得墨玉钻——第三孔打孔道具！",  --【队伍】斗戏勾栏院

											"\t战神大旗被埋葬在战神墓之中，被人们称为战神的旭烈兀在死后，他的灵魂依旧守护者黄金家族的“战神大旗”。察八儿派遣了他最得力的手下，企图进入战神墓盗取战神大旗，以图提高窝阔台家族在黄金家族的地位。察八儿的手下在进入战神墓后，遇上了忽必烈汗派来的守护者。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！有治疗系的队友能更轻松游戏！\n#Y副本说明：#W在这个副本中，你可以获得龙眼石奖励！",  --【队伍】战神墓

											"\t千百年来无数野心家想要得到这个镇国之宝和氏璧，围绕着它的争夺数不胜数，其中有八位野心家不肯承认自己的失败，一直执着地在留在和氏璧之内，只有击败他们才能让异象消失。",  --【队伍】和氏璧

											"\t恭喜你们，百年来从没有人能击败那八个野心家！现在，我将带你们进入金銮殿，如果你能通过金銮殿的考验，除了会得到非凡的奖励之外更有机会金銮殿，预知未来。\n#Y副本说明：#R敌对势力如果高于50，则会副本失败！",  --【队伍】金銮殿

											"\t由于过量开采，惊扰了藏在地下了恶魔，金矿洞内的大量的矿工惨死，在矿洞附近的居民受到了生命威胁。赤老温家族奉大汗的命令，率领众勇士前往矿洞，驱逐敌对势力并杀死恶魔。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得金钱奖励！",  --【队伍】金矿洞

											"\t宋金大战后，镇国之宝和氏璧流落民间，百年后突然出现在了东海海眼之中，找到和氏璧的人只要能够降伏隐藏于和氏璧之中的八位枭雄的魂魄就能够借助和氏璧的力量，预见未来百年之事。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】禁宫大内

											"\t日本武士盘踞在对马岛，阴谋对大元发起攻击。但这个阴谋被大元商人汪大渊获悉，并报给了忽必烈。忽必烈派大元勇士潜入对马岛，火烧日本舰船，消灭了聚集在岛上的日本武士，消除了大元的隐患！\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】对马岛

											"\t“黄河石人一只眼，此物一出天下反”，相传在黄河坞内，藏着的绝世宝物--黄河独眼石人有争霸天下的能力。\n\t宝物即将出世的消息传出，引起了三大帮忙的哄抢，明教、盐帮、黄河帮三大帮会聚集黄河坞，为宝物而大打出手，纷争四起。\n\t明教韩山童得消息之后，派你前往黄河坞平息三帮，你在打败三帮高手之后，却发现，原来那所谓的绝世宝物独眼石人，竟然是一只凶恶无比的独眼怪兽，只有击败这怪物，你才能逃出生天。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得制造材料奖励！",  --【队伍】黄河坞

											"\t木华黎的揽月之杖，哲别的逐日之弓，速不台的劈天之斧是大草原最有价值的宝物，传闻这些宝物藏在以逐日、揽月、劈天三个标记的古迹之中。\n\t有人发现了这些古迹的入口，你的使命，便是到古迹之中探宝！一探究竟！\n#Y开放时间：#W国家发布！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】神秘墓穴

											"\t木华黎的揽月之杖，哲别的逐日之弓，速不台的劈天之斧是大草原最有价值的宝物，传闻这些宝物藏在以逐日、揽月、劈天三个标记的古迹之中。\n\t有人发现了这些古迹的入口，你的使命，便是到古迹之中探宝！一探究竟！\n#Y开放时间：#W国家发布！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】神秘墓穴

											"\t木华黎的揽月之杖，哲别的逐日之弓，速不台的劈天之斧是大草原最有价值的宝物，传闻这些宝物藏在以逐日、揽月、劈天三个标记的古迹之中。\n\t有人发现了这些古迹的入口，你的使命，便是到古迹之中探宝！一探究竟！\n#Y开放时间：#W国家发布！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】神秘墓穴

											"\t那些红鼻子蓝眼睛的欧洲大军？他们在塞浦路斯被我们打得屁滚尿流，我们最后却陷入了囚龙岛，被魔龙军团偷袭，没有一个人能活着离开！\n\t这批魔龙军团就在这个岛上的城堡里，他们甘愿服侍两只蓝色的恶龙！我们的士兵无法对付这种怪物！\n\t作为随军的萨满大法师，我燃烧了自己的生命，激活了最强大的禁锢结界，“霹雳神火诀”才不至于流传出去。\n\t我的勇士，进入囚龙城堡，去完成你的使命！",  --【队伍】囚龙城堡

											"\t自从郭宝玉将军战败于囚龙岛后，霹雳神火诀落入囚龙岛的魔龙军团手中，而随军大萨满临终前布下的结界随着时间的推移渐渐失效。一旦让魔龙军团脱困，霹雳神火诀将被欧洲诸国所利用，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t郭侃将军奉命前往囚龙岛调查祖父郭宝玉当年战败的原因，并取回遗失的“霹雳神火诀”，在这个时候，极度需要一群武艺高强，勇气十足的勇士，从囚龙岛进入龙穴，在魔龙的手中拿回“霹雳神火诀”。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】囚龙岛

											"\t扎兰丁依靠着冰魄银晶获得了不死之身，最后被成吉思汗禁锢在了永夜天牢之中。永夜天牢的封印之力渐渐黯淡，被禁锢在天牢里的扎兰丁试图越狱，重建花剌子模国。\n\t国师苏德延吉儿得悉了扎兰丁的阴谋，派遣你这个王国最杰出的勇士进入永夜天牢，激活封印之力，并打败扎兰丁，从他身上夺得冰魄银晶。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！有治疗系的队友能更轻松游戏。\n#Y副本说明：#W在这个副本中，你可以获得声望奖励！",  --【队伍】永夜天牢

											"\t那时迁人送绰号“鼓上蚤”，见众好汉顺利攻入，连忙施展“缩骨法”，逃出牢笼，祝家庄内机关重重，处处伏兵，时迁虽出牢笼却未能逃出火坑……\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得海量经验奖励！",  --【队伍】三打祝家庄（一）

											"\t本以为可以顺利救出时迁哥哥，不想半路又杀出这个“程咬金”来！看来我们非要二入祝家庄不可，听说那一丈青扈三娘善用异术，庄内五行碑便是她施法的根源。\n\t此庄方圆数里，又勾结官府欺压良民，今日前来正好将它连根拔起，庄内财物抬到山上，足够我等弟兄几年吃喝。\n\t只是怕我们破了那扈三娘的五行碑，他们早已抬走了财宝逃之夭夭，若不先破五行碑那扈三娘着实难以对付。\n\t这可如何是好？\n#Y小提示：\n\t#W扈三娘的能力来自五行碑，如果实力足够，可以选择#G尽量少的破坏五行碑#W，这样在击败扈三娘后会得到#G更丰厚的回报#W。",  --【队伍】三打祝家庄（二）

											"\t我乃神行太保戴宗，此次下山特为送信而来，公明哥哥已经向天禀明，祝家为富不仁，欺压良民，草菅人命，梁山今日之举实为替天行道，绝非滥杀无辜！\n\t这位兄弟，快随我一共杀进祝家庄！\n#Y小提示：\n\t#W如果能够在击败祝氏三兄弟之前击败扈三娘，那么你将会得到非常好的回报，#G九旄战神#W出现的概率也会#G显著提高#W。",  --【队伍】三打祝家庄（三）

											"\t方才贫道已经施法打开了此处与金山大玉海所在之地的封印，但是……贫道万万没有想到，那里竟然渺无人迹，只有无数凶兽横行。\n\t按照贫道的推算，这奇异之地的时光应当是亿年之前，盘古开天辟地之后的蛮荒时期，这世间之奇妙，确非我等能够想象，不过，金山大玉海毕竟是上古奇异之物，藏于此地并不为怪。",  --【队伍】水师大营
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【队伍】探索战神墓（一）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【队伍】探索战神墓（二）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【队伍】探索战神墓（三）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【队伍】印度神庙（一）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【队伍】印度神庙（二）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【队伍】印度神庙（三）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【队伍】教堂的秘密（一）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【队伍】教堂的秘密（二）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【队伍】教堂的秘密（三）
											
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得奖励！",--【队伍】产出金矿洞
																						
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得龙眼石奖励！",--【队伍】藏宝洞1  
											
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得声望奖励！",--【队伍】藏宝洞2 
											
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得金钱奖励！",--【队伍】藏宝洞3 
											
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得制造材料奖励！",--【队伍】藏宝洞4 
											
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得制造材料奖励！",--【队伍】藏宝洞5 
											
											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得水晶、龙眼石、生活技能材料、银子等各种奖励！",--【队伍】藏宝洞6
											
											-- HERO TYPE
											"\t自从郭宝玉将军战败于囚龙岛后，霹雳神火诀落入囚龙岛的魔龙军团手中，而随军大萨满临终前布下的结界随着时间的推移渐渐失效。一旦让魔龙军团脱困，霹雳神火诀将被欧洲诸国所利用，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t郭侃将军奉命前往囚龙岛调查祖父郭宝玉当年战败的原因，并取回遗失的“霹雳神火诀”，在这个时候，极度需要一群武艺高强，勇气十足的勇士，从囚龙岛进入龙穴，在魔龙的手中拿回“霹雳神火诀”。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】囚龙岛
											"\t那些红鼻子蓝眼睛的欧洲大军？他们在塞浦路斯被我们打得屁滚尿流，我们最后却陷入了囚龙岛，被魔龙军团偷袭，没有一个人能活着离开！\n\t这批魔龙军团就在这个岛上的城堡里，他们甘愿服侍两只蓝色的恶龙！我们的士兵无法对付这种怪物！\n\t作为随军的萨满大法师，我燃烧了自己的生命，激活了最强大的禁锢结界，“霹雳神火诀”才不至于流传出去。\n\t我的勇士，进入囚龙城堡，去完成你的使命！",  --【英雄】囚龙城堡
											"\t龙穴位于囚龙城堡的海底之中，里面深藏着一只三头凶蛟和各种海底怪物。丢失的“霹雳神火诀”很有可能就在这洞穴之中。\n\t“霹雳神火诀”记载了最厉害的火器制作方法，一旦落入欧洲诸国手中，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t这关系到国家未来的安危，十分火急！你必须进入龙穴，为天下百姓解决这个巨大的隐患！",  --【英雄】龙穴
											"\t宋金大战后，镇国之宝和氏璧流落民间，百年后突然出现在了东海海眼之中，找到和氏璧的人只要能够降伏隐藏于和氏璧之中的八位枭雄的魂魄就能够借助和氏璧的力量，预见未来百年之事。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】禁宫大内
											"\t千百年来无数野心家想要得到这个镇国之宝和氏璧，围绕着它的争夺数不胜数，其中有八位野心家不肯承认自己的失败，一直执着地在留在和氏璧之内，只有击败他们才能让异象消失。",  --【队伍】和氏璧
											"\t恭喜你们，百年来从没有人能击败那八个野心家！现在，我将带你们进入金銮殿，如果你能通过金銮殿的考验，除了会得到非凡的奖励之外更有机会金銮殿，预知未来。\n#Y副本说明：#R敌对势力如果高于50，则会副本失败！",  --【队伍】金銮殿
											"\t前日，陛下做了一奇梦，他梦见自己身处凌霄宝殿，天帝赐他一样异宝—金山大玉海，并告知凭此物可保江山万代不移。\n\t陛下醒来后，立刻命我等寻找那传说中的金山大玉海，经我多方探查，终于查明赤血号与金山大玉海有着千丝万缕的联系，护国天师玄灵道长已经先行带着他的弟子们进入赤血号。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#R在规定时间内摧毁火炮是一切的关键！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】对马岛
											"\t贫道经过仔细探查，发现方才赤血号仅仅是通往金山大玉海所在之处的一个入口。赤血号，是金山大玉海灵气外泄所成，而此处，正是灵气最为浓密所在。且待贫道施展道法，将你们送往那里。",  --【队伍】虚空境
											"\t方才贫道已经施法打开了此处与金山大玉海所在之地的封印，但是……贫道万万没有想到，那里竟然渺无人迹，只有无数凶兽横行。\n\t按照贫道的推算，这奇异之地的时光应当是亿年之前，盘古开天辟地之后的蛮荒时期，这世间之奇妙，确非我等能够想象，不过，金山大玉海毕竟是上古奇异之物，藏于此地并不为怪。",  --【英雄】水师大营
											"\t那时迁人送绰号“鼓上蚤”，见众好汉顺利攻入，连忙施展“缩骨法”，逃出牢笼，祝家庄内机关重重，处处伏兵，时迁虽出牢笼却未能逃出火坑……\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得海量经验奖励！",  --【英雄】三打祝家庄（一）

											"\t本以为可以顺利救出时迁哥哥，不想半路又杀出这个“程咬金”来！看来我们非要二入祝家庄不可，听说那一丈青扈三娘善用异术，庄内五行碑便是她施法的根源。\n\t此庄方圆数里，又勾结官府欺压良民，今日前来正好将它连根拔起，庄内财物抬到山上，足够我等弟兄几年吃喝。\n\t只是怕我们破了那扈三娘的五行碑，他们早已抬走了财宝逃之夭夭，若不先破五行碑那扈三娘着实难以对付。\n\t这可如何是好？\n#Y小提示：\n\t#W扈三娘的能力来自五行碑，如果实力足够，可以选择#G尽量少的破坏五行碑#W，这样在击败扈三娘后会得到#G更丰厚的回报#W。",  --【英雄】三打祝家庄（二）

											"\t我乃神行太保戴宗，此次下山特为送信而来，公明哥哥已经向天禀明，祝家为富不仁，欺压良民，草菅人命，梁山今日之举实为替天行道，绝非滥杀无辜！\n\t这位兄弟，快随我一共杀进祝家庄！\n#Y小提示：\n\t#W如果能够在击败祝氏三兄弟之前击败扈三娘，那么你将会得到非常好的回报，#G九旄战神#W出现的概率也会#G显著提高#W。",  --【英雄】三打祝家庄（三）

											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】探索战神墓（一）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【英雄】探索战神墓（二）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【英雄】探索战神墓（三）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】印度神庙（一）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【英雄】印度神庙（二）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【英雄】印度神庙（三）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】教堂的秘密（一）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【英雄】教堂的秘密（二）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【英雄】教堂的秘密（三）
										}		
										
x700081_g_TeleportWangchengDescList				=	{--副本对话
											"回王城吗--",
											"回王城吗--",
											
											"回王城吗--",  --【试炼】藏宝洞

											"回王城吗--",  --【试炼】景教堂
											
											"回王城吗--",  --【试炼】龙穴

											"回王城吗--",  --【试炼】轮回台

											"回王城吗--",  --【试炼】虚空境

											"\t战神大旗被埋葬在战神墓之中，被人们称为战神的旭烈兀在死后，他的灵魂依旧守护者黄金家族的“战神大旗”。察八儿派遣了他最得力的手下，企图进入战神墓盗取战神大旗，以图提高窝阔台家族在黄金家族的地位。察八儿的手下在进入战神墓后，遇上了忽必烈汗派来的守护者。\n#Y开放时间：#W全天\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得龙眼石奖励！",  --【试炼】战神墓

											"\t千百年来无数野心家想要得到这个镇国之宝和氏璧，围绕着它的争夺数不胜数，其中有八位野心家不肯承认自己的失败，一直执着地在留在和氏璧之内，只有击败他们才能让异象消失。",  --【试炼】和氏璧

											"\t恭喜你们，百年来从没有人能击败那八个野心家！现在，我将带你们进入金銮殿，如果你能通过金銮殿的考验，除了会得到非凡的奖励之外更有机会金銮殿，预知未来。\n#Y副本说明：#R敌对势力如果高于50，则会副本失败！",  --【试炼】金銮殿

											"\t由于过量开采，惊扰了藏在地下了恶魔，金矿洞内的大量的矿工惨死，在矿洞附近的居民受到了生命威胁。赤老温家族奉大汗的命令，率领众勇士前往矿洞，驱逐敌对势力并杀死恶魔。\n#Y开放时间：#W全天\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得金钱奖励！",  --【试炼】金矿洞

											"\t宋金大战后，镇国之宝和氏璧流落民间，百年后突然出现在了东海海眼之中，找到和氏璧的人只要能够降伏隐藏于和氏璧之中的八位枭雄的魂魄就能够借助和氏璧的力量，预见未来百年之事。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【试炼】禁宫大内

											"\t日本武士盘踞在对马岛，阴谋对大元发起攻击。但这个阴谋被大元商人汪大渊获悉，并报给了忽必烈。忽必烈派大元勇士潜入对马岛，火烧日本舰船，消灭了聚集在岛上的日本武士，消除了大元的隐患！\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【试炼】对马岛

											"\t“黄河石人一只眼，此物一出天下反”，相传在黄河坞内，藏着的绝世宝物--黄河独眼石人有争霸天下的能力。\n\t宝物即将出世的消息传出，引起了三大帮忙的哄抢，明教、盐帮、黄河帮三大帮会聚集黄河坞，为宝物而大打出手，纷争四起。\n\t明教韩山童得消息之后，派你前往黄河坞平息三帮，你在打败三帮高手之后，却发现，原来那所谓的绝世宝物独眼石人，竟然是一只凶恶无比的独眼怪兽，只有击败这怪物，你才能逃出生天。\n#Y开放时间：#W全天\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得制造材料奖励！",  --【试炼】黄河坞

											"\t那些红鼻子蓝眼睛的欧洲大军？他们在塞浦路斯被我们打得屁滚尿流，我们最后却陷入了囚龙岛，被魔龙军团偷袭，没有一个人能活着离开！\n\t这批魔龙军团就在这个岛上的城堡里，他们甘愿服侍两只蓝色的恶龙！我们的士兵无法对付这种怪物！\n\t作为随军的萨满大法师，我燃烧了自己的生命，激活了最强大的禁锢结界，“霹雳神火诀”才不至于流传出去。\n\t我的勇士，进入囚龙城堡，去完成你的使命！",  --【试炼】囚龙城堡

											"\t自从郭宝玉将军战败于囚龙岛后，霹雳神火诀落入囚龙岛的魔龙军团手中，而随军大萨满临终前布下的结界随着时间的推移渐渐失效。一旦让魔龙军团脱困，霹雳神火诀将被欧洲诸国所利用，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t郭侃将军奉命前往囚龙岛调查祖父郭宝玉当年战败的原因，并取回遗失的“霹雳神火诀”，在这个时候，极度需要一群武艺高强，勇气十足的勇士，从囚龙岛进入龙穴，在魔龙的手中拿回“霹雳神火诀”。\n#Y开放时间：#W全天\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【试炼】囚龙岛

											"\t扎兰丁依靠着冰魄银晶获得了不死之身，最后被成吉思汗禁锢在了永夜天牢之中。永夜天牢的封印之力渐渐黯淡，被禁锢在天牢里的扎兰丁试图越狱，重建花剌子模国。\n\t国师苏德延吉儿得悉了扎兰丁的阴谋，派遣你这个王国最杰出的勇士进入永夜天牢，激活封印之力，并打败扎兰丁，从他身上夺得冰魄银晶。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得声望奖励！",  --【试炼】永夜天牢

											"\t前面就是北条时宗的水师大营，妄图侵犯大元的日本战船全都停泊在大营内。速速将这些战船全部烧毁，决不能让敌人的阴谋得逞！",  --【试炼】水师大营
											
											"\t那时迁人送绰号“鼓上蚤”，见众好汉顺利攻入，连忙施展“缩骨法”，逃出牢笼，祝家庄内机关重重，处处伏兵，时迁虽出牢笼却未能逃出火坑……\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【试炼】三打祝家庄（一）

											"\t本以为可以顺利救出时迁哥哥，不想半路又杀出这个“程咬金”来！看来我们非要二入祝家庄不可，听说那一丈青扈三娘善用异术，庄内五行碑便是她施法的根源。\n\t此庄方圆数里，又勾结官府欺压良民，今日前来正好将它连根拔起，庄内财物抬到山上，足够我等弟兄几年吃喝。\n\t只是怕我们破了那扈三娘的五行碑，他们早已抬走了财宝逃之夭夭，若不先破五行碑那扈三娘着实难以对付。\n\t这可如何是好？\n#Y小提示：\n\t#W扈三娘的能力来自五行碑，如果实力足够，可以选择#G尽量少的破坏五行碑#W，这样在击败扈三娘后会得到#G更丰厚的回报#W。",  --【试炼】三打祝家庄（二）

											"\t我乃神行太保戴宗，此次下山特为送信而来，公明哥哥已经向天禀明，祝家为富不仁，欺压良民，草菅人命，梁山今日之举实为替天行道，绝非滥杀无辜！\n\t这位兄弟，快随我一共杀进祝家庄！\n#Y小提示：\n\t#W如果能够在击败祝氏三兄弟之前击败扈三娘，那么你将会得到非常好的回报。",  --【试炼】三打祝家庄（三）

											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【试炼】探索战神墓（一）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【试炼】探索战神墓（二）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【试炼】探索战神墓（三）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【试炼】印度神庙（一）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【试炼】印度神庙（二）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【试炼】印度神庙（三）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【试炼】教堂的秘密（一）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【试炼】教堂的秘密（二）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【试炼】教堂的秘密（三）
											
											
											
											

											"\t大都陶家一直有祖训，不得移动此壶，否则就会有妖兽出现，酿成天灾人祸。大奸臣哈嘛手下有一个偏将名叫律罗，因哈嘛大寿在即，又听说陶录一家有宝物，便不顾陶家人的阻拦，带人冲进了钧窑，见到炼妖壶后，一眼便看出此物并非凡品，动手去抢，突然间壶中烈焰突起，将这一干人卷入火海，烈焰腾起，劫火妖魔从壶中幻化而出。\n#Y开放时间：#W仅在每周六、日开放！每周只能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！还可以从陶录那里兑换神传钻石原石！",  --【队伍】钧窑绝迹

											"\t传说佛祖释迦摩尼涅槃之后，留下六颗真身舍利，其中一舍利，多方辗转，最终被一位高僧镶嵌在藏宝洞一座大佛的佛头中，可是，自从察合台汗国的那一帮败类来到了王城，他们整日打着黄金家族后裔的幌子，百方打探得知了藏宝洞的位置，并派遣大量人手进入其中，欲盗取佛祖舍利。\n\t百年前我们耶律家族曾追随大汗征战四方，如今我们也不能坐视这宝物落入歹人之手！\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得水晶奖励！",   --【队伍】藏宝洞

											"\t大巫师勃鲁合利用了两个王子重建旧部的野心，招揽了曾经的旧部，并用巫术把那些人变成了自己的信徒，势力渐渐延伸到了边塞，并占据了景教堂。\n\t迦色尼王对他们产生了警惕，带着迦色尼的勇士，包围了景教堂，却被巫法阻挡在了教堂之外……你需要进入教堂之中，尽快的把邪恶的巫师巴桑给驱逐出去。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得制造材料奖励！",  --【队伍】景教堂

											"\t龙穴位于囚龙城堡的海底之中，里面深藏着一只三头凶蛟和各种海底怪物。丢失的“霹雳神火诀”很有可能就在这洞穴之中。\n\t“霹雳神火诀”记载了最厉害的火器制作方法，一旦落入欧洲诸国手中，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t这关系到国家未来的安危，十分火急！你必须进入龙穴，为天下百姓解决这个巨大的隐患！",  --【队伍】龙穴

											"\t为了查清和亲船队失踪的真相，太子利用萨满教的神秘力量创建轮回台，开启时空之门，却被人从中破坏，导致时空错乱，很多史前生物涌现，史前生物随时进攻王城，王城的安危遭受严重的威胁。\n\t太子召集王城的勇士进行抵抗，到轮回台阻止那些史前怪物，消灭一切用心邪恶的人！\n#Y开放时间：#W每天11点-14点，19点30分-21点30分开放，每天仅能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#G副本等级低于五十级时，王城将军将会派出王城中六大护卫协助各位勇士共同完成任务。#R不要放过任何一个怪物，否则可能会导致您无法进入排行榜！\n#Y副本说明：#W在这个副本中，你可以获得海量经验！" ,  --【队伍】(经验)        
											"\t为了查清和亲船队失踪的真相，太子利用萨满教的神秘力量创建轮回台，开启时空之门，却被人从中破坏，导致时空错乱，很多史前生物涌现，史前生物随时进攻王城，王城的安危遭受严重的威胁。\n\t太子召集王城的勇士进行抵抗，到轮回台阻止那些史前怪物，消灭一切用心邪恶的人！\n#Y开放时间：#W每天11点-14点，19点30分-21点30分开放，每天仅能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#G副本等级低于五十级时，王城将军将会派出王城中六大护卫协助各位勇士共同完成任务。#R不要放过任何一个怪物，否则可能会导致您无法进入排行榜！\n#Y副本说明：#W在这个副本中，你可以获得海量经验！" ,  --【队伍】(声望)        
											"\t为了查清和亲船队失踪的真相，太子利用萨满教的神秘力量创建轮回台，开启时空之门，却被人从中破坏，导致时空错乱，很多史前生物涌现，史前生物随时进攻王城，王城的安危遭受严重的威胁。\n\t太子召集王城的勇士进行抵抗，到轮回台阻止那些史前怪物，消灭一切用心邪恶的人！\n#Y开放时间：#W每天11点-14点，19点30分-21点30分开放，每天仅能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#G副本等级低于五十级时，王城将军将会派出王城中六大护卫协助各位勇士共同完成任务。#R不要放过任何一个怪物，否则可能会导致您无法进入排行榜！\n#Y副本说明：#W在这个副本中，你可以获得海量经验！" ,  --【队伍】(天赋80级以上)
											"\t为了查清和亲船队失踪的真相，太子利用萨满教的神秘力量创建轮回台，开启时空之门，却被人从中破坏，导致时空错乱，很多史前生物涌现，史前生物随时进攻王城，王城的安危遭受严重的威胁。\n\t太子召集王城的勇士进行抵抗，到轮回台阻止那些史前怪物，消灭一切用心邪恶的人！\n#Y开放时间：#W每天11点-14点，19点30分-21点30分开放，每天仅能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#G副本等级低于五十级时，王城将军将会派出王城中六大护卫协助各位勇士共同完成任务。#R不要放过任何一个怪物，否则可能会导致您无法进入排行榜！\n#Y副本说明：#W在这个副本中，你可以获得海量经验！" ,  --【队伍】倩女幽魂

											"\t贫道经过仔细探查，发现方才赤血号仅仅是通往金山大玉海所在之处的一个入口。赤血号，是金山大玉海灵气外泄所成，而此处，正是灵气最为浓密所在。且待贫道施展道法，将你们送往那里。",  --【队伍】虚空境

											"\t大都之内喜气洋洋，张灯结彩，四大才子欲展平生所学，八月十五在勾栏院中将自己的平生之能尽现出来，不想竟遇到了戏中之戏……\n#Y开放时间：#W仅在每周六、日开放！每周只能进入一次！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得海量经验奖励！还可能获得墨玉钻——第三孔打孔道具！",  --【队伍】斗戏勾栏院

											"\t战神大旗被埋葬在战神墓之中，被人们称为战神的旭烈兀在死后，他的灵魂依旧守护者黄金家族的“战神大旗”。察八儿派遣了他最得力的手下，企图进入战神墓盗取战神大旗，以图提高窝阔台家族在黄金家族的地位。察八儿的手下在进入战神墓后，遇上了忽必烈汗派来的守护者。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！有治疗系的队友能更轻松游戏！\n#Y副本说明：#W在这个副本中，你可以获得龙眼石奖励！",  --【队伍】战神墓

											"\t千百年来无数野心家想要得到这个镇国之宝和氏璧，围绕着它的争夺数不胜数，其中有八位野心家不肯承认自己的失败，一直执着地在留在和氏璧之内，只有击败他们才能让异象消失。",  --【队伍】和氏璧

											"\t恭喜你们，百年来从没有人能击败那八个野心家！现在，我将带你们进入金銮殿，如果你能通过金銮殿的考验，除了会得到非凡的奖励之外更有机会金銮殿，预知未来。\n#Y副本说明：#R敌对势力如果高于50，则会副本失败！",  --【队伍】金銮殿

											"\t由于过量开采，惊扰了藏在地下了恶魔，金矿洞内的大量的矿工惨死，在矿洞附近的居民受到了生命威胁。赤老温家族奉大汗的命令，率领众勇士前往矿洞，驱逐敌对势力并杀死恶魔。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得金钱奖励！",  --【队伍】金矿洞

											"\t宋金大战后，镇国之宝和氏璧流落民间，百年后突然出现在了东海海眼之中，找到和氏璧的人只要能够降伏隐藏于和氏璧之中的八位枭雄的魂魄就能够借助和氏璧的力量，预见未来百年之事。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】禁宫大内

											"\t日本武士盘踞在对马岛，阴谋对大元发起攻击。但这个阴谋被大元商人汪大渊获悉，并报给了忽必烈。忽必烈派大元勇士潜入对马岛，火烧日本舰船，消灭了聚集在岛上的日本武士，消除了大元的隐患！\n#Y开放时间：#W全天开放！\n#Y友情提示：#W该副本难度较低，单人建立队伍也可进入该副本！仅能进入一次！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】对马岛

											"\t“黄河石人一只眼，此物一出天下反”，相传在黄河坞内，藏着的绝世宝物--黄河独眼石人有争霸天下的能力。\n\t宝物即将出世的消息传出，引起了三大帮忙的哄抢，明教、盐帮、黄河帮三大帮会聚集黄河坞，为宝物而大打出手，纷争四起。\n\t明教韩山童得消息之后，派你前往黄河坞平息三帮，你在打败三帮高手之后，却发现，原来那所谓的绝世宝物独眼石人，竟然是一只凶恶无比的独眼怪兽，只有击败这怪物，你才能逃出生天。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得制造材料奖励！",  --【队伍】黄河坞

											"\t木华黎的揽月之杖，哲别的逐日之弓，速不台的劈天之斧是大草原最有价值的宝物，传闻这些宝物藏在以逐日、揽月、劈天三个标记的古迹之中。\n\t有人发现了这些古迹的入口，你的使命，便是到古迹之中探宝！一探究竟！\n#Y开放时间：#W国家发布！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】神秘墓穴

											"\t木华黎的揽月之杖，哲别的逐日之弓，速不台的劈天之斧是大草原最有价值的宝物，传闻这些宝物藏在以逐日、揽月、劈天三个标记的古迹之中。\n\t有人发现了这些古迹的入口，你的使命，便是到古迹之中探宝！一探究竟！\n#Y开放时间：#W国家发布！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】神秘墓穴

											"\t木华黎的揽月之杖，哲别的逐日之弓，速不台的劈天之斧是大草原最有价值的宝物，传闻这些宝物藏在以逐日、揽月、劈天三个标记的古迹之中。\n\t有人发现了这些古迹的入口，你的使命，便是到古迹之中探宝！一探究竟！\n#Y开放时间：#W国家发布！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】神秘墓穴

											"\t那些红鼻子蓝眼睛的欧洲大军？他们在塞浦路斯被我们打得屁滚尿流，我们最后却陷入了囚龙岛，被魔龙军团偷袭，没有一个人能活着离开！\n\t这批魔龙军团就在这个岛上的城堡里，他们甘愿服侍两只蓝色的恶龙！我们的士兵无法对付这种怪物！\n\t作为随军的萨满大法师，我燃烧了自己的生命，激活了最强大的禁锢结界，“霹雳神火诀”才不至于流传出去。\n\t我的勇士，进入囚龙城堡，去完成你的使命！",  --【队伍】囚龙城堡

											"\t自从郭宝玉将军战败于囚龙岛后，霹雳神火诀落入囚龙岛的魔龙军团手中，而随军大萨满临终前布下的结界随着时间的推移渐渐失效。一旦让魔龙军团脱困，霹雳神火诀将被欧洲诸国所利用，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t郭侃将军奉命前往囚龙岛调查祖父郭宝玉当年战败的原因，并取回遗失的“霹雳神火诀”，在这个时候，极度需要一群武艺高强，勇气十足的勇士，从囚龙岛进入龙穴，在魔龙的手中拿回“霹雳神火诀”。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【队伍】囚龙岛
											}
x700081_g_LeaveMenuDescList				=	{--副本对话
											"出口说明 1",
											"出口说明 2",
											
											"出口说明 3",  --【试炼】藏宝洞

											"出口说明 4",  --【试炼】景教堂
											
											"\t花剌子模国王魔君摩诃末终于消灭了，大元再次转危为安！天下万民感谢你，大元勇士！",  --【试炼】囚龙堡

											"出口说明 6",  --【试炼】轮回台

											"出口说明 7",  --【试炼】虚空境

											"\t【试炼】战神墓1！",  --【试炼】战神墓

											"\t",  --【试炼】和氏璧

											"\t陈理等这些乱臣贼子妄想夺取和氏璧，南面称王，结果落得个身首异处的下场！由此可见，我大元天子忽必烈才是真命天子，才是和氏璧的真正主人！",  --【试炼】金銮殿

											"\t【试炼】金矿洞1",  --【试炼】金矿洞

											"\t盐帮和漕帮这两个江湖小帮兵微将寡，帮主张士诚和方国珍武功低微，自不量力，居然也想抢夺和氏璧夺取皇位。真是可笑。",  --【试炼】禁宫大内

											"\t大友家的武士以勇猛善战名扬日本，号称精兵。但今日一战，大元将士将他们全歼。可见我战无不胜的大元军队，消灭这些日本武士简直不费吹灰之力！",  --【试炼】对马岛

											"\t日本幕府将军北条时宗和他的旗舰“赤血号”一同葬身海底，侵犯大元的阴谋终告破灭。天佑大元！",  --【试炼】赤血号

											"\t除最后的堡垒——囚龙堡以外，我大军已经占领了的囚龙岛所有地方，胜利就在眼前！但囚龙堡中的摩诃末真身——三头凶蛟凶悍异常，必将垂死挣扎，此后的战斗必将更加激烈！",  --【试炼】囚龙岭

											"\t当年强大无比的花剌子模国都抵挡不住我军奋力一击，更何况是现在小小的囚龙岛？摩诃末派亦难出在这里企图抵挡大军的讨伐，不过是螳臂挡车而已！",  --【试炼】囚龙岛海滩

											"\t【试炼】永夜天牢1",  --【试炼】永夜天牢

											"\t幕府将军北条时宗的这些战船已经燃起熊熊大火，全都沉入海底了，但他的旗舰“赤血号”还在做困兽之斗，垂死挣扎！",  --【试炼】水师大营
											
											"\t【试炼】三打祝家庄（一）1",  --【试炼】三打祝家庄（一）

											"\t【试炼】三打祝家庄（二）1",  --【试炼】三打祝家庄（二）

											"\t【试炼】三打祝家庄（三）1",  --【试炼】三打祝家庄（三）

											"\t完颜洪烈为了复国，将全部希望都寄托在夏王陵中的宝物上，志在必得。因此他在夏王陵一带部署重兵，每前进一步都将非常困难！",--【试炼】探索战神墓（一）
											
											"\t完颜洪烈已经率领他的亲卫进入了夏王墓穴，开始挖掘神兵利器和《元昊兵法》。如果不赶快将他们阻止，一旦神兵利器和《元昊兵法》落入野心勃勃的完颜洪烈手中，那么必将在大元西北掀起一场腥风血雨。",--【试炼】探索战神墓（二）
											
											"\t金国赵王完颜洪烈企图靠夏王陵中的神兵利器和兵法的复国迷梦，终归不过是镜中花水中月，一场空而已！",--【试炼】探索战神墓（三）
											
											"\t我大军势如破竹，那些印度士兵简直就是不堪一击，顷刻间就兵败如山倒。札兰丁居然想依靠他们复国，看来注定要失败。要不是他获得了“不死之身”，札兰丁的复国大计不过是空谈而已。",--【试炼】印度神庙（一）
											
											"\t依靠邪神的庇护，虽然能获得不死之身，耀武扬威，但终归只能得逞一时。任所谓的“不死战神”札兰丁如何刀枪不入，如何战无不胜，最终仍然会被打回原形，被我大军轻而易举的击败！",--【试炼】印度神庙（三）
											
											"\t依靠邪神的庇护，虽然能获得不死之身，耀武扬威，但终归只能得逞一时。任所谓的“不死战神”札兰丁如何刀枪不入，如何战无不胜，最终仍然会被打回原形，被我大军轻而易举的击败！",--【试炼】印度神庙（三）
											
											"\t麻雀岭是大教堂的第一道防线，由腓特烈二世带领善堂骑士团防守与此。但顷刻之间大元勇士就将善堂骑士团已经被全部消灭，将暴君腓特烈二世斩于剑下！",--【试炼】教堂的秘密（一）
											
											"\t熔岩沼泽是大教堂的第二道防线，由暴君圣路易亲自带领条顿骑士团防守。在大元将士的猛攻之下，条顿骑士团摧枯拉朽般的全军覆没，暴君圣路易也身首异处，得到了应有的下场！",--【试炼】教堂的秘密（二）
											
											"\t圣殿骑士团已经被全部消灭，暴君贝拉四世已经伏诛！至此，三大骑士团已经全部被消灭！大教堂在烈焰之中轰然倒塌，力量之源已被完全摧毁！",--【试炼】教堂的秘密（三）
											
											
											
											

											"\t【队伍】钧窑绝迹1",  --【队伍】钧窑绝迹

											"\t【队伍】藏宝洞1",   --【队伍】藏宝洞

											"\t【队伍】景教堂",  --【队伍】景教堂

											"\t花剌子模国王魔君摩诃末终于消灭了，大元再次转危为安！天下万民感谢你，大元勇士！",  --【队伍】囚龙堡

											"\t【队伍】(经验)  1" ,  --【队伍】(经验)        
											"\t【队伍】(声望)  1" ,  --【队伍】(声望)        
											"\t【队伍】(天赋80级以上)1" ,  --【队伍】(天赋80级以上)
											"\t【队伍】倩女幽魂1" ,  --【队伍】倩女幽魂

											"\t【队伍】虚空境1",  --【队伍】虚空境

											"\t【队伍】斗戏勾栏院1",  --【队伍】斗戏勾栏院

											"\t【队伍】战神墓1",  --【队伍】战神墓

											"\t【队伍】和氏璧1",  --【队伍】和氏璧

											"\t陈理等这些乱臣贼子妄想夺取和氏璧，南面称王，结果落得个身首异处的下场！由此可见，我大元天子忽必烈才是真命天子，才是和氏璧的真正主人！",  --【队伍】金銮殿

											"\t【队伍】金矿洞1",  --【队伍】金矿洞

											"\t盐帮和漕帮这两个江湖小帮兵微将寡，帮主张士诚和方国珍武功低微，自不量力，居然也想抢夺和氏璧夺取皇位。真是可笑。",  --【队伍】禁宫大内

											"\t大友家的武士以勇猛善战名扬日本，号称精兵。但今日一战，大元将士将他们全歼。可见我战无不胜的大元军队，消灭这些日本武士简直不费吹灰之力！",  --【队伍】对马岛

											"\t日本幕府将军北条时宗和他的旗舰“赤血号”一同葬身海底，侵犯大元的阴谋终告破灭。天佑大元！",  --【队伍】赤血号

											"\t【队伍】神秘墓穴1",  --【队伍】神秘墓穴

											"\t【队伍】神秘墓穴1-1",  --【队伍】神秘墓穴

											"\t【队伍】神秘墓穴1-2",  --【队伍】神秘墓穴

											"\t除最后的堡垒——囚龙堡以外，我大军已经占领了的囚龙岛所有地方，胜利就在眼前！但囚龙堡中的摩诃末真身——三头凶蛟凶悍异常，必将垂死挣扎，此后的战斗必将更加激烈！",  --【队伍】囚龙岭

											"\t当年强大无比的花剌子模国都抵挡不住我军奋力一击，更何况是现在小小的囚龙岛？摩诃末派亦难出在这里企图抵挡大军的讨伐，不过是螳臂挡车而已！",  --【队伍】囚龙岛

											"\t【队伍】永夜天牢1",  --【队伍】永夜天牢

											"\t【队伍】三打祝家庄（一）1",  --【队伍】三打祝家庄（一）

											"\t【队伍】三打祝家庄（二）1",  --【队伍】三打祝家庄（二）

											"\t【队伍】三打祝家庄（三）1",  --【队伍】三打祝家庄（三）

											"\t幕府将军北条时宗的这些战船已经燃起熊熊大火，全都沉入海底了，但他的旗舰“赤血号”还在做困兽之斗，垂死挣扎！",  --【队伍】水师大营
											
											"\t完颜洪烈为了复国，将全部希望都寄托在夏王陵中的宝物上，志在必得。因此他在夏王陵一带部署重兵，每前进一步都将非常困难！",--【队伍】探索战神墓（一）
											
											"\t完颜洪烈已经率领他的亲卫进入了夏王墓穴，开始挖掘神兵利器和《元昊兵法》。如果不赶快将他们阻止，一旦神兵利器和《元昊兵法》落入野心勃勃的完颜洪烈手中，那么必将在大元西北掀起一场腥风血雨。",--【队伍】探索战神墓（二）
											
											"\t金国赵王完颜洪烈企图靠夏王陵中的神兵利器和兵法的复国迷梦，终归不过是镜中花水中月，一场空而已！",--【队伍】探索战神墓（三）
											
											"\t我大军势如破竹，那些印度士兵简直就是不堪一击，顷刻间就兵败如山倒。札兰丁居然想依靠他们复国，看来注定要失败。要不是他获得了“不死之身”，札兰丁的复国大计不过是空谈而已。",--【队伍】印度神庙（一）
											
											"\t依靠邪神的庇护，虽然能获得不死之身，耀武扬威，但终归只能得逞一时。任所谓的“不死战神”札兰丁如何刀枪不入，如何战无不胜，最终仍然会被打回原形，被我大军轻而易举的击败！",--【队伍】印度神庙（三）
											
											"\t依靠邪神的庇护，虽然能获得不死之身，耀武扬威，但终归只能得逞一时。任所谓的“不死战神”札兰丁如何刀枪不入，如何战无不胜，最终仍然会被打回原形，被我大军轻而易举的击败！",--【队伍】印度神庙（三）
											
											"\t麻雀岭是大教堂的第一道防线，由腓特烈二世带领善堂骑士团防守与此。但顷刻之间大元勇士就将善堂骑士团已经被全部消灭，将暴君腓特烈二世斩于剑下！",--【队伍】教堂的秘密（一）
											
											"\t熔岩沼泽是大教堂的第二道防线，由暴君圣路易亲自带领条顿骑士团防守。在大元将士的猛攻之下，条顿骑士团摧枯拉朽般的全军覆没，暴君圣路易也身首异处，得到了应有的下场！",--【队伍】教堂的秘密（二）
											
											"\t圣殿骑士团已经被全部消灭，暴君贝拉四世已经伏诛！至此，三大骑士团已经全部被消灭！大教堂在烈焰之中轰然倒塌，力量之源已被完全摧毁！",--【队伍】教堂的秘密（三）
											
											"\t【队伍】产出金矿洞1",--【队伍】产出金矿洞
																						
											"\t【队伍】藏宝洞1 1",--【队伍】藏宝洞1  
											
											"\t【队伍】藏宝洞2 1",--【队伍】藏宝洞2 
											
											"\t【队伍】藏宝洞3 1",--【队伍】藏宝洞3 
											
											"\t【队伍】藏宝洞4 1",--【队伍】藏宝洞4 
											
											"\t【队伍】藏宝洞5 1",--【队伍】藏宝洞5 
											
											"\t【队伍】藏宝洞6 1",--【队伍】藏宝洞6
											
											-- HERO TYPE
											"\t自从郭宝玉将军战败于囚龙岛后，霹雳神火诀落入囚龙岛的魔龙军团手中，而随军大萨满临终前布下的结界随着时间的推移渐渐失效。一旦让魔龙军团脱困，霹雳神火诀将被欧洲诸国所利用，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t郭侃将军奉命前往囚龙岛调查祖父郭宝玉当年战败的原因，并取回遗失的“霹雳神火诀”，在这个时候，极度需要一群武艺高强，勇气十足的勇士，从囚龙岛进入龙穴，在魔龙的手中拿回“霹雳神火诀”。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】囚龙岛
											"\t那些红鼻子蓝眼睛的欧洲大军？他们在塞浦路斯被我们打得屁滚尿流，我们最后却陷入了囚龙岛，被魔龙军团偷袭，没有一个人能活着离开！\n\t这批魔龙军团就在这个岛上的城堡里，他们甘愿服侍两只蓝色的恶龙！我们的士兵无法对付这种怪物！\n\t作为随军的萨满大法师，我燃烧了自己的生命，激活了最强大的禁锢结界，“霹雳神火诀”才不至于流传出去。\n\t我的勇士，进入囚龙城堡，去完成你的使命！",  --【英雄】囚龙城堡
											"\t龙穴位于囚龙城堡的海底之中，里面深藏着一只三头凶蛟和各种海底怪物。丢失的“霹雳神火诀”很有可能就在这洞穴之中。\n\t“霹雳神火诀”记载了最厉害的火器制作方法，一旦落入欧洲诸国手中，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t这关系到国家未来的安危，十分火急！你必须进入龙穴，为天下百姓解决这个巨大的隐患！",  --【英雄】龙穴
											"\t宋金大战后，镇国之宝和氏璧流落民间，百年后突然出现在了东海海眼之中，找到和氏璧的人只要能够降伏隐藏于和氏璧之中的八位枭雄的魂魄就能够借助和氏璧的力量，预见未来百年之事。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】禁宫大内
											"\t千百年来无数野心家想要得到这个镇国之宝和氏璧，围绕着它的争夺数不胜数，其中有八位野心家不肯承认自己的失败，一直执着地在留在和氏璧之内，只有击败他们才能让异象消失。",  --【队伍】和氏璧
											"\t恭喜你们，百年来从没有人能击败那八个野心家！现在，我将带你们进入金銮殿，如果你能通过金銮殿的考验，除了会得到非凡的奖励之外更有机会金銮殿，预知未来。\n#Y副本说明：#R敌对势力如果高于50，则会副本失败！",  --【队伍】金銮殿
											"\t前日，陛下做了一奇梦，他梦见自己身处凌霄宝殿，天帝赐他一样异宝—金山大玉海，并告知凭此物可保江山万代不移。\n\t陛下醒来后，立刻命我等寻找那传说中的金山大玉海，经我多方探查，终于查明赤血号与金山大玉海有着千丝万缕的联系，护国天师玄灵道长已经先行带着他的弟子们进入赤血号。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#R在规定时间内摧毁火炮是一切的关键！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】对马岛
											"\t贫道经过仔细探查，发现方才赤血号仅仅是通往金山大玉海所在之处的一个入口。赤血号，是金山大玉海灵气外泄所成，而此处，正是灵气最为浓密所在。且待贫道施展道法，将你们送往那里。",  --【队伍】虚空境
											"\t方才贫道已经施法打开了此处与金山大玉海所在之地的封印，但是……贫道万万没有想到，那里竟然渺无人迹，只有无数凶兽横行。\n\t按照贫道的推算，这奇异之地的时光应当是亿年之前，盘古开天辟地之后的蛮荒时期，这世间之奇妙，确非我等能够想象，不过，金山大玉海毕竟是上古奇异之物，藏于此地并不为怪。",  --【英雄】水师大营
											"\t那时迁人送绰号“鼓上蚤”，见众好汉顺利攻入，连忙施展“缩骨法”，逃出牢笼，祝家庄内机关重重，处处伏兵，时迁虽出牢笼却未能逃出火坑……\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得海量经验奖励！",  --【英雄】三打祝家庄（一）

											"\t本以为可以顺利救出时迁哥哥，不想半路又杀出这个“程咬金”来！看来我们非要二入祝家庄不可，听说那一丈青扈三娘善用异术，庄内五行碑便是她施法的根源。\n\t此庄方圆数里，又勾结官府欺压良民，今日前来正好将它连根拔起，庄内财物抬到山上，足够我等弟兄几年吃喝。\n\t只是怕我们破了那扈三娘的五行碑，他们早已抬走了财宝逃之夭夭，若不先破五行碑那扈三娘着实难以对付。\n\t这可如何是好？\n#Y小提示：\n\t#W扈三娘的能力来自五行碑，如果实力足够，可以选择#G尽量少的破坏五行碑#W，这样在击败扈三娘后会得到#G更丰厚的回报#W。",  --【英雄】三打祝家庄（二）

											"\t我乃神行太保戴宗，此次下山特为送信而来，公明哥哥已经向天禀明，祝家为富不仁，欺压良民，草菅人命，梁山今日之举实为替天行道，绝非滥杀无辜！\n\t这位兄弟，快随我一共杀进祝家庄！\n#Y小提示：\n\t#W如果能够在击败祝氏三兄弟之前击败扈三娘，那么你将会得到非常好的回报，#G九旄战神#W出现的概率也会#G显著提高#W。",  --【英雄】三打祝家庄（三）

											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】探索战神墓（一）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【英雄】探索战神墓（二）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【英雄】探索战神墓（三）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】印度神庙（一）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【英雄】印度神庙（二）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【英雄】印度神庙（三）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】教堂的秘密（一）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【英雄】教堂的秘密（二）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【英雄】教堂的秘密（三）
										}		
										
x700081_g_TeleportWangchengDescList				=	{--副本对话
											"\t你确定要返回王城吗？",
											"\t你确定要返回王城吗？",
											
											"\t你确定要返回王城吗？",  --【试炼】藏宝洞

											"\t你确定要返回王城吗？",  --【试炼】景教堂
											
											"\t你确定要返回王城吗？",  --【试炼】囚龙堡

											"\t你确定要返回王城吗？",  --【试炼】轮回台

											"\t你确定要返回王城吗？",  --【试炼】虚空境

											"\t你确定要返回王城吗？",  --【试炼】战神墓

											"\t你确定要返回王城吗？",  --【试炼】和氏璧

											"\t你确定要返回王城吗？",  --【试炼】金銮殿

											"\t你确定要返回王城吗？",  --【试炼】金矿洞

											"\t你确定要返回王城吗？",  --【试炼】禁宫大内

											"\t你确定要返回王城吗？",  --【试炼】对马岛

											"\t你确定要返回王城吗？",  --【试炼】赤血号

											"\t你确定要返回王城吗？",  --【试炼】囚龙岭

											"\t你确定要返回王城吗？",  --【试炼】囚龙岛海滩

											"\t你确定要返回王城吗？",  --【试炼】永夜天牢

											"\t你确定要返回王城吗？",  --【试炼】水师大营
											
											"\t你确定要返回王城吗？",  --【试炼】三打祝家庄（一）

											"\t你确定要返回王城吗？",  --【试炼】三打祝家庄（二）

											"\t你确定要返回王城吗？",  --【试炼】三打祝家庄（三）

											"\t你确定要返回王城吗？",  --【试炼】探索战神墓（一）
											
											"\t你确定要返回王城吗？",  --【试炼】探索战神墓（二）
											
											"\t你确定要返回王城吗？",  --【试炼】探索战神墓（三）
											
											"\t你确定要返回王城吗？",  --【试炼】印度神庙（一）
											
											"\t你确定要返回王城吗？",  --【试炼】印度神庙（二）
											
											"\t你确定要返回王城吗？",  --【试炼】印度神庙（三）
											
											"\t你确定要返回王城吗？",  --【试炼】教堂的秘密（一）
											
											"\t你确定要返回王城吗？",  --【试炼】教堂的秘密（二）
											
											"\t你确定要返回王城吗？",  --【试炼】教堂的秘密（三）
											
											
											
											

											"\t你确定要返回王城吗？",  --【队伍】钧窑绝迹

											"\t你确定要返回王城吗？",  --【队伍】藏宝洞

											"\t你确定要返回王城吗？",  --【队伍】景教堂

											"\t你确定要返回王城吗？",  --【队伍】囚龙堡

											"\t你确定要返回王城吗？",  --【队伍】(经验)        
											"\t你确定要返回王城吗？",  --【队伍】(声望)        
											"\t你确定要返回王城吗？",  --【队伍】(天赋80级以上)
											"\t你确定要返回王城吗？",  --【队伍】倩女幽魂

											"\t你确定要返回王城吗？",  --【队伍】虚空境

											"\t你确定要返回王城吗？",  --【队伍】斗戏勾栏院

											"\t你确定要返回王城吗？",  --【队伍】战神墓

											"\t你确定要返回王城吗？",  --【队伍】和氏璧

											"\t你确定要返回王城吗？",  --【队伍】金銮殿

											"\t你确定要返回王城吗？",  --【队伍】金矿洞

											"\t你确定要返回王城吗？",  --【队伍】禁宫大内

											"\t你确定要返回王城吗？",  --【队伍】对马岛

											"\t你确定要返回王城吗？",  --【队伍】赤血号

											"\t你确定要返回王城吗？",  --【队伍】神秘墓穴

											"\t你确定要返回王城吗？",  --【队伍】神秘墓穴

											"\t你确定要返回王城吗？",  --【队伍】神秘墓穴

											"\t你确定要返回王城吗？",  --【队伍】囚龙城堡

											"\t你确定要返回王城吗？",  --【队伍】囚龙岛

											"\t你确定要返回王城吗？",  --【队伍】永夜天牢

											"\t你确定要返回王城吗？",  --【队伍】三打祝家庄（一）

											"\t你确定要返回王城吗？",  --【队伍】三打祝家庄（二）

											"\t你确定要返回王城吗？",  --【队伍】三打祝家庄（三）

											"\t你确定要返回王城吗？",  --【队伍】水师大营
											
											"\t你确定要返回王城吗？",  --【队伍】探索战神墓（一）
											
											"\t你确定要返回王城吗？",  --【队伍】探索战神墓（二）
											
											"\t你确定要返回王城吗？",  --【队伍】探索战神墓（三）
											
											"\t你确定要返回王城吗？",  --【队伍】印度神庙（一）
											
											"\t你确定要返回王城吗？",  --【队伍】印度神庙（二）
											
											"\t你确定要返回王城吗？",  --【队伍】印度神庙（三）
											
											"\t你确定要返回王城吗？",  --【队伍】教堂的秘密（一）
											
											"\t你确定要返回王城吗？",  --【队伍】教堂的秘密（二）
											
											"\t你确定要返回王城吗？",  --【队伍】教堂的秘密（三）
											
											"\t你确定要返回王城吗？",  --【队伍】产出金矿洞
																						
											"\t你确定要返回王城吗？",  --【队伍】藏宝洞1  
											
											"\t你确定要返回王城吗？",  --【队伍】藏宝洞2 
											
											"\t你确定要返回王城吗？",  --【队伍】藏宝洞3 
											
											"\t你确定要返回王城吗？",  --【队伍】藏宝洞4 
											
											"\t你确定要返回王城吗？",  --【队伍】藏宝洞5 
											
											"\t你确定要返回王城吗？",  --【队伍】藏宝洞6
											
											-- HERO TYPE
											"\t自从郭宝玉将军战败于囚龙岛后，霹雳神火诀落入囚龙岛的魔龙军团手中，而随军大萨满临终前布下的结界随着时间的推移渐渐失效。一旦让魔龙军团脱困，霹雳神火诀将被欧洲诸国所利用，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t郭侃将军奉命前往囚龙岛调查祖父郭宝玉当年战败的原因，并取回遗失的“霹雳神火诀”，在这个时候，极度需要一群武艺高强，勇气十足的勇士，从囚龙岛进入龙穴，在魔龙的手中拿回“霹雳神火诀”。\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】囚龙岛
											"\t那些红鼻子蓝眼睛的欧洲大军？他们在塞浦路斯被我们打得屁滚尿流，我们最后却陷入了囚龙岛，被魔龙军团偷袭，没有一个人能活着离开！\n\t这批魔龙军团就在这个岛上的城堡里，他们甘愿服侍两只蓝色的恶龙！我们的士兵无法对付这种怪物！\n\t作为随军的萨满大法师，我燃烧了自己的生命，激活了最强大的禁锢结界，“霹雳神火诀”才不至于流传出去。\n\t我的勇士，进入囚龙城堡，去完成你的使命！",  --【英雄】囚龙城堡
											"\t龙穴位于囚龙城堡的海底之中，里面深藏着一只三头凶蛟和各种海底怪物。丢失的“霹雳神火诀”很有可能就在这洞穴之中。\n\t“霹雳神火诀”记载了最厉害的火器制作方法，一旦落入欧洲诸国手中，不久的将来，西方人将手持火器而来，中原大地将受到灭顶之灾。\n\t这关系到国家未来的安危，十分火急！你必须进入龙穴，为天下百姓解决这个巨大的隐患！",  --【英雄】龙穴
											"\t宋金大战后，镇国之宝和氏璧流落民间，百年后突然出现在了东海海眼之中，找到和氏璧的人只要能够降伏隐藏于和氏璧之中的八位枭雄的魂魄就能够借助和氏璧的力量，预见未来百年之事。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】禁宫大内
											"\t千百年来无数野心家想要得到这个镇国之宝和氏璧，围绕着它的争夺数不胜数，其中有八位野心家不肯承认自己的失败，一直执着地在留在和氏璧之内，只有击败他们才能让异象消失。",  --【队伍】和氏璧
											"\t恭喜你们，百年来从没有人能击败那八个野心家！现在，我将带你们进入金銮殿，如果你能通过金銮殿的考验，除了会得到非凡的奖励之外更有机会金銮殿，预知未来。\n#Y副本说明：#R敌对势力如果高于50，则会副本失败！",  --【队伍】金銮殿
											"\t前日，陛下做了一奇梦，他梦见自己身处凌霄宝殿，天帝赐他一样异宝—金山大玉海，并告知凭此物可保江山万代不移。\n\t陛下醒来后，立刻命我等寻找那传说中的金山大玉海，经我多方探查，终于查明赤血号与金山大玉海有着千丝万缕的联系，护国天师玄灵道长已经先行带着他的弟子们进入赤血号。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！#R在规定时间内摧毁火炮是一切的关键！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",  --【英雄】对马岛
											"\t贫道经过仔细探查，发现方才赤血号仅仅是通往金山大玉海所在之处的一个入口。赤血号，是金山大玉海灵气外泄所成，而此处，正是灵气最为浓密所在。且待贫道施展道法，将你们送往那里。",  --【队伍】虚空境
											"\t方才贫道已经施法打开了此处与金山大玉海所在之地的封印，但是……贫道万万没有想到，那里竟然渺无人迹，只有无数凶兽横行。\n\t按照贫道的推算，这奇异之地的时光应当是亿年之前，盘古开天辟地之后的蛮荒时期，这世间之奇妙，确非我等能够想象，不过，金山大玉海毕竟是上古奇异之物，藏于此地并不为怪。",  --【英雄】水师大营
											"\t那时迁人送绰号“鼓上蚤”，见众好汉顺利攻入，连忙施展“缩骨法”，逃出牢笼，祝家庄内机关重重，处处伏兵，时迁虽出牢笼却未能逃出火坑……\n#Y开放时间：#W全天\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得海量经验奖励！",  --【英雄】三打祝家庄（一）

											"\t本以为可以顺利救出时迁哥哥，不想半路又杀出这个“程咬金”来！看来我们非要二入祝家庄不可，听说那一丈青扈三娘善用异术，庄内五行碑便是她施法的根源。\n\t此庄方圆数里，又勾结官府欺压良民，今日前来正好将它连根拔起，庄内财物抬到山上，足够我等弟兄几年吃喝。\n\t只是怕我们破了那扈三娘的五行碑，他们早已抬走了财宝逃之夭夭，若不先破五行碑那扈三娘着实难以对付。\n\t这可如何是好？\n#Y小提示：\n\t#W扈三娘的能力来自五行碑，如果实力足够，可以选择#G尽量少的破坏五行碑#W，这样在击败扈三娘后会得到#G更丰厚的回报#W。",  --【英雄】三打祝家庄（二）

											"\t我乃神行太保戴宗，此次下山特为送信而来，公明哥哥已经向天禀明，祝家为富不仁，欺压良民，草菅人命，梁山今日之举实为替天行道，绝非滥杀无辜！\n\t这位兄弟，快随我一共杀进祝家庄！\n#Y小提示：\n\t#W如果能够在击败祝氏三兄弟之前击败扈三娘，那么你将会得到非常好的回报，#G九旄战神#W出现的概率也会#G显著提高#W。",  --【英雄】三打祝家庄（三）

											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】探索战神墓（一）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【英雄】探索战神墓（二）
											
											"\t金国赵王完颜洪烈在亡国之后，率领残部逃入贺兰山中，妄图复国。他打听到夏王墓中有神兵利器和《元昊兵法》，如果将其夺取可以助其复国，于是率领手下大肆挖掘夏王墓。大元朝廷派遣将士潜入墓穴中，将完颜洪烈等人全部消灭，彻底消灭了金国的残余势力。",--【英雄】探索战神墓（三）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】印度神庙（一）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【英雄】印度神庙（二）
											
											"\t花剌子模王子札兰丁被蒙古人打得全军覆没后逃往印度，却意外获得了不死之身。他率领印度国王借给他的十万大军返回花剌子模，连败蒙古大军。国师丘处机发现了破除札兰丁不死之身的秘密，于是成吉思汗派出蒙古勇士潜入印度丛林中的神庙……",--【英雄】印度神庙（三）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！",--【英雄】教堂的秘密（一）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【英雄】教堂的秘密（二）
											
											"\t欧洲骑士入侵东方，烧杀掳掠无恶不作。旭烈兀率蒙古大军吊民伐罪，却屡屡受挫。原来圣灵教堂是欧洲骑士的力量之源，只有摧毁了这座教堂，旭烈兀的大军才能获胜。为了一洗战败之耻，蒙古大军中的勇士组成奇袭营，偷袭圣灵教堂。",--【英雄】教堂的秘密（三）
										}										
                      
x700081_g_EnterPosList                  =   {--进入副本坐标点
												{ --画皮
													{ idx = 1, x = 69, z=27 },
													{ idx = 2, x = 69, z=24 },
													{ idx = 3, x = 69, z=30 },
													{ idx = 4, x = 66, z=27 },
													{ idx = 5, x = 66, z=24 },
													{ idx = 6, x = 66, z=30 },
												},
												
												{ --天赋副本_比武
													{ idx = 1, x = 109, z=14 },
													{ idx = 2, x = 109, z=15 },
													{ idx = 3, x = 109, z=16 },
													{ idx = 4, x = 109, z=17 },
													{ idx = 5, x = 109, z=18 },
													{ idx = 6, x = 109, z=19 },
												},
												
												{ --【试炼】藏宝洞
													{ idx = 1, x = 109, z=14 },
													{ idx = 2, x = 109, z=15 },
													{ idx = 3, x = 109, z=16 },
													{ idx = 4, x = 109, z=17 },
													{ idx = 5, x = 109, z=18 },
													{ idx = 6, x = 109, z=19 },
												},

												{ --【试炼】景教堂
													{ idx = 1, x = 12, z=103 },
													{ idx = 2, x = 14, z=103 },
													{ idx = 3, x = 16, z=103 },
													{ idx = 4, x = 18, z=103 },
													{ idx = 5, x = 20, z=103 },
													{ idx = 6, x = 22, z=103 },
												},
												
												{ --【试炼】龙穴
													{ idx = 1, x = 24, z=85 },
													{ idx = 2, x = 30, z=85 },
													{ idx = 3, x = 18, z=87 },
													{ idx = 4, x = 25, z=91 },
													{ idx = 5, x = 25, z=81 },
													{ idx = 6, x = 27, z=87 },
												}, 
                                        		
												{ --【试炼】轮回台
												        { idx = 1, x = 64, z=59 },
												        { idx = 2, x = 64, z=58 },
												        { idx = 3, x = 64, z=60 },
												        { idx = 4, x = 62, z=59 },
												        { idx = 5, x = 62, z=58 },
												        { idx = 6, x = 62, z=60 },
												},

												{ --【试炼】虚空境
												        { idx = 1, x = 9 , z=9  },
												        { idx = 2, x = 11, z=9  },
												        { idx = 3, x = 13, z=9  },
												        { idx = 4, x = 9,  z=11 },
												        { idx = 5, x = 11, z=11 },
												        { idx = 6, x = 13, z=11 },
												},

												{--【试炼】战神墓
												        { idx = 1, x = 113, z=15 },
												        { idx = 2, x = 115, z=14 },
												        { idx = 3, x = 113, z=18 },
												        { idx = 4, x = 115, z=18 },
												        { idx = 5, x = 112, z=22 },
												        { idx = 6, x = 114, z=22 },
												},

												{--【试炼】和氏璧
													{ idx = 1, x = 52, z=51 },
													{ idx = 2, x = 55, z=51 },
													{ idx = 3, x = 58, z=51 },
													{ idx = 4, x = 61, z=51 },
													{ idx = 5, x = 64, z=51 },
													{ idx = 6, x = 67, z=51 },
												},

												{--【试炼】金銮殿
													{ idx = 1, x = 62, z=109 },
													{ idx = 2, x = 64, z=109 },
													{ idx = 3, x = 67, z=109 },
													{ idx = 4, x = 65, z=109 },
													{ idx = 5, x = 67, z=108 },
													{ idx = 6, x = 63, z=107 },
												},
	
												{--【试炼】金矿洞
													{ idx = 1, x = 111, z=18 },
													{ idx = 2, x = 111, z=19 },
													{ idx = 3, x = 111, z=20 },
													{ idx = 4, x = 111, z=21 },
													{ idx = 5, x = 111, z=22 },
													{ idx = 6, x = 111, z=23 },
												},

												{--【试炼】禁宫大内
													{ idx = 1, x = 128, z=217 },
													{ idx = 2, x = 129, z=214 },
													{ idx = 3, x = 124, z=213 },
													{ idx = 4, x = 126, z=216 },
													{ idx = 5, x = 128, z=212 },
													{ idx = 6, x = 130, z=215 },
												},

												{--【试炼】对马岛
													{ idx = 1, x = 180, z=120 },
													{ idx = 2, x = 183, z=117 },
													{ idx = 3, x = 185, z=121 },
													{ idx = 4, x = 181, z=121 },
													{ idx = 5, x = 180, z=123 },
													{ idx = 6, x = 183, z=124 },
												},

												{--【试炼】赤血号
													{ idx = 1, x = 116, z=31 },
													{ idx = 2, x = 114, z=31 },
													{ idx = 3, x = 114, z=33 },
													{ idx = 4, x = 116, z=33 },
													{ idx = 5, x = 118, z=33 },
													{ idx = 6, x = 118, z=31 },
												},

												{--【试炼】囚龙城堡
													{ idx = 1, x = 21, z=102 },
													{ idx = 2, x = 24, z=103 },
													{ idx = 3, x = 18, z=98 },
													{ idx = 4, x = 15, z=103 },
													{ idx = 5, x = 19, z=105 },
													{ idx = 6, x = 24, z=97 },
												},

												{--【试炼】囚龙岛
													{ idx = 1, x = 133, z=178  },
													{ idx = 2, x = 132, z=182  },
													{ idx = 3, x = 128, z=183  },
													{ idx = 4, x = 129, z=180  },
													{ idx = 5, x = 130, z=177  },
													{ idx = 6, x = 134, z=181  },	
												},

												{--【试炼】永夜天牢
													{ idx = 1, x = 112, z=15 },
													{ idx = 2, x = 112, z=16 },
													{ idx = 3, x = 112, z=17 },
													{ idx = 4, x = 112, z=18 },
													{ idx = 5, x = 112, z=19 },
													{ idx = 6, x = 112, z=20 },
												},

												{--【试炼】水师大营
												    { idx = 1, x = 108, z=78 },
												    { idx = 2, x = 107, z=80 },
												    { idx = 3, x = 105, z=81 },
												    { idx = 4, x = 103, z=80 },
												    { idx = 5, x = 103, z=83 },
												    { idx = 6, x = 108, z=82 },
												},
												
												{--【试炼】三打祝家庄（一）
													{ idx = 1, x = 130, z=46 },
													{ idx = 2, x = 132, z=46 },
													{ idx = 3, x = 128, z=46 },
													{ idx = 4, x = 134, z=46 },
													{ idx = 5, x = 126, z=46 },
													{ idx = 6, x = 124, z=46 },
												},

												{--【试炼】三打祝家庄（二）
													{ idx = 1, x = 138, z=204 },
													{ idx = 2, x = 139, z=204 },
													{ idx = 3, x = 137, z=204 },
													{ idx = 4, x = 138, z=202 },
													{ idx = 5, x = 139, z=202 },
													{ idx = 6, x = 137, z=202 },
												},

												{--【试炼】三打祝家庄（三）
													{ idx = 1, x = 145, z=210 },
													{ idx = 2, x = 143, z=210 },
													{ idx = 3, x = 147, z=210 },
													{ idx = 4, x = 145, z=206 },
													{ idx = 5, x = 143, z=206 },
													{ idx = 6, x = 147, z=206 },
												},
												
												{--【试炼】探索战神墓（一）
													{ idx = 1, x = 192, z=55 },
													{ idx = 2, x = 196, z=56 },
													{ idx = 3, x = 197, z=54 },
													{ idx = 4, x = 195, z=53 },
													{ idx = 5, x = 201, z=55 },
													{ idx = 6, x = 200, z=53 },
												},

												{--【试炼】探索战神墓（二）
													{ idx = 1, x = 25, z=96  },
													{ idx = 2, x = 25, z=94 },
													{ idx = 3, x = 23, z=96 },
													{ idx = 4, x = 27, z=94  },
													{ idx = 5, x = 30, z=96  },
													{ idx = 6, x = 26, z=98  },
												},

												{--【试炼】探索战神墓（三）
													{ idx = 1, x = 113, z=15 },
													{ idx = 2, x = 115, z=14 },
													{ idx = 3, x = 113, z=18 },
													{ idx = 4, x = 115, z=18 },
													{ idx = 5, x = 112, z=22 },
													{ idx = 6, x = 114, z=22 },
												},
												
												{--【试炼】印度神庙（一）
													{ idx = 1, x = 112, z=49 },
													{ idx = 2, x = 110, z=49 },
													{ idx = 3, x = 115, z=49 },
													{ idx = 4, x = 100, z=52 },
													{ idx = 5, x = 112, z=52 },
													{ idx = 6, x = 115, z=52 },
												},

												{--【试炼】印度神庙（二）
													{ idx = 1, x = 34, z=27 },
													{ idx = 2, x = 36, z=27 },
													{ idx = 3, x = 34, z=30 },
													{ idx = 4, x = 38, z=30 },
													{ idx = 5, x = 38, z=27 },
													{ idx = 6, x = 36, z=30 },
												},

												{--【试炼】印度神庙（三）
													{ idx = 1, x = 67, z=106 },
													{ idx = 2, x = 66, z=106 },
													{ idx = 3, x = 68, z=106 },
													{ idx = 4, x = 67, z=105 },
													{ idx = 5, x = 67, z=107 },
													{ idx = 6, x = 68, z=107 },
												},
												
												{--【试炼】教堂的秘密（一）
													{ idx = 1, x = 192, z=65 },
													{ idx = 2, x = 195, z=65 },
													{ idx = 3, x = 189, z=65 },
													{ idx = 4, x = 192, z=62 },
													{ idx = 5, x = 192, z=67 },
													{ idx = 6, x = 189, z=67 },
												},

												{--【试炼】教堂的秘密（二）
													{ idx = 1, x = 24, z=63 },
													{ idx = 2, x = 22, z=63 },
													{ idx = 3, x = 26, z=63 },
													{ idx = 4, x = 22, z=66 },
													{ idx = 5, x = 24, z=66 },
													{ idx = 6, x = 26, z=66 },
												},

												{--【试炼】教堂的秘密（三）
													{ idx = 1, x = 18, z=103 },
													{ idx = 2, x = 19, z=103 },
													{ idx = 3, x = 20, z=103 },
													{ idx = 4, x = 18, z=101 },
													{ idx = 5, x = 18, z=100 },
													{ idx = 6, x = 18, z=102 },
												},
												
												
												
												
												{--【队伍】钧窑绝迹
													{ idx = 1, x = 121, z=119 },
													{ idx = 2, x = 121, z=121 },
													{ idx = 3, x = 121, z=117 },
													{ idx = 4, x = 123, z=119 },
													{ idx = 5, x = 123, z=121 },
													{ idx = 6, x = 123, z=117 },
												},

												{--【队伍】藏宝洞
													{ idx = 1, x = 109, z=14 },
													{ idx = 2, x = 109, z=15 },
													{ idx = 3, x = 109, z=16 },
													{ idx = 4, x = 109, z=17 },
													{ idx = 5, x = 109, z=18 },
													{ idx = 6, x = 109, z=19 },
												},

												{--【队伍】景教堂
													{ idx = 1, x = 12, z=103 },
													{ idx = 2, x = 14, z=103 },
													{ idx = 3, x = 16, z=103 },
													{ idx = 4, x = 18, z=103 },
													{ idx = 5, x = 20, z=103 },
													{ idx = 6, x = 22, z=103 },
												},

												{--【队伍】龙穴
													{ idx = 1, x = 24, z=85 },
													{ idx = 2, x = 30, z=85 },
													{ idx = 3, x = 18, z=87 },
													{ idx = 4, x = 25, z=91 },
													{ idx = 5, x = 25, z=81 },
													{ idx = 6, x = 27, z=87 },
												},

												{--【队伍】轮回台
													{ idx = 1, x = 64, z=59 },
													{ idx = 2, x = 64, z=58 },
													{ idx = 3, x = 64, z=60 },
													{ idx = 4, x = 62, z=59 },
													{ idx = 5, x = 62, z=58 },
													{ idx = 6, x = 62, z=60 },
												},
												{--【队伍】轮回台
													{ idx = 1, x = 64, z=59 },
													{ idx = 2, x = 64, z=58 },
													{ idx = 3, x = 64, z=60 },
													{ idx = 4, x = 62, z=59 },
													{ idx = 5, x = 62, z=58 },
													{ idx = 6, x = 62, z=60 },
												},
												{--【队伍】轮回台
													{ idx = 1, x = 64, z=59 },
													{ idx = 2, x = 64, z=58 },
													{ idx = 3, x = 64, z=60 },
													{ idx = 4, x = 62, z=59 },
													{ idx = 5, x = 62, z=58 },
													{ idx = 6, x = 62, z=60 },
												},
												{--【队伍】倩女幽魂
													{ idx = 1, x = 110, z=20 },
													{ idx = 2, x = 108, z=18 },
													{ idx = 3, x = 110, z=15 },
													{ idx = 4, x = 113, z=15 },
													{ idx = 5, x = 106, z=18 },
													{ idx = 6, x = 108, z=20 },
												},
												{--【队伍】虚空境
													{ idx = 1, x = 9 , z=9  },
													{ idx = 2, x = 11, z=9  },
													{ idx = 3, x = 13, z=9  },
													{ idx = 4, x = 9,  z=11 },
													{ idx = 5, x = 11, z=11 },
													{ idx = 6, x = 13, z=11 },
												},

												{--【队伍】斗戏勾栏院
													{ idx = 1, x = 38, z=43 },
													{ idx = 2, x = 40, z=43 },
													{ idx = 3, x = 36, z=43 },
													{ idx = 4, x = 37, z=41 },
													{ idx = 5, x = 38, z=45 },
													{ idx = 6, x = 42, z=43 },
												},

												{--【队伍】战神墓
													{ idx = 1, x = 113, z=15 },
													{ idx = 2, x = 115, z=14 },
													{ idx = 3, x = 113, z=18 },
													{ idx = 4, x = 115, z=18 },
													{ idx = 5, x = 112, z=22 },
													{ idx = 6, x = 114, z=22 },
												},

												{--【队伍】和氏璧
													{ idx = 1, x = 52, z=51 },
													{ idx = 2, x = 55, z=51 },
													{ idx = 3, x = 58, z=51 },
													{ idx = 4, x = 61, z=51 },
													{ idx = 5, x = 64, z=51 },
													{ idx = 6, x = 67, z=51 },
												},

												{--【队伍】金銮殿
													{ idx = 1, x = 62, z=109 },
													{ idx = 2, x = 64, z=109 },
													{ idx = 3, x = 67, z=109 },
													{ idx = 4, x = 65, z=109 },
													{ idx = 5, x = 67, z=108 },
													{ idx = 6, x = 63, z=107 },
												},

												{--【队伍】金矿洞
													{ idx = 1, x = 111, z=18 },
													{ idx = 2, x = 111, z=19 },
													{ idx = 3, x = 111, z=20 },
													{ idx = 4, x = 111, z=21 },
													{ idx = 5, x = 111, z=22 },
													{ idx = 6, x = 111, z=23 },
												},

												{--【队伍】禁宫大内

													{ idx = 1, x = 128, z=217 },
													{ idx = 2, x = 129, z=214 },
													{ idx = 3, x = 124, z=213 },
													{ idx = 4, x = 126, z=216 },
													{ idx = 5, x = 128, z=212 },
													{ idx = 6, x = 130, z=215 },

												},

												{--【队伍】对马岛
													{ idx = 1, x = 180, z=120 },
													{ idx = 2, x = 183, z=117 },
													{ idx = 3, x = 185, z=121 },
													{ idx = 4, x = 181, z=121 },
													{ idx = 5, x = 180, z=123 },
													{ idx = 6, x = 183, z=124 },
												},

												{--【队伍】赤血号
													{ idx = 1, x = 116, z=31 },
													{ idx = 2, x = 114, z=31 },
													{ idx = 3, x = 114, z=33 },
													{ idx = 4, x = 116, z=33 },
													{ idx = 5, x = 118, z=33 },
													{ idx = 6, x = 118, z=31 },
												},

												{--【队伍】神秘墓穴（1）
													{ idx = 1, x = 22, z=87 },
													{ idx = 2, x = 22, z=83 },
													{ idx = 3, x = 20, z=82 },
													{ idx = 4, x = 25, z=87 },
													{ idx = 5, x = 24, z=81 },
													{ idx = 6, x = 21, z=80 },
												},

												{--【队伍】神秘墓穴（2）
													{ idx = 1, x = 22, z=87 },
													{ idx = 2, x = 22, z=83 },
													{ idx = 3, x = 20, z=82 },
													{ idx = 4, x = 25, z=87 },
													{ idx = 5, x = 24, z=81 },
													{ idx = 6, x = 21, z=80 },
												},

												{--【队伍】神秘墓穴（3）
													{ idx = 1, x = 22, z=87 },
													{ idx = 2, x = 22, z=83 },
													{ idx = 3, x = 20, z=82 },
													{ idx = 4, x = 25, z=87 },
													{ idx = 5, x = 24, z=81 },
													{ idx = 6, x = 21, z=80 },
												},

												{--【队伍】囚龙城堡
													{ idx = 1, x = 21, z=102 },
													{ idx = 2, x = 24, z=103 },
													{ idx = 3, x = 18, z=98 },
													{ idx = 4, x = 15, z=103 },
													{ idx = 5, x = 19, z=105 },
													{ idx = 6, x = 24, z=97 },
												},

												{--【队伍】囚龙岛
													{ idx = 1, x = 133, z=178  },
													{ idx = 2, x = 132, z=182  },
													{ idx = 3, x = 128, z=183  },
													{ idx = 4, x = 129, z=180  },
													{ idx = 5, x = 130, z=177  },
													{ idx = 6, x = 134, z=181  },	
												},

												{--【队伍】永夜天牢
													{ idx = 1, x = 112, z=15 },
													{ idx = 2, x = 112, z=16 },
													{ idx = 3, x = 112, z=17 },
													{ idx = 4, x = 112, z=18 },
													{ idx = 5, x = 112, z=19 },
													{ idx = 6, x = 112, z=20 },
												},

												{--【队伍】三打祝家庄（一）
													{ idx = 1, x = 130, z=46 },
													{ idx = 2, x = 132, z=46 },
													{ idx = 3, x = 128, z=46 },
													{ idx = 4, x = 134, z=46 },
													{ idx = 5, x = 126, z=46 },
													{ idx = 6, x = 124, z=46 },
												},

												{--【队伍】三打祝家庄（二）
													{ idx = 1, x = 138, z=204 },
													{ idx = 2, x = 139, z=204 },
													{ idx = 3, x = 137, z=204 },
													{ idx = 4, x = 138, z=202 },
													{ idx = 5, x = 139, z=202 },
													{ idx = 6, x = 137, z=202 },
												},

												{--【队伍】三打祝家庄（三）
													{ idx = 1, x = 145, z=210 },
													{ idx = 2, x = 143, z=210 },
													{ idx = 3, x = 147, z=210 },
													{ idx = 4, x = 145, z=206 },
													{ idx = 5, x = 143, z=206 },
													{ idx = 6, x = 147, z=206 },
												},

												{--【队伍】水师大营
												    { idx = 1, x = 108, z=78 },
												    { idx = 2, x = 107, z=80 },
												    { idx = 3, x = 105, z=81 },
												    { idx = 4, x = 103, z=80 },
												    { idx = 5, x = 103, z=83 },
												    { idx = 6, x = 108, z=82 },
												},
												
												{--【队伍】探索战神墓（一）
													{ idx = 1, x = 192, z=55 },
													{ idx = 2, x = 196, z=56 },
													{ idx = 3, x = 197, z=54 },
													{ idx = 4, x = 195, z=53 },
													{ idx = 5, x = 201, z=55 },
													{ idx = 6, x = 200, z=53 },
												},

												{--【队伍】探索战神墓（二）
													{ idx = 1, x = 25, z=96  },
													{ idx = 2, x = 25, z=94 },
													{ idx = 3, x = 23, z=96 },
													{ idx = 4, x = 27, z=94  },
													{ idx = 5, x = 30, z=96  },
													{ idx = 6, x = 26, z=98  },
												},

												{--【队伍】探索战神墓（三）
													{ idx = 1, x = 113, z=15 },
													{ idx = 2, x = 115, z=14 },
													{ idx = 3, x = 113, z=18 },
													{ idx = 4, x = 115, z=18 },
													{ idx = 5, x = 112, z=22 },
													{ idx = 6, x = 114, z=22 },
												},
												
												{--【队伍】印度神庙（一）
													{ idx = 1, x = 112, z=49 },
													{ idx = 2, x = 110, z=49 },
													{ idx = 3, x = 115, z=49 },
													{ idx = 4, x = 100, z=52 },
													{ idx = 5, x = 112, z=52 },
													{ idx = 6, x = 115, z=52 },
												},

												{--【队伍】印度神庙（二）
													{ idx = 1, x = 34, z=27 },
													{ idx = 2, x = 36, z=27 },
													{ idx = 3, x = 34, z=30 },
													{ idx = 4, x = 38, z=30 },
													{ idx = 5, x = 38, z=27 },
													{ idx = 6, x = 36, z=30 },
												},

												{--【队伍】印度神庙（三）
													{ idx = 1, x = 67, z=106 },
													{ idx = 2, x = 66, z=106 },
													{ idx = 3, x = 68, z=106 },
													{ idx = 4, x = 67, z=105 },
													{ idx = 5, x = 67, z=107 },
													{ idx = 6, x = 68, z=107 },
												},
												
												{--【队伍】教堂的秘密（一）
													{ idx = 1, x = 192, z=65 },
													{ idx = 2, x = 195, z=65 },
													{ idx = 3, x = 189, z=65 },
													{ idx = 4, x = 192, z=62 },
													{ idx = 5, x = 192, z=67 },
													{ idx = 6, x = 189, z=67 },
												},

												{--【队伍】教堂的秘密（二）
													{ idx = 1, x = 24, z=63 },
													{ idx = 2, x = 22, z=63 },
													{ idx = 3, x = 26, z=63 },
													{ idx = 4, x = 22, z=66 },
													{ idx = 5, x = 24, z=66 },
													{ idx = 6, x = 26, z=66 },
												},

												{--【队伍】教堂的秘密（三）
													{ idx = 1, x = 18, z=103 },
													{ idx = 2, x = 19, z=103 },
													{ idx = 3, x = 20, z=103 },
													{ idx = 4, x = 18, z=101 },
													{ idx = 5, x = 18, z=100 },
													{ idx = 6, x = 18, z=102 },
												},
												
												{--【队伍】产出金矿洞
													{ idx = 1, x = 111, z=18 },
													{ idx = 2, x = 111, z=19 },
													{ idx = 3, x = 111, z=20 },
													{ idx = 4, x = 111, z=21 },
													{ idx = 5, x = 111, z=22 },
													{ idx = 6, x = 111, z=23 },
												},
																								
												{--【队伍】藏宝洞1
													{ idx = 1, x = 109, z=14 },
													{ idx = 2, x = 109, z=15 },
													{ idx = 3, x = 109, z=16 },
													{ idx = 4, x = 109, z=17 },
													{ idx = 5, x = 109, z=18 },
													{ idx = 6, x = 109, z=19 },
												},
												
												{--【队伍】藏宝洞2
													{ idx = 1, x = 109, z=14 },
													{ idx = 2, x = 109, z=15 },
													{ idx = 3, x = 109, z=16 },
													{ idx = 4, x = 109, z=17 },
													{ idx = 5, x = 109, z=18 },
													{ idx = 6, x = 109, z=19 },
												},
												
												{--【队伍】藏宝洞3
													{ idx = 1, x = 109, z=14 },
													{ idx = 2, x = 109, z=15 },
													{ idx = 3, x = 109, z=16 },
													{ idx = 4, x = 109, z=17 },
													{ idx = 5, x = 109, z=18 },
													{ idx = 6, x = 109, z=19 },
												},
												
												{--【队伍】藏宝洞4
													{ idx = 1, x = 109, z=14 },
													{ idx = 2, x = 109, z=15 },
													{ idx = 3, x = 109, z=16 },
													{ idx = 4, x = 109, z=17 },
													{ idx = 5, x = 109, z=18 },
													{ idx = 6, x = 109, z=19 },
												},
												
												{--【队伍】藏宝洞5
													{ idx = 1, x = 109, z=14 },
													{ idx = 2, x = 109, z=15 },
													{ idx = 3, x = 109, z=16 },
													{ idx = 4, x = 109, z=17 },
													{ idx = 5, x = 109, z=18 },
													{ idx = 6, x = 109, z=19 },
												},
												
												{--【队伍】藏宝洞6
													{ idx = 1, x = 113, z=37 },
													{ idx = 2, x = 108, z=37 },
													{ idx = 3, x = 108, z=31 },
													{ idx = 4, x = 110, z=30 },
													{ idx = 5, x = 114, z=32 },
													{ idx = 6, x = 109, z=35 },
												},
												
												--英雄模式==============================
												
												{--【英雄】囚龙岛
													{ idx = 1, x = 26, z=103  },
													{ idx = 2, x = 25, z=102  },
													{ idx = 3, x = 24, z=101  },
													{ idx = 4, x = 23, z=100  },
													{ idx = 5, x = 22, z=99   },
													{ idx = 6, x = 21, z=98   },
												},

												{--【英雄】囚龙城堡
													{ idx = 1, x = 25, z=88 },
													{ idx = 2, x = 26, z=88 },
													{ idx = 3, x = 27, z=88 },
													{ idx = 4, x = 25, z=89 },
													{ idx = 5, x = 25, z=90 },
													{ idx = 6, x = 27, z=90 },
												},
												{--【英雄】龙穴
													{ idx = 1, x = 24, z=25 },
													{ idx = 2, x = 25, z=23 },
													{ idx = 3, x = 22, z=26 },
													{ idx = 4, x = 25, z=28 },
													{ idx = 5, x = 26, z=26 },
													{ idx = 6, x = 27, z=23 },
												},
												
												{--【英雄】禁宫大内
													{ idx = 1, x = 24, z=38 },
													{ idx = 2, x = 20, z=38 },
													{ idx = 3, x = 18, z=38 },
													{ idx = 4, x = 18, z=36 },
													{ idx = 5, x = 21, z=36 },
													{ idx = 6, x = 25, z=35 },
												},
												{--【英雄】和氏璧
													{ idx = 1, x = 52, z=51 },
													{ idx = 2, x = 55, z=51 },
													{ idx = 3, x = 58, z=51 },
													{ idx = 4, x = 61, z=51 },
													{ idx = 5, x = 64, z=51 },
													{ idx = 6, x = 67, z=51 },
												},

												{--【英雄】金銮殿
													{ idx = 1, x = 64, z=21 },
													{ idx = 2, x = 65, z=21 },
													{ idx = 3, x = 66, z=21 },
													{ idx = 4, x = 67, z=18 },
													{ idx = 5, x = 63, z=18 },
													{ idx = 6, x = 64, z=23 },
												},
												{--【英雄】对马岛
													{ idx = 1, x = 23, z=104 },
													{ idx = 2, x = 22, z=104 },
													{ idx = 3, x = 21, z=104 },
													{ idx = 4, x = 20, z=104 },
													{ idx = 5, x = 21, z=106 },
													{ idx = 6, x = 22, z=106 },
												},
												{--【英雄】虚空境
													{ idx = 1, x = 9 , z=9  },
													{ idx = 2, x = 11, z=9  },
													{ idx = 3, x = 13, z=9  },
													{ idx = 4, x = 9,  z=11 },
													{ idx = 5, x = 11, z=11 },
													{ idx = 6, x = 13, z=11 },
												},
												{--【英雄】水师大营
												    { idx = 1, x = 22, z=24 },
												    { idx = 2, x = 24, z=22 },
												    { idx = 3, x = 27, z=21 },
												    { idx = 4, x = 29, z=24 },
												    { idx = 5, x = 28, z=26 },
												    { idx = 6, x = 26, z=28 },
												},
												{--【英雄】三打祝家庄（一）
													{ idx = 1, x = 130, z=46 },
													{ idx = 2, x = 132, z=46 },
													{ idx = 3, x = 128, z=46 },
													{ idx = 4, x = 134, z=46 },
													{ idx = 5, x = 126, z=46 },
													{ idx = 6, x = 124, z=46 },
												},

												{--【英雄】三打祝家庄（二）
													{ idx = 1, x = 138, z=204 },
													{ idx = 2, x = 139, z=204 },
													{ idx = 3, x = 137, z=204 },
													{ idx = 4, x = 138, z=202 },
													{ idx = 5, x = 139, z=202 },
													{ idx = 6, x = 137, z=202 },
												},

												{--【英雄】三打祝家庄（三）
													{ idx = 1, x = 145, z=210 },
													{ idx = 2, x = 143, z=210 },
													{ idx = 3, x = 147, z=210 },
													{ idx = 4, x = 145, z=206 },
													{ idx = 5, x = 143, z=206 },
													{ idx = 6, x = 147, z=206 },
												},
												{--【英雄】探索战神墓（一）
													{ idx = 1, x = 196, z=53 },
													{ idx = 2, x = 200, z=53 },
													{ idx = 3, x = 193, z=53 },
													{ idx = 4, x = 200, z=50 },
													{ idx = 5, x = 196, z=50 },
													{ idx = 6, x = 193, z=50 },
												},

												{--【英雄】探索战神墓（二）
													{ idx = 1, x = 24, z=99  },
													{ idx = 2, x = 26, z=100 },
													{ idx = 3, x = 24, z=100 },
													{ idx = 4, x = 26, z=99  },
													{ idx = 5, x = 25, z=96  },
													{ idx = 6, x = 27, z=98  },
												},

												{--【英雄】探索战神墓（三）
													{ idx = 1, x = 113, z=15 },
													{ idx = 2, x = 115, z=14 },
													{ idx = 3, x = 113, z=18 },
													{ idx = 4, x = 115, z=18 },
													{ idx = 5, x = 112, z=22 },
													{ idx = 6, x = 114, z=22 },
												},
												
												{--【英雄】印度神庙（一）
													{ idx = 1, x = 112, z=49 },
													{ idx = 2, x = 110, z=49 },
													{ idx = 3, x = 115, z=49 },
													{ idx = 4, x = 100, z=52 },
													{ idx = 5, x = 112, z=52 },
													{ idx = 6, x = 115, z=52 },
												},

												{--【英雄】印度神庙（二）
													{ idx = 1, x = 34, z=27 },
													{ idx = 2, x = 36, z=27 },
													{ idx = 3, x = 34, z=30 },
													{ idx = 4, x = 38, z=30 },
													{ idx = 5, x = 38, z=27 },
													{ idx = 6, x = 36, z=30 },
												},

												{--【英雄】印度神庙（三）
													{ idx = 1, x = 67, z=106 },
													{ idx = 2, x = 66, z=106 },
													{ idx = 3, x = 68, z=106 },
													{ idx = 4, x = 67, z=105 },
													{ idx = 5, x = 67, z=107 },
													{ idx = 6, x = 68, z=107 },
												},
												
												{--【英雄】教堂的秘密（一）
													{ idx = 1, x = 192, z=65 },
													{ idx = 2, x = 195, z=65 },
													{ idx = 3, x = 189, z=65 },
													{ idx = 4, x = 192, z=62 },
													{ idx = 5, x = 192, z=67 },
													{ idx = 6, x = 189, z=67 },
												},

												{--【英雄】教堂的秘密（二）
													{ idx = 1, x = 24, z=63 },
													{ idx = 2, x = 22, z=63 },
													{ idx = 3, x = 26, z=63 },
													{ idx = 4, x = 22, z=66 },
													{ idx = 5, x = 24, z=66 },
													{ idx = 6, x = 26, z=66 },
												},

												{--【英雄】教堂的秘密（三）
													{ idx = 1, x = 18, z=103 },
													{ idx = 2, x = 19, z=103 },
													{ idx = 3, x = 20, z=103 },
													{ idx = 4, x = 18, z=101 },
													{ idx = 5, x = 18, z=100 },
													{ idx = 6, x = 18, z=102 },
												},

											}
--出去位置
x700081_g_BackPosList                  =   {--返回场景的坐标点
												{ --画皮
													{ idx = 1, x = 126, z=110 },
													{ idx = 2, x = 126, z=110 },
													{ idx = 3, x = 126, z=110 },
													{ idx = 4, x = 126, z=110 },
													{ idx = 5, x = 126, z=110 },
													{ idx = 6, x = 126, z=110 },
												},
												
												{ --天赋副本_比武
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},


												{--【试炼】藏宝洞
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_bamiyangshiku

												{--【试炼】景教堂
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_dawushi
												
												{--【试炼】龙穴
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_donghaihaiyan

												{--【试炼】轮回台
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
													{ idx = 7, x = 128, z=128 },
													{ idx = 8, x = 128, z=128 },
													{ idx = 9, x = 128, z=128 },
												},--fuben_try_fututa_4

												{--【试炼】虚空境
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_fututa_6

												{--【试炼】战神墓
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_gumu

												{--【试炼】和氏璧
												  { idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_heshibishang

												{--【试炼】金銮殿
												  { idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_heshibixia

												{--【试炼】金矿洞
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_huangjinkuangdong

												{--【试炼】禁宫大内
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_hudi

												{--【试炼】对马岛
												  { idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_huocaishendian

												{--【试炼】黄河坞
												  { idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_huoqiying

												{--【试炼】囚龙城堡
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_lanlongchengbao

												{--【试炼】囚龙岛
												  { idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_qiulongdao

												{--【试炼】永夜天牢
												  { idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_shizijing

												{--【试炼】水师大营
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_zhuluoji
												
												{--【试炼】三打祝家庄（一）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【试炼】三打祝家庄（二）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【试炼】三打祝家庄（三）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【试炼】探索战神墓（一）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【试炼】探索战神墓（二）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【试炼】探索战神墓（三）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												
												{--【试炼】印度神庙（一）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【试炼】印度神庙（二）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【试炼】印度神庙（三）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												
												{--【试炼】教堂的秘密（一）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【试炼】教堂的秘密（二）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【试炼】教堂的秘密（三）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												
												
												
												

												{--【队伍】钧窑绝迹
													{ idx = 1, x = 40, z=129 },
													{ idx = 2, x = 40, z=129 },
													{ idx = 3, x = 40, z=129 },
													{ idx = 4, x = 40, z=129 },
													{ idx = 5, x = 40, z=129 },
													{ idx = 6, x = 40, z=129 },
												},
												{--【队伍】藏宝洞
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】景教堂
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【队伍】龙穴
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】轮回台
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
													{ idx = 7, x = 128, z=128 },
													{ idx = 8, x = 128, z=128 },
													{ idx = 9, x = 128, z=128 },
												},
												{--【队伍】轮回台
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
													{ idx = 7, x = 128, z=128 },
													{ idx = 8, x = 128, z=128 },
													{ idx = 9, x = 128, z=128 },
												},
												{--【队伍】轮回台
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
													{ idx = 7, x = 128, z=128 },
													{ idx = 8, x = 128, z=128 },
													{ idx = 9, x = 128, z=128 },
												},
												{--【队伍】倩女幽魂
													{ idx = 1, x = 126, z=110 },
													{ idx = 2, x = 126, z=110 },
													{ idx = 3, x = 126, z=110 },
													{ idx = 4, x = 126, z=110 },
													{ idx = 5, x = 126, z=110 },
													{ idx = 6, x = 126, z=110 },
													{ idx = 7, x = 126, z=110 },
													{ idx = 8, x = 126, z=110 },
													{ idx = 9, x = 126, z=110 },
												},
												{--【队伍】虚空境
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】斗戏勾栏院
													{ idx = 1, x = 156, z=59 },
													{ idx = 2, x = 156, z=59 },
													{ idx = 3, x = 156, z=59 },
													{ idx = 4, x = 156, z=59 },
													{ idx = 5, x = 156, z=59 },
													{ idx = 6, x = 156, z=59 },
												},

												{--【队伍】战神墓
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】和氏璧
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】金銮殿
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】金矿洞
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】禁宫大内
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】对马岛
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 }, 
												},

												{--【队伍】黄河坞
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】神秘墓穴（1）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】神秘墓穴（2）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】神秘墓穴（3）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】囚龙城堡
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】囚龙岛
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】永夜天牢
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】三打祝家庄（一）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【队伍】三打祝家庄（二）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】三打祝家庄（三）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】水师大营
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【队伍】探索战神墓（一）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】探索战神墓（二）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】探索战神墓（三）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												
												{--【队伍】印度神庙（一）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】印度神庙（二）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】印度神庙（三）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												
												{--【队伍】教堂的秘密（一）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】教堂的秘密（二）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【队伍】教堂的秘密（三）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												
												{--【队伍】产出金矿洞
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												
												{--【队伍】藏宝洞1
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【队伍】藏宝洞2
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【队伍】藏宝洞3
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【队伍】藏宝洞4
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【队伍】藏宝洞5
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【队伍】藏宝洞6
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												--英雄模式==============================
												

												{--【英雄】囚龙岛
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【英雄】囚龙城堡
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【英雄】龙穴
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_donghaihaiyan


												
												{--【英雄】禁宫大内
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【英雄】和氏璧
												  { idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_heshibishang

												{--【英雄】金銮殿
												  { idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_heshibixia
												{--【英雄】对马岛
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 }, 
												},
												{--【英雄】虚空境
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},--fuben_try_fututa_6
												{--【英雄】水师大营
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												
												{--【英雄】三打祝家庄（一）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【英雄】三打祝家庄（二）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【英雄】三打祝家庄（三）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												{--【英雄】探索战神墓（一）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【英雄】探索战神墓（二）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【英雄】探索战神墓（三）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												
												{--【英雄】印度神庙（一）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【英雄】印度神庙（二）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【英雄】印度神庙（三）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},
												
												{--【英雄】教堂的秘密（一）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【英雄】教堂的秘密（二）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

												{--【英雄】教堂的秘密（三）
													{ idx = 1, x = 128, z=128 },
													{ idx = 2, x = 128, z=128 },
													{ idx = 3, x = 128, z=128 },
													{ idx = 4, x = 128, z=128 },
													{ idx = 5, x = 128, z=128 },
													{ idx = 6, x = 128, z=128 },
												},

											}


x700081_g_Item_XJ						=	{--现金副本，需要的物品
												{itemid=0, count=0},			      --画皮   
												{itemid=0, count=0},			      --天赋副本_比武    
												{itemid=0, count=0},			      --【试炼】藏宝洞          
												{itemid=0, count=0},            --【试炼】景教堂          
												{itemid=0, count=0},            --【试炼】龙穴            
												{itemid=0, count=0},            --【试炼】轮回台          
												{itemid=0, count=0},            --【试炼】虚空境          
												{itemid=0, count=0},            --【试炼】战神墓          
												{itemid=0, count=0},            --【试炼】和氏璧        
												{itemid=0, count=0},            --【试炼】金銮殿       
												{itemid=0, count=0},            --【试炼】金矿洞          
												{itemid=0, count=0},            --【试炼】禁宫大内        
												{itemid=0, count=0},            --【试炼】对马岛      
												{itemid=0, count=0},            --【试炼】赤血号         
												{itemid=0, count=0},            --【试炼】囚龙城堡        
												{itemid=0, count=0},            --【试炼】囚龙岛          
												{itemid=0, count=0},            --【试炼】永夜天牢        
												{itemid=0, count=0},            --【试炼】水师大营   
												{itemid=0, count=0},     		    --【试炼】三打祝家庄（一）
												{itemid=0, count=0},     		    --【试炼】三打祝家庄（二）
												{itemid=0, count=0},     		    --【试炼】三打祝家庄（三）
												{itemid=0, count=0},     		    --【试炼】探索战神墓（一）
												{itemid=0, count=0},     		    --【试炼】探索战神墓（二）
												{itemid=0, count=0},     		    --【试炼】探索战神墓（三）
												{itemid=0, count=0},     		    --【试炼】印度神庙（一）
												{itemid=0, count=0},    		    --【试炼】印度神庙（二）
												{itemid=0, count=0},     		    --【试炼】印度神庙（三）
												{itemid=0, count=0},     		    --【试炼】教堂的秘密（一）
												{itemid=0, count=0},     		    --【试炼】教堂的秘密（二）
												{itemid=0, count=0},     		    --【试炼】教堂的秘密（三）
												
																								   
												{itemid=0, count=0},            --【队伍】钧窑绝迹        
												{itemid=11990012, count=1},     --【队伍】藏宝洞          
												{itemid=11990012, count=1},     --【队伍】景教堂          
												{itemid=0, count=0},            --【队伍】龙穴            
												{itemid=0, count=0},            --【队伍】轮回台(经验)                  
												{itemid=0, count=0},            --【队伍】轮回台(声望)                  
												{itemid=0, count=0},            --【队伍】轮回台(天赋80级以上)          
												{itemid=0, count=0},            --【队伍】倩女幽魂
												{itemid=0, count=0},            --【队伍】虚空境          
												{itemid=0, count=0},            --【队伍】斗戏勾栏院      
												{itemid=11990012, count=1},     --【队伍】战神墓          
												{itemid=0, count=0},            --【队伍】和氏璧        
												{itemid=0, count=0},            --【队伍】金銮殿       
												{itemid=11990012, count=1},     --【队伍】金矿洞          
												{itemid=11990011, count=1},     --【队伍】禁宫大内        
												{itemid=11990011, count=1},     --【队伍】对马岛      
												{itemid=0, count=0},   				  --【队伍】赤血号         
												{itemid=0, count=0},            --【队伍】神秘墓穴        
												{itemid=0, count=0},            --【队伍】神秘墓穴        
												{itemid=0, count=0},            --【队伍】神秘墓穴        
												{itemid=0, count=0},            --【队伍】囚龙城堡        
												{itemid=11990011, count=1},     --【队伍】囚龙岛          
												{itemid=11990012, count=1},     --【队伍】永夜天牢        
												{itemid=11990011, count=1},     --【队伍】三打祝家庄（一）
												{itemid=0, count=0},            --【队伍】三打祝家庄（二）
												{itemid=0, count=0},            --【队伍】三打祝家庄（三）
												{itemid=0, count=0},            --【队伍】水师大营 
												{itemid=11990011, count=1},     --【队伍】探索战神墓（一）
												{itemid=0, count=0},            --【队伍】探索战神墓（二）
												{itemid=0, count=0},            --【队伍】探索战神墓（三）
												{itemid=11990011, count=1},     --【队伍】印度神庙（一）
												{itemid=0, count=0},            --【队伍】印度神庙（二）
												{itemid=0, count=0},            --【队伍】印度神庙（三）
												{itemid=11990011, count=1},     --【队伍】教堂的秘密（一）
												{itemid=0, count=0},            --【队伍】教堂的秘密（二）
												{itemid=0, count=0},            --【队伍】教堂的秘密（三）
												{itemid=11990012, count=1},     --【队伍】产出金矿洞
																								
												{itemid=11990012, count=1},     --【队伍】藏宝洞1
												{itemid=11990012, count=1},     --【队伍】藏宝洞2
												{itemid=11990012, count=1},     --【队伍】藏宝洞3
												{itemid=11990012, count=1},     --【队伍】藏宝洞4
												{itemid=11990012, count=1},     --【队伍】藏宝洞5
												{itemid=11990012, count=1},     --【队伍】藏宝洞6
												
												
												--英雄模式
												{itemid=0, count=0},           --【英雄】囚龙岛",                 
												{itemid=0, count=0},           --【英雄】囚龙城堡",               
												{itemid=0, count=0},           --【英雄】龙穴",                   
												{itemid=0, count=0},           --【英雄】禁宫大内",               
												{itemid=0, count=0},           --【英雄】和氏璧",               
												{itemid=0, count=0},           --【英雄】金銮殿",               
												{itemid=0, count=0},           --【英雄】对马岛",             
												{itemid=0, count=0},           --【英雄】虚空境",                 
												{itemid=0, count=0},           --【英雄】水师大营",             
												{itemid=0, count=0},           --【英雄】三打祝家庄（一）",       
												{itemid=0, count=0},           --【英雄】三打祝家庄（二）",       
												{itemid=0, count=0},           --【英雄】三打祝家庄（三）",       
												{itemid=0, count=0},           --【英雄】探索战神墓（一）",       
												{itemid=0, count=0},           --【英雄】探索战神墓（二）",       
												{itemid=0, count=0},     		   --【英雄】探索战神墓（三）",       
												{itemid=0, count=0},     		   --【英雄】印度神庙（一） ",        
												{itemid=0, count=0},     		   --【英雄】印度神庙（二） ",        
												{itemid=0, count=0},     		   --【英雄】印度神庙（三） ",        
												{itemid=0, count=0},     		   --【英雄】教堂的秘密（一）",       
												{itemid=0, count=0},     		   --【英雄】教堂的秘密（二）",       
												{itemid=0, count=0},     		   --【英雄】教堂的秘密（三）",      
										  		
											}

x700081_g_Item_ZHOUXJ						=	{								--周现金副本，需要的物品 ZHOUXJ
												{itemid=0, count=0},			      --画皮
												{itemid=0, count=0},			      --天赋副本_比武
												{itemid=0, count=0},								--【试炼】藏宝洞               
												{itemid=0, count=0},                --【试炼】景教堂               
												{itemid=0, count=0},                --【试炼】龙穴                 
												{itemid=0, count=0},                --【试炼】轮回台               
												{itemid=0, count=0},                --【试炼】虚空境               
												{itemid=0, count=0},                --【试炼】战神墓               
												{itemid=0, count=0},                --【试炼】和氏璧             
												{itemid=0, count=0},                --【试炼】金銮殿            
												{itemid=0, count=0},                --【试炼】金矿洞               
												{itemid=0, count=0},                --【试炼】禁宫大内             
												{itemid=0, count=0},                --【试炼】对马岛           
												{itemid=0, count=0},                --【试炼】赤血号              
												{itemid=0, count=0},                --【试炼】囚龙城堡             
												{itemid=0, count=0},                --【试炼】囚龙岛               
												{itemid=0, count=0},                --【试炼】永夜天牢             
												{itemid=0, count=0},                --【试炼】水师大营   
												{itemid=0, count=0},         		    --【试炼】三打祝家庄（一）     
												{itemid=0, count=0},         		    --【试炼】三打祝家庄（二）     
												{itemid=0, count=0},         		    --【试炼】三打祝家庄（三）     
												{itemid=0, count=0},     			      --【试炼】探索战神墓（一）
												{itemid=0, count=0},     			      --【试炼】探索战神墓（二）
												{itemid=0, count=0},     			      --【试炼】探索战神墓（三）
												{itemid=0, count=0},     			      --【试炼】印度神庙（一）
												{itemid=0, count=0},     			      --【试炼】印度神庙（二）
												{itemid=0, count=0},     			      --【试炼】印度神庙（三）
												{itemid=0, count=0},     			      --【试炼】教堂的秘密（一）
												{itemid=0, count=0},     			      --【试炼】教堂的秘密（二）
												{itemid=0, count=0},     			      --【试炼】教堂的秘密（三）
																								        
												{itemid=0, count=0},                --【队伍】钧窑绝迹             
												{itemid=11990012, count=1},         --【队伍】藏宝洞               
												{itemid=11990012, count=1},         --【队伍】景教堂               
												{itemid=11990012, count=0},         --【队伍】龙穴                 
												{itemid=0, count=0},                --【队伍】轮回台 (经验)                       
												{itemid=0, count=0},                --【队伍】轮回台 (声望)          
												{itemid=0, count=0},                --【队伍】轮回台 (天赋80级以上)  
												{itemid=0, count=0},                --【队伍】倩女幽魂
												{itemid=11990012, count=0},         --【队伍】虚空境               
												{itemid=0, count=0},                --【队伍】斗戏勾栏院           
												{itemid=11990012, count=1},         --【队伍】战神墓               
												{itemid=11990012, count=0},         --【队伍】和氏璧             
												{itemid=11990012, count=0},         --【队伍】金銮殿            
												{itemid=11990012, count=1},         --【队伍】金矿洞               
												{itemid=11990011, count=1},         --【队伍】禁宫大内             
												{itemid=11990011, count=1},         --【队伍】对马岛           
												{itemid=11990012, count=1},         --【队伍】赤血号              
												{itemid=0, count=0},                --【队伍】神秘墓穴             
												{itemid=0, count=0},                --【队伍】神秘墓穴             
												{itemid=0, count=0},                --【队伍】神秘墓穴             
												{itemid=11990011, count=0},         --【队伍】囚龙城堡             
												{itemid=11990011, count=1},         --【队伍】囚龙岛               
												{itemid=11990012, count=1},         --【队伍】永夜天牢             
												{itemid=11990011, count=1},         --【队伍】三打祝家庄（一）     
												{itemid=11990011, count=0},         --【队伍】三打祝家庄（二）     
												{itemid=11990011, count=0},         --【队伍】三打祝家庄（三）     
												{itemid=11990011, count=0},         --【队伍】水师大营  
												{itemid=11990011, count=1},     		--【队伍】探索战神墓（一）
												{itemid=11990011, count=0},     		--【队伍】探索战神墓（二）
												{itemid=11990011, count=0},     		--【队伍】探索战神墓（三）
												{itemid=11990011, count=1},     		--【队伍】印度神庙（一）
												{itemid=11990011, count=0},     		--【队伍】印度神庙（二）
												{itemid=11990011, count=0},     		--【队伍】印度神庙（三）
												{itemid=11990011, count=1},     		--【队伍】教堂的秘密（一）
												{itemid=11990011, count=0},     		--【队伍】教堂的秘密（二）
												{itemid=11990011, count=0},     		--【队伍】教堂的秘密（三）
												{itemid=11990012, count=1},     		--【队伍】产出金矿洞
																								
												{itemid=11990012, count=1},         --【队伍】藏宝洞1
												{itemid=11990012, count=1},         --【队伍】藏宝洞2
												{itemid=11990012, count=1},         --【队伍】藏宝洞3
												{itemid=11990012, count=1},         --【队伍】藏宝洞4
												{itemid=11990012, count=1},         --【队伍】藏宝洞5
												{itemid=11990012, count=1},         --【队伍】藏宝洞6 	
												
												--英雄模式
												{itemid=0, count=0},           --【英雄】囚龙岛",                 
												{itemid=0, count=0},           --【英雄】囚龙城堡",               
												{itemid=0, count=0},           --【英雄】龙穴",                   
												{itemid=0, count=0},           --【英雄】禁宫大内",               
												{itemid=0, count=0},           --【英雄】和氏璧",               
												{itemid=0, count=0},           --【英雄】金銮殿",               
												{itemid=0, count=0},           --【英雄】对马岛",             
												{itemid=0, count=0},           --【英雄】虚空境",                 
												{itemid=0, count=0},           --【英雄】水师大营",             
												{itemid=0, count=0},           --【英雄】三打祝家庄（一）",       
												{itemid=0, count=0},           --【英雄】三打祝家庄（二）",       
												{itemid=0, count=0},           --【英雄】三打祝家庄（三）",       
												{itemid=0, count=0},           --【英雄】探索战神墓（一）",       
												{itemid=0, count=0},           --【英雄】探索战神墓（二）",       
												{itemid=0, count=0},     		   --【英雄】探索战神墓（三）",       
												{itemid=0, count=0},     		   --【英雄】印度神庙（一） ",        
												{itemid=0, count=0},     		   --【英雄】印度神庙（二） ",        
												{itemid=0, count=0},     		   --【英雄】印度神庙（三） ",        
												{itemid=0, count=0},     		   --【英雄】教堂的秘密（一）",       
												{itemid=0, count=0},     		   --【英雄】教堂的秘密（二）",       
												{itemid=0, count=0},     		   --【英雄】教堂的秘密（三）", 
											}
											
x700081_g_FuBenCreateOK				= 	"副本创建成功！"
x700081_g_FuBenCreateFailed			= 	"副本已达上限，请稍后再试！"
x700081_g_CountDownMessage			= 	"你将在%d秒后离开场景！"
x700081_g_TimeOutFailedMessage		= 	"副本时间到！即将被传出副本！"

x700081_str_NotTime				= "进入副本的时间未到"
x700081_str_NotDay				= " 今天不可以进入副本";
x700081_str_UnderLevel			= "你的等级不足%d级！" --"等级不足"
x700081_str_TooHighLevel		= "你的等级高于%d级！" --"等级不足"
x700081_str_UpLevel				= "等级过高"
x700081_str_TimesOver			= "超出次数限制"

x700081_g_NoUserTimeTry				= 	120						--试练副本中没有人后可以继续保存的时间（单位：秒）
x700081_g_NoUserTime				= 	30						--副本中没有人后可以继续保存的时间（单位：秒）
x700081_g_DefaultTickTime			= 	5						--回调脚本的时钟时间（单位：秒/次）
x700081_g_SpecialTickTimeList		={--如果TickTick不等于 DefaultTick Time
										{id=700021, tick =2},
										{id=700109, tick =5},
										{id=700221, tick =2},
										{id=700207, tick =3},
									}

										
x700081_g_DefaultCloseTick					= 	6						--副本关闭前倒计时（单位：次数）
x700081_g_SpecialCloseTickList		={--如果TickTick不等于 DefaultTick Time
										{id=700021, tick =6*5/2},
										{id=700109, tick =6*5/3},
										{id=700221, tick =6*5/2},
										{id=700207, tick =6*5/3},
									}

------------------------------------------------ fuben register data end ----------------------------------

------------------------ fuben common data start---------------------

x700081_g_TopListMonsterLimited = {
									{scriptid = 700028, count = 10, campid = 21},  --囚龙岛海滩    
									{scriptid = 700023, count = 10, campid = 21},  --囚龙岭  
									{scriptid = 700004, count = 10, campid = 21},  --囚笼堡       
									{scriptid = 700024, count = 10, campid = 21},  --东海眼    
									{scriptid = 700008, count = 10, campid = 21},  --和氏璧    
									{scriptid = 700009, count = 10, campid = 21},  --金銮殿    
									{scriptid = 700108, count = 10, campid = 21},  --对马岛    
									{scriptid = 700013, count = 10, campid = 21},  --虚空境    
									{scriptid = 700027, count = 10, campid = 21},  --侏罗纪    
									{scriptid = 700030, count = 10, campid = 21},  --一打祝家庄
									{scriptid = 700031, count = 10, campid = 21},  --二打祝家庄
									{scriptid = 700032, count = 10, campid = 21},  --三打祝家庄
									{scriptid = 700084, count = 10, campid = 21}, --【队伍】探索战神墓（一）
									{scriptid = 700085, count = 10, campid = 21}, --【队伍】探索战神墓（二）
									{scriptid = 700086, count = 10, campid = 21}, --【队伍】探索战神墓（三）
									{scriptid = 700087, count = 10, campid = 21}, --【队伍】印度神庙（一）
									{scriptid = 700088, count = 10, campid = 21}, --【队伍】印度神庙（二）
									{scriptid = 700089, count = 10, campid = 21}, --【队伍】印度神庙（三）
									{scriptid = 700090, count = 10, campid = 21}, --【队伍】教堂的秘密（一）
									{scriptid = 700091, count = 10, campid = 21}, --【队伍】教堂的秘密（二）
									{scriptid = 700092, count = 10, campid = 21}, --【队伍】教堂的秘密（三）
								}
------------------------ fuben common data end---------------------


function x700081_GetFubenType(nIndex)
	return x700081_g_RegisterFuben[nIndex].fubentype
end



--只为挑战赛 =================================================================================BEGIN
function x700081_GetTitleIndex()	
	local nWeekIndex = GetWeekIndex() --since 2010-01-25
	
	local nTitleIndex = mod(nWeekIndex,16)
    if nTitleIndex == 0 then
        nTitleIndex = 16
    end
    return nTitleIndex
end

function x700081_IsSanHuanFuben(nIndex)  --是否三环副本或轮回台
	if nIndex == 1 or nIndex == 3 or nIndex == 5 or nIndex == 7 or nIndex == 9 or nIndex == 11 or nIndex == 13 or nIndex == 15 then
		return 1
	end 
	return 0
end
function x700081_GetChallengeFubenIndex(sceneId, selfId, nNpcGuid)	--本周是否有三环副本挑战赛，如有则显示
	local titleIndex = x700081_GetTitleIndex()
	if x700081_IsSanHuanFuben(titleIndex) == 0 then
		return -1
	end
	
	for i,s in x700081_g_ChallengeNpcGuid do
		if x700081_g_ChallengeNpcGuid[i] == nNpcGuid then
			return x700081_g_ToplistInfo[titleIndex].Index
		end
	end
    return -1
end
--只为挑战赛 =================================================================================END

function x700081_IsFirstFuben(nIndex) --是否是三环副本的第一环，或唯一一环
	if x700081_g_RegisterFuben[nIndex].loopindex == 0 or x700081_g_RegisterFuben[nIndex].loopindex == 1 then
		return 1
	end
	return 0 
end
function x700081_ShowFubenList(sceneId, selfId, targetId, MissionId, nScriptId)

	local nNpcGuid = GetNpcGuid(sceneId,targetId)
	
	if nNpcGuid<=0 then
		return
	end
	
	local nFubenType = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE)
	
	local nCountry = GetCurCountry( sceneId, selfId )
	
	if nScriptId==nil then
		local nIndex =0;
		for i,item in x700081_g_RegisterFuben do
			nIndex = nIndex+1
			if item.npcguid[nCountry+1] == nNpcGuid then
			
				--if item.loopindex == 2 then
				if x700081_IsFirstFuben(nIndex) ~= 1 then
					if item.fubentype == nFubenType then
						x700081_ProcClearTypeMode(sceneId, selfId, targetId, nIndex)	
						x700081_ShowFuben(sceneId, selfId, targetId, nIndex)
					end
				else
					x700081_ProcClearTypeMode(sceneId, selfId, targetId, nIndex)	
					x700081_ShowFuben(sceneId, selfId, targetId, nIndex)
				end
			end
		end
	else
		local nIndex =0;
		for i,item in x700081_g_RegisterFuben do
			nIndex = nIndex+1
			if item.id == nScriptId then
				x700081_ProcClearTypeMode(sceneId, selfId, targetId, nIndex)	
				x700081_ShowFuben(sceneId, selfId, targetId, nIndex)
			end
		end
	end
end
function x700081_ProcClearTypeMode(sceneId, selfId, targetId, nIndex)
	if x700081_IsFirstFuben(nIndex) == 1 then
		SetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE ,0 )
		SetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE ,0 )
		SetPlayerRuntimeData(sceneId,selfId,RD_FUBENPARAM_MODE, 0)
	end
end

function x700081_IsShowTrainMenu(sceneId, selfId, targetId)  --是否显示试炼一级菜单

	local fubenType = 1
	local fubenMode = 0
	
	local nCountry = GetCurCountry( sceneId, selfId )
	local nNpcGuid = GetNpcGuid(sceneId,targetId)
	local nIndex =0;
	
	for i,item in x700081_g_RegisterFuben do
		nIndex = nIndex+1
		
		if item.npcguid[nCountry+1] == nNpcGuid then
			if item.fubentype == nil then
				item.fubentype = 0
			end
			
			if item.fubentype == fubenType then
			--print("x700081_IsShowTrainMenu1111",nIndex)
				local level = GetLevel( sceneId,selfId )

				local nLevelMin = x700081_g_LevelRangeList[nIndex][1]
				local nLevelMax = x700081_g_LevelRangeList[nIndex][2]
				--print("x700081_IsShowTrainMenu 7777777777777",nIndex,level, nLevelMin)
				if level >= nLevelMin and level<=nLevelMax then
					local count = x700081_GetEnterCount(sceneId, selfId, nIndex)
					--print("x700081_IsShowTrainMenu count = ",count)
					if count < 1 then
						return 1
						--break
					end
				   
				end
				
				
				
				
				--return 1
			end
		end
	end
	return 0
	
end

function x700081_IsShowHeroMenu(sceneId, selfId, targetId)  --是一级菜单

	local fubenType = 2
	
	local nCountry = GetCurCountry( sceneId, selfId )
	local nNpcGuid = GetNpcGuid(sceneId,targetId)
	local nIndex =0;
	
	local level = GetLevel( sceneId,selfId )
	
	for i,item in x700081_g_RegisterFuben do
		nIndex = nIndex+1
		
		if item.npcguid[nCountry+1] == nNpcGuid then
			if item.fubentype == nil then
				item.fubentype = 0
			end
			
			if item.fubentype == fubenType then
	
				local nLevelMin = x700081_g_LevelRangeList[nIndex][1]
				local nLevelMax = x700081_g_LevelRangeList[nIndex][2]
				
				if level >= nLevelMin and level <= nLevelMax then
					return 1
				   
				end
				
			end
		end
	end
	return 0
	
end

function x700081_IsFubenScene(sceneId) --地图类型是否为副本
	local sceneType = GetSceneType(sceneId)
	if sceneType == 1 then 
		return 1
	end
	return 0
end

function x700081_ProcEnumEvent(sceneId, selfId, targetId, MissionId, nScriptId)

	if IsPlayerStateNormal(sceneId,selfId ) <= 0 then
		return
	end
	
	
	--local nFubenType = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE)
	local nFubenMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE)
	local nNpcGuid = GetNpcGuid(sceneId,targetId)
	
	
	
	if nNpcGuid<=0 then
		return
	end
	
	local Index = x700081_GetChallengeFubenIndex(sceneId, selfId, nNpcGuid)       --排行榜
 	if Index ~= -1 and Index ~= nil then
 		if Index == 35 then  --轮回台
 			SetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE, 0)
 			SetPlayerRuntimeData(sceneId,selfId,RD_FUBENPARAM_MODE, 0)
 		else 
 			SetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE, 1)           
			SetPlayerRuntimeData(sceneId,selfId,RD_FUBENPARAM_MODE, 1)       
		end
 		x700081_ShowFuben(sceneId, selfId, targetId, Index)
 		return
 	end
 	
	------------------------------------------------------------------------------------------
	
	--SetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE, 0)
	
	local nCountry = GetCurCountry( sceneId, selfId )
	
	if nScriptId == nil then									--增加一级菜单（副本类型菜单）
		local npcguid = x700081_g_FubenClassMenu.npcguid
		if npcguid[nCountry+1] == nNpcGuid then
			local ClassMenu = x700081_g_FubenClassMenu.classmenu
			for i,s in ClassMenu do
				if i == 1 then
					--if x700081_IsShowTrainMenu(sceneId, selfId,targetId) == 1 then
						--AddQuestNumText(sceneId, x700081_g_ScriptId, s.name,14,1000+i)
					--end
					x700081_ShowFubenName(sceneId, selfId, targetId, s.fubentype, s.mode)  --试炼不需要一级菜单
				elseif i==4 then															
					if x700081_IsShowHeroMenu(sceneId, selfId,targetId) == 1 then
						AddQuestNumText(sceneId, x700081_g_ScriptId, s.name,14,1000+i)
					end
				else
					local nLevel = GetLevel(sceneId, selfId)
					if nLevel >= 20 then
						AddQuestNumText(sceneId, x700081_g_ScriptId, s.name,14,1000+i)
					end
				end
			end
			return
		end
	end
	
	
	x700081_ShowFubenList(sceneId, selfId, targetId, MissionId, nScriptId)
end

function x700081_GetTeamMinLevel(sceneId, selfId)

	if IsTeamLeader(sceneId, selfId) <= 0 then
		local nLevel = GetLevel(sceneId, selfId)
		return nLevel
	end

	local teamid = GetTeamId(sceneId, selfId);
	local teamnum = GetTeamSize(sceneId, selfId);
	local nearteamnum = GetNearTeamCount(sceneId, selfId);
	
	local nMinLevel = 200
	for i = 0, nearteamnum - 1 do
		local memberId = GetNearTeamMember(sceneId, selfId, i);
		
		local nLevel = GetLevel(sceneId, memberId)

		if nLevel<nMinLevel then
			nMinLevel = nLevel
		end
	end

	return nMinLevel
end
function x700081_GetRandomLoopIndex( sceneId, selfId )	--随机获得一三环副本第一环INDEX

	local nLevel = x700081_GetTeamMinLevel(sceneId, selfId)
	
	local randomlist = {}
	local nIndex =0;
	local nCount = 0;
	for i,item in x700081_g_RegisterFuben do
		nIndex = nIndex+1
		if item.loopindex == 1 and item.fubentype == 0 and nLevel >= x700081_g_LevelRangeList[nIndex][1] and nLevel <= x700081_g_LevelRangeList[nIndex][2] then
			nCount = nCount +1
			randomlist[nCount] = nIndex
			
		end
	end
	if nCount ==0 then
		return 0
	end
	
	--连续两次进入三环副本，不会随机到同一个副本
	local nRandomlist = {}
	local nNewCount = 0;
	local lastIndex = GetQuestData(sceneId, selfId, MD_FUBEN_SANHUAN_LASTINDEX[1], MD_FUBEN_SANHUAN_LASTINDEX[2], MD_FUBEN_SANHUAN_LASTINDEX[3])
	if lastIndex ~= 0 and nCount > 1 then
		for j,s in randomlist do
			if s ~= lastIndex then
				nNewCount = nNewCount + 1
				nRandomlist[nNewCount] = s
			end
		end
		return nRandomlist[random(1,nNewCount)]
	end
	---------------------------------------------

	return randomlist[random(1,nCount)]
end


function x700081_DispatchDetailDesc(sceneId , selfId , targetId , nIndex , name, nMode)

	
	BeginQuestEvent(sceneId)
		
		if nMode ==0 then
			AddQuestText(sceneId,"#Y"..name.."")
		elseif nMode ==1 then
			AddQuestText(sceneId,"#Y"..name.."")
		elseif nMode ==2 then
			AddQuestText(sceneId,"#Y"..name.."")
		else
			return
		end
		--任务信息
		AddQuestText(sceneId,"\n\t每周一共可以进行21次三环副本。使用三番令进入副本，消耗3次本周的副本次数，同时获得3次三环副本的奖励。若本周剩余副本次数不足3次，则不可使用三番令。")

		if nMode ==0 then
			AddQuestText(sceneId,"\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得大量经验奖励！")
		elseif nMode ==1 then
			AddQuestText(sceneId,"\n#Y开放时间：#W全天开放！\n#Y友情提示：#W3人以上的队伍，才能进入该副本！\n#Y副本说明：#W在这个副本中，你可以获得普通三环副本3倍的经验奖励！")
		elseif nMode ==2 then
			AddQuestText(sceneId,"副本说明："..name.."周三番模式")
		else
			return
		end

		--x700081_SaveSanhuanFubenTalkMode(sceneId, selfId, nExt)


	EndQuestEvent()

	DispatchQuestInfo(sceneId, selfId, targetId, x700081_g_ScriptId, -1);
	
	local ranIndex = x700081_GetRandomLoopIndex(sceneId, selfId)
	
	
	x700081_SaveFubenIndex(sceneId, selfId, ranIndex)
	
end
function x700081_ShowFuben(sceneId, selfId, targetId, nIndex)

	--x700081_ProcClearTypeMode(sceneId, selfId, targetId, nIndex)	
	--PrintStr("x700081_ShowFuben")
	local level = GetLevel( sceneId,selfId )

	local nLevelMin = x700081_g_LevelRangeList[nIndex][1]
	local nLevelMax = x700081_g_LevelRangeList[nIndex][2]
	if level < nLevelMin or level>nLevelMax then
		
	   --PrintStr(format("level=%d, need=%d, %s", level, nLevelMin,x700081_g_FubenNameList[nIndex]))
       return		--TEST
    end
	
	if x700081_g_RegisterFuben[nIndex].fubentype == 1 then  --试炼副本只能进一次
		local count = x700081_GetEnterCount(sceneId, selfId, nIndex)
		if count >= 1 then
			
			return			--TEST
		end
	end
	
	if nIndex == 37 and level < 80 then --天赋轮回台
		return
	end
	if x700081_g_RegisterFuben[nIndex].fubentype == 1 then
		AddQuestNumText(sceneId, x700081_g_ScriptId, x700081_g_FubenNameList[nIndex],16,nIndex)
	else
		AddQuestNumText(sceneId, x700081_g_ScriptId, x700081_g_FubenNameList[nIndex],14,nIndex)
	end
	
end

-------------------------
--***********************
--ProcEventEntry
--***********************
-------------------------
function x700081_ShowFubenName(sceneId, selfId, targetId, fubenType, fubenMode)
	local nCountry = GetCurCountry( sceneId, selfId )
	local nNpcGuid = GetNpcGuid(sceneId,targetId)
	local nIndex =0;
	
	--BeginQuestEvent(sceneId)
	if fubenType == 1 then   --试炼模式说明
		--AddQuestText(sceneId,"#Y【个人】试炼副本#W\n \n\t从我这里可以进入试炼副本,通过试炼可以让你轻松熟悉各个副本。试炼副本难度较低，单人创建队伍即可进入。")
	elseif fubenType == 2 then  --英雄模式说明
		BeginQuestEvent(sceneId)
		AddQuestText(sceneId,"#Y【队伍】挑战副本#W\n \n\t从我这里可以进入挑战副本。想挑战人的极限吗？挑战副本是你最好的选择！挑战副本难度较高，必须拥有精良的装备和强大的队友才有可能挑战成功。")
		EndQuestEvent()
	end
			
	for i,item in x700081_g_RegisterFuben do
		nIndex = nIndex+1
		if item.npcguid[nCountry+1] == nNpcGuid then
			if item.fubentype == nil then
				item.fubentype = 0
			end
			
			
			if item.fubentype == fubenType then
				x700081_ProcClearTypeMode(sceneId, selfId, targetId, nIndex)	
				x700081_ShowFuben(sceneId, selfId, targetId, nIndex)
				--x700081_DispatchEnterInfo( sceneId, selfId, targetId,nIndex )
			end
		end
	end
	--EndQuestEvent()
	DispatchQuestEventList(sceneId, selfId, targetId)
end

function x700081_ProcEventEntry(sceneId, selfId, NPCId,nScriptId, nIndex)
	if IsPlayerStateNormal(sceneId,selfId ) <= 0 then
		return
	end
	if nIndex== nil then
		
		return
	end
	
	if nIndex > 1000 then
		nIndex = nIndex - 1000
		if nIndex == 2 or nIndex == 3 then
			--随机进入一个副本
			local name = x700081_g_FubenClassMenu.classmenu[nIndex].name
			local fubenMode = x700081_g_FubenClassMenu.classmenu[nIndex].mode
			if fubenMode == nil then
				fubenMode = 0
			end
			SetPlayerRuntimeData(sceneId,selfId,RD_FUBENPARAM_MODE, fubenMode)
			SetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE, fubenMode)
			x700081_DispatchDetailDesc(sceneId , selfId , NPCId  , nIndex, name, fubenMode)			
		else
			
			local fubenType = x700081_g_FubenClassMenu.classmenu[nIndex].fubentype
			local fubenMode = x700081_g_FubenClassMenu.classmenu[nIndex].mode
			if fubenMode == nil then
				fubenMode = 0
			end
			SetPlayerRuntimeData(sceneId,selfId,RD_FUBENPARAM_MODE, fubenMode)
			SetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE, fubenMode)
			x700081_ShowFubenName(sceneId, selfId, NPCId, fubenType, fubenMode)
		end
		
	else
		--SetPlayerRuntimeData(sceneId,selfId,RD_FUBENPARAM_MODE, 0)
		x700081_DispatchEnterInfo( sceneId, selfId, NPCId,nIndex )
	end
	
end


---------------------------------------------------------------------------------------------------
--进入副本文字显示
---------------------------------------------------------------------------------------------------
function x700081_DispatchEnterInfo( sceneId, selfId, NPCId,nIndex )

	x700081_SaveFubenIndex(sceneId, selfId, nIndex)
	
	local strTopList = x700081_GetTopListText(sceneId)

	BeginQuestEvent(sceneId)

		--任务信息
		if x700081_g_CountUntilList[nIndex]<=0 then   --如果是连环副本的第二环或者第三环

			local nFubenMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE)

			if nFubenMode==1 then  --如果是现金副本
				AddQuestText(sceneId,x700081_g_FubenNameList[nIndex])
				
			elseif nFubenMode==2 then  --ZHOUXJ
				AddQuestText(sceneId,x700081_g_FubenNameList[nIndex])	
			else
				AddQuestText(sceneId,"#Y"..x700081_g_FubenNameList[nIndex])
			end

		else
			AddQuestText(sceneId,"#Y"..x700081_g_FubenNameList[nIndex])
		end	
		AddQuestText(sceneId,x700081_g_EnterInfoList[nIndex]..strTopList)
		

	EndQuestEvent()
	DispatchQuestInfo(sceneId, selfId, NPCId, x700081_g_ScriptId, -1);
end

function x700081_SaveFubenIndex(sceneId, selfId, nValue)
	SetQuestData(sceneId, selfId, MD_FUBEN_TALK_INDEX[1], MD_FUBEN_TALK_INDEX[2], MD_FUBEN_TALK_INDEX[3], nValue)
end

function x700081_GetFubenIndex(sceneId, selfId)
	return GetQuestData(sceneId, selfId, MD_FUBEN_TALK_INDEX[1], MD_FUBEN_TALK_INDEX[2], MD_FUBEN_TALK_INDEX[3])
end



---------------------------------------------------------------------------------------------------
--申请进入副本
---------------------------------------------------------------------------------------------------
function x700081_ProcAcceptCheck( sceneId, selfId, NPCId )
    return 1
end

----------------------------------------------------------------------------------------------
--点确定后
----------------------------------------------------------------------------------------------

function x700081_GetFubenMode( sceneId, selfId )
	local nFubenMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE)
	if x700081_IsFubenScene(sceneId) == 0 then
		nFubenMode = GetPlayerRuntimeData(sceneId,selfId,RD_FUBENPARAM_MODE)
	end
	return nFubenMode
end

function x700081_ProcAccept( sceneId, selfId )

	local nIndex = x700081_GetFubenIndex(sceneId, selfId)
	if nIndex <= 0 then
		return
	end
	local nFubenType = x700081_g_RegisterFuben[nIndex].fubentype
	SetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE, nFubenType)
	
	SetQuestData(sceneId, selfId, MD_FUBEN_SANHUAN_LASTINDEX[1], MD_FUBEN_SANHUAN_LASTINDEX[2], MD_FUBEN_SANHUAN_LASTINDEX[3], nIndex)
	--local nFubenMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE)
	local nFubenMode = x700081_GetFubenMode(sceneId, selfId )
	
	if x700081_g_CountUntilList[nIndex]<=0 then   --如果是连环副本的第二环或者第三环

		--local nFubenMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE)
		x700081_OnRequestEnterFuben(sceneId, selfId, nFubenMode,nIndex);
		
	else	
		--local nFubenMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE)
		x700081_OnRequestEnterFuben(sceneId, selfId, nFubenMode,nIndex);	
		
	end
	
end

function x700081_OnRequestEnterFuben(sceneId, selfId, nMode,nIndex, nScriptId )
	
	if nMode==nil or nIndex==nil then
		return
	end
	if(nIndex == 0) then
		for i,item in x700081_g_RegisterFuben do
			nIndex = nIndex+1
			if nType ~= nil then
				if item.id == nScriptId and nType == item.fubentype then
					break
				end
			else
				if item.id == nScriptId then
					break
				end
			end
		end
	end

	x700081_SaveFubenIndex(sceneId, selfId, nIndex)
	local nRet = 0
	
	local nType = x700081_GetFubenType(nIndex)
	nRet = x700081_CheckRequest(sceneId, selfId,nIndex, nMode, nType)
	
	if nRet<=0 then
		return
	end


	nRet = x700081_CheckAllMemberItemRequest(sceneId, selfId, nMode, nIndex)
	
  	if nRet<=0 then
		return
	end

	if nRet>0 then
		x700081_OnApproveRequestEnterFuben(sceneId, selfId, nRet, nMode, nIndex, nScriptId)
	end
end

function x700081_CheckOwnerItemRequest(sceneId, selfId, nMode, nIndex)
 		
		local playerName = GetName(sceneId, selfId)
	 	if nMode == 1 then
			if x700081_g_Item_XJ[nIndex].itemid<=0 then
				return 1
			end
			local Num = GetItemCount( sceneId, selfId, x700081_g_Item_XJ[nIndex].itemid )
	
			if Num<x700081_g_Item_XJ[nIndex].count then
				x700081_ShowTips(sceneId, selfId, format("你身上@itemid_%d不足%d个,不能进入此副本",x700081_g_Item_XJ[nIndex].itemid,x700081_g_Item_XJ[nIndex].count))
				return 0
			end
		elseif nMode == 2 then
			if x700081_g_Item_ZHOUXJ[nIndex].itemid<=0 then
				return 1
			end
			local Num = GetItemCount( sceneId, selfId, x700081_g_Item_ZHOUXJ[nIndex].itemid )
	
			if Num<x700081_g_Item_ZHOUXJ[nIndex].count then
				x700081_ShowTips(sceneId, selfId, format("你身上@itemid_%d不足%d个,不能进入此副本",x700081_g_Item_ZHOUXJ[nIndex].itemid,x700081_g_Item_ZHOUXJ[nIndex].count))
				return 0
			end
		end
		return 1
end

function x700081_CheckAllMemberItemRequest(sceneId, selfId, nMode, nIndex)
	if GetGameOpenById(1022)<=0 then
		--x700081_ShowTips(sceneId, selfId, "此活动已关闭")
		return 0
	end
	local ErrorCode = x700081_IsPlayerErrorState( sceneId,selfId )
	if ErrorCode~=0 then
		return 0
	end
	
	local teamnum = GetNearTeamCount(sceneId, selfId);
	if nMode==1 then
		for i = 0, teamnum - 1 do
			local memberId = GetNearTeamMember(sceneId, selfId, i);
			if x700081_g_Item_XJ[nIndex].itemid>0 then
				local Num = GetItemCount( sceneId, memberId, x700081_g_Item_XJ[nIndex].itemid )
				local playerName = GetName(sceneId, memberId)

				if Num<x700081_g_Item_XJ[nIndex].count then
					x700081_ShowTips(sceneId, selfId, format(playerName.."身上@itemid_%d不足%d个",x700081_g_Item_XJ[nIndex].itemid,x700081_g_Item_XJ[nIndex].count))
					return 0
				end
			end

		end
	elseif nMode==2 then	--ZHOUXJ
		for i = 0, teamnum - 1 do
			local memberId = GetNearTeamMember(sceneId, selfId, i);
			if x700081_g_Item_ZHOUXJ[nIndex].itemid>0 then
				local Num = GetItemCount( sceneId, memberId, x700081_g_Item_ZHOUXJ[nIndex].itemid )
				local playerName = GetName(sceneId, memberId)

				if Num<x700081_g_Item_ZHOUXJ[nIndex].count then
					x700081_ShowTips(sceneId, selfId, format(playerName.."身上@itemid_%d不足%d个",x700081_g_Item_ZHOUXJ[nIndex].itemid,x700081_g_Item_ZHOUXJ[nIndex].count))
					return 0
			end
			end

		end
	end

	return 1
end



---扣除队长的银币道具
function x700081_OnXianJinRequestOk(sceneId, selfId, nIndex, nMode)  --ZHOUXJ
	if nMode == 1 then
		if x700081_g_Item_XJ[nIndex].count>0 then
			DelItem(sceneId, selfId, x700081_g_Item_XJ[nIndex].itemid, x700081_g_Item_XJ[nIndex].count);
		end
	elseif nMode == 2 then
		if x700081_g_Item_ZHOUXJ[nIndex].count>0 then
			DelItem(sceneId, selfId, x700081_g_Item_ZHOUXJ[nIndex].itemid, x700081_g_Item_ZHOUXJ[nIndex].count);
		end
	end	
end

function x700081_ShowTips(sceneId, selfId, str)
	BeginQuestEvent(sceneId);
		AddQuestText(sceneId,str);
	EndQuestEvent();
	DispatchQuestTips(sceneId, selfId);
end

function x700081_ShowTipsToAll(sceneId, str)

	local humancount = GetFuben_PlayerCount(sceneId);

	--通知玩家
	for i = 0, humancount - 1 do
		local humanId = GetFuben_PlayerObjId(sceneId, i);
		
		BeginQuestEvent(sceneId);
			AddQuestText(sceneId,str);
		EndQuestEvent();
		DispatchQuestTips(sceneId, humanId);
	end
end

-----------------------------------------------------------
--*********************************************************
--OnFubenSceneCreated  :  当副本创建成功时， 开始刷怪和npc
--*********************************************************
-----------------------------------------------------------
function x700081_OnFubenSceneCreated( sceneId, nScriptId, nIndex )
	-- @Param sceneId:  副本场景id
	
	
	local nFubenMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE)

	local nFubenType = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE)
	local nIndex =0;
	for i,item in x700081_g_RegisterFuben do
		nIndex = nIndex+1
		if item.id == nScriptId and item.fubentype==nFubenType  then
			break
		end
	end

	if nFubenMode==1 and x700081_g_Item_XJ[nIndex].count > 0 then
	  x700081_ShowTipsToAll(sceneId, format("你上交了%d个@itemid_%d",x700081_g_Item_XJ[nIndex].count,x700081_g_Item_XJ[nIndex].itemid))
	elseif nFubenMode==2 and x700081_g_Item_ZHOUXJ[nIndex].count > 0 then
	  x700081_ShowTipsToAll(sceneId, format("你上交了%d个@itemid_%d",x700081_g_Item_ZHOUXJ[nIndex].count,x700081_g_Item_ZHOUXJ[nIndex].itemid))
	end

	CallScriptFunction(nScriptId,"OnFubenSceneCreated", sceneId,selfId)
		
end



function x700081_CheckRequest(sceneId, selfId, nIndex, nMode, nType)
	--TEST
	--local n_dateIndex = x700081_md_List[37][1]
	--local n_dateCount = x700081_md_List[37][2]
	--SetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3], 18)
	
	local nRet = x700081_CheckCommonCondition(sceneId, selfId,nIndex, nMode)

	if nRet<=0 then
		return 0;
	end

	nRet =  x700081_CheckTeamCondition(sceneId, selfId,nIndex, nMode, nType)
	if nRet<=0 then
		return 0;
	end

	return 1
end

function x700081_CheckCommonCondition(sceneId, selfId,nIndex, nMode)

	
	local nRet = x700081_CheckCommonCondition_Day(sceneId, selfId,nIndex)  -- Time week day

	if nRet <=0 then
		return 0;
	end
	
	local nRet = x700081_CheckCommonCondition_Time(sceneId, selfId,nIndex)  -- Time hour

	if nRet <=0 then
		return 0;
	end
	
	local nRet = x700081_CheckCommonCondition_Level(sceneId, selfId,nIndex)  -- level

	if nRet <=0 then
		return 0;
	end
	
	
	local nRet = x700081_CheckCommonCondition_Times(sceneId, selfId,nIndex, nMode)  --OWNER Times

	if nRet <=0 then
		return 0;
	end

	return 1;


	
end

function x700081_CheckCommonCondition_Time(sceneId, selfId,nIndex)
	local hour,minute,sec =GetHourMinSec();
	local nowtime = hour*60+minute
	
	for i, item in x700081_g_EnterTimeList[nIndex] do
		if nowtime >= item.min and nowtime <= item.max then
			
			
			return 1;
			
		end
	end
	BeginQuestEvent(sceneId);
		AddQuestText(sceneId, x700081_str_NotTime);
	EndQuestEvent();
	DispatchQuestTips(sceneId, selfId);
	return 0;
end

function x700081_CheckCommonCondition_Day(sceneId, selfId,nIndex)

	local weekDay = GetWeek()
	for i, item in x700081_g_EnterDayList[nIndex] do
		if weekDay==item then
			
			
			return 1;
			
		end
	end
	BeginQuestEvent(sceneId);
		AddQuestText(sceneId, x700081_str_NotDay);
	EndQuestEvent();
	DispatchQuestTips(sceneId, selfId);
	return 0;
end

function x700081_CheckCommonCondition_Level(sceneId, selfId,nIndex)
	
	local level = GetLevel( sceneId,selfId )

	local nLevelMin = x700081_g_LevelRangeList[nIndex][1]
	local nLevelMax = x700081_g_LevelRangeList[nIndex][2]
    if level < nLevelMin then
        BeginQuestEvent(sceneId);
			AddQuestText(sceneId, format(x700081_str_UnderLevel,nLevelMin));
		EndQuestEvent();
		DispatchQuestTips(sceneId, selfId);
		return 0
    end

	if level > nLevelMax then
        BeginQuestEvent(sceneId);
			AddQuestText(sceneId, format(x700081_str_TooHighLevel,nLevelMax));
		EndQuestEvent();
		DispatchQuestTips(sceneId, selfId);
		return 0
    end
	
	return 1;
end



function x700081_CheckCommonCondition_Times(sceneId, selfId,nIndex, nMode)
	if  x700081_GetFubenType(nIndex) == 2 then
		return 1
	end
	if x700081_g_CountUntilList[nIndex] >0 then
		
		local enterCount = x700081_GetEnterCount(sceneId, selfId,nIndex)
--		print("nIndex",nIndex,enterCount,x700081_g_CountUntilList[nIndex])
		if enterCount>= x700081_g_CountUntilList[nIndex] then
			BeginQuestEvent(sceneId);
				AddQuestText(sceneId, x700081_str_TimesOver);
			EndQuestEvent();
			DispatchQuestTips(sceneId, selfId);
			return 0 --TEST
		end
	end
	return 1;
end

function x700081_CheckSelfCondition(sceneId, selfId,nIndex, nMode, nType)
	local ret, tips;

		ret, tips = x700081_CheckAllMemberMinLevel(sceneId, selfId, nearteamnum,nIndex);
		if ret <= 0 then
			str = tips;
			bPassed = 0
		end

		ret, tips = x700081_CheckAllMemberMaxLevel(sceneId, selfId, nearteamnum,nIndex);
		if ret <= 0 then
			str = tips;
			bPassed = 0
		end

		ret, tips = x700081_CheckAllMemberEnterCount(sceneId, selfId, nearteamnum, nMode ,nIndex);
		if ret == 0 then
			str = tips;
			bPassed = 0
		end



		 -- 检查所有玩家异常状态
		ret, tips = x700081_CheckAllMemberErrorState(sceneId, selfId, nearteamnum)
		if ret <= 0 then
			str = tips;
			bPassed = 0
		end

		ret, tips = x700081_CountryBattleLite(sceneId, selfId)

		if ret<=0 then
			str = tips;
			bPassed = 0
		end

		

	

	if bPassed == 1 then
		return 1;
	else
		if str ~= "" then
			BeginQuestEvent(sceneId);
				AddQuestText(sceneId, str);
			EndQuestEvent();
			DispatchQuestTips(sceneId, selfId);
			return 0;
		end
	end


	return 1;
end

function x700081_CheckTeamCondition(sceneId, selfId,nIndex, nMode, nType)
	
	local teamid = GetTeamId(sceneId, selfId);
	local teamnum = GetTeamSize(sceneId, selfId);
	local nearteamnum = GetNearTeamCount(sceneId, selfId);

	local str = "";
	local bPassed = 1;
	
	--print("x700081_CheckTeamCondition",nType,teamid,teamnum,nearteamnum)
	if nType == 1 and nearteamnum < 0 then			--试练模式并且没有组队
		local ret, tips;
	
			ret, tips = x700081_CheckAllMemberMinLevel(sceneId, selfId, nearteamnum,nIndex);
			if ret <= 0 then
				str = tips;
				bPassed = 0
			end
	
			ret, tips = x700081_CheckAllMemberMaxLevel(sceneId, selfId, nearteamnum,nIndex);
			if ret <= 0 then
				str = tips;
				bPassed = 0
			end
	
			ret, tips = x700081_CheckAllMemberEnterCount(sceneId, selfId, nearteamnum, nMode ,nIndex);
			if ret == 0 then
				str = tips;
				bPassed = 0
			end
	
			 -- 检查所有玩家异常状态
			ret, tips = x700081_CheckAllMemberErrorState(sceneId, selfId, nearteamnum)
			if ret <= 0 then
				str = tips;
				bPassed = 0
			end
	
			ret, tips = x700081_CountryBattleLite(sceneId, selfId)
	
			if ret<=0 then
				str = tips;
				bPassed = 0
			end
	else
		if teamid < 0 then
			str	= "您还没有队伍，请先建立队伍！"
			bPassed = 0
		elseif IsTeamLeader(sceneId, selfId) <= 0 then
			str	= "你不是队长！"
			bPassed = 0
		elseif x700081_CheckAllMemberNear( sceneId,selfId) <= 0 then
			str	= "需要所有的队友在附近！"
			bPassed = 0
		elseif teamnum < x700081_g_LimitMembersList[nIndex] then
			str	= format("你的队伍不足%d人！", x700081_g_LimitMembersList[nIndex])
			bPassed = 0
		elseif nearteamnum < x700081_g_LimitMembersList[nIndex] then
			str	= format("附近队友不足%d人！", x700081_g_LimitMembersList[nIndex])
			bPassed = 0
		else
	
			local ret, tips;
	
			ret, tips = x700081_CheckAllMemberMinLevel(sceneId, selfId, nearteamnum,nIndex);
			if ret <= 0 then
				str = tips;
				bPassed = 0
			end
	
			ret, tips = x700081_CheckAllMemberMaxLevel(sceneId, selfId, nearteamnum,nIndex);
			if ret <= 0 then
				str = tips;
				bPassed = 0
			end
	
			ret, tips = x700081_CheckAllMemberEnterCount(sceneId, selfId, nearteamnum, nMode ,nIndex);
			if ret == 0 then
				str = tips;
				bPassed = 0
			end
	
	
	
			 -- 检查所有玩家异常状态
			ret, tips = x700081_CheckAllMemberErrorState(sceneId, selfId, nearteamnum)
			if ret <= 0 then
				str = tips;
				bPassed = 0
			end
	
			ret, tips = x700081_CountryBattleLite(sceneId, selfId)
	
			if ret<=0 then
				str = tips;
				bPassed = 0
			end
		end
	end
	if bPassed == 1 then
		return 1;
	else
		if str ~= "" then
			BeginQuestEvent(sceneId);
				AddQuestText(sceneId, str);
			EndQuestEvent();
			DispatchQuestTips(sceneId, selfId);
			return 0;
		end
	end


	return 1;
end

function x700081_CountryBattleLite(sceneId, selfId)
	local teamid = GetTeamId(sceneId, selfId);
	local teamnum = GetTeamSize(sceneId, selfId);
	local nearteamnum = GetNearTeamCount(sceneId, selfId);
	local tips=""
	if teamnum <= 0 then
		if CallScriptFunction(COUNTRY_BATTLE_LITE_SCRIPT,"CheckCountryBattleLiteFubenTrans",sceneId,selfId) == 0 then --如果处于屠城战状态
			
			local name = GetName(sceneId, selfId)
	
			tips = name.."正在进行【国家】屠城战,不能进入副本！"
			return 0, tips
		end
	else
		for i = 0, teamnum - 1 do
			local memberId = GetNearTeamMember(sceneId, selfId, i);
	
			if CallScriptFunction(COUNTRY_BATTLE_LITE_SCRIPT,"CheckCountryBattleLiteFubenTrans",sceneId,memberId) == 0 then --如果处于屠城战状态
				
				local name = GetName(sceneId, memberId)
	
				tips = name.."正在进行【国家】屠城战,不能进入副本！"
				return 0, tips
			end
		end
	end
	
	return 1,tips
end


function x700081_OnApproveRequestEnterFuben(sceneId, selfId, nEnterType, nMode, nIndex, nScriptId)
	CallScriptFunction(700095,"CheckChanchuApproveRequest",sceneId,selfId, nMode, nScriptId)
	
	local memberNum = GetNearTeamCount(sceneId, selfId);

	x700081_MakeFuben_Team(sceneId, selfId, memberNum,nMode, nIndex);
end



function x700081_MakeFuben_Team(sceneId, selfId, memberNum, nMode, nIndex)
	if memberNum < 0 then
		local ErrorCode = x700081_IsPlayerErrorState( sceneId, selfId )
	    if ErrorCode == 0 then
	       --lock
	       SetPlayerMutexState( sceneId, selfId , PLAYER_STATE_READYFUBEN ,1)
	    end
	else
		for i = 0, memberNum - 1 do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        local ErrorCode = x700081_IsPlayerErrorState( sceneId, memberId )
	        if ErrorCode == 0 then
	            --lock
	            SetPlayerMutexState( sceneId, memberId , PLAYER_STATE_READYFUBEN ,1)
	        end
	    end
	end
	
	local leaderguid = ObjId2Guid(sceneId, selfId);
    local x,z =GetWorldPos(sceneId,selfId)

	--//add in 2009-3-6 for continous fuben
	local sceneParamList ={}
	for i=0, 255 do
		local nValue = GetFubenData_Param(sceneId, i);
		sceneParamList[i+1] = nValue;
	end
	--//add end
	
	
	
	if GetSceneType(sceneId)==1 then
		local nTick = GetFubenData_Param(sceneId, x700081_CSP_LAST_TICKOUNT )
		local nTickCount = GetFubenData_Param(sceneId, x700081_CSP_TICKCOUNT )
		local nAdd = GetFubenData_Param(sceneId, x700081_CSP_TICKCOUNT_ADD )
		local nSub = GetFubenData_Param(sceneId, x700081_CSP_TICKCOUNT_SUB )
		SetFubenData_Param(sceneId, x700081_CSP_LAST_TICKOUNT ,nTick+nTickCount-nAdd+nSub )

		local bPlayerDead = GetFubenData_Param(sceneId,x700081_CSP_PLAYER_DEAD)

		SetFubenData_Param(sceneId,x700081_CSP_PLAYER_DEAD, bPlayerDead)
	else
		SetFubenData_Param(sceneId, x700081_CSP_LAST_TICKOUNT ,0 )
		SetFubenData_Param(sceneId,x700081_CSP_PLAYER_DEAD, 0)
	end
	
	x700081_CheckFubenTopList(sceneId)

	SetSceneLoad_Map(sceneId, x700081_g_SceneMapNavPathList[nIndex]);			   --地图是必须选取的，而且必须在Config/SceneInfo.ini里配置好
	SetFubenData_TeamLeader(sceneId, leaderguid);   
	
	local nType = x700081_GetFubenType(nIndex)
	if nType == 1 then
		SetFubenData_NoUserCloseTime(sceneId, x700081_g_NoUserTimeTry * 1000);            --试练场景没人的保留时间
	else
		SetFubenData_NoUserCloseTime(sceneId, x700081_g_NoUserTime * 1000);            --场景没人的保留时间
	end
	local nTickTime = x700081_GetTickTimeByScriptId(sceneId, x700081_g_RegisterFuben[nIndex].id)
	SetFubenData_Timer(sceneId, nTickTime * 1000);                        --设置定时器触发频率
	SetFubenData_Param(sceneId, x700081_CSP_TICKTIME, nTickTime);

	

	SetFubenData_Param(sceneId, x700081_CSP_FUBENTYPE, x700081_g_FubenTypeList[nIndex]);	--设置副本数据，这里将0号索引的数据设置为999，用于表示副本号999(数字自定义)
	SetFubenData_Param(sceneId, x700081_CSP_SCRIPTID, x700081_g_RegisterFuben[nIndex].id)	--将1号数据设置为副本场景事件脚本号
	SetFubenData_Param(sceneId, x700081_CSP_TICKCOUNT, 0);							--设置定时器调用次数
	SetFubenData_Param(sceneId, x700081_CSP_BACKSCENEID, -1);						--设置副本入口场景号, 初始化
	SetFubenData_Param(sceneId, x700081_CSP_ISCLOSING, 0);							--设置副本关闭标志, 0开放，1关闭
	SetFubenData_Param(sceneId, x700081_CSP_LEAVECOUNTDOWN, 0);						--设置离开倒计时次数
    SetFubenData_Param(sceneId, x700081_CSP_TEAMID, GetTeamId(sceneId, selfId)); 	--保存队伍号

	local nHoldTime = x700081_g_LimitTotalHoldTimeList[nIndex]
	SetFubenData_Param(sceneId, x700081_CSP_HOLDTIME, nHoldTime);

	local nCloseTick =  x700081_GetCloseTickByScriptId(sceneId, x700081_g_RegisterFuben[nIndex].id)
	SetFubenData_Param(sceneId, x700081_CSP_CLOSETICK, nCloseTick);
	
	--保存副本类型
	SetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE ,nType )
	
	--保存副本模式
	SetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE ,nMode )
	
	--//add for 连环副本
	for i=x700081_CSP_GUID_START, 254-1 do
		SetFubenData_Param(sceneId, i ,0 )
	end
	--// add end
	if x700081_g_RegisterFuben[nIndex].kind ~= nil then   --仅针对轮回台
		SetFubenData_Param(sceneId, x700081_CSP_FUBEN_KIND ,x700081_g_RegisterFuben[nIndex].kind )
	end
	

	if memberNum < 0 then
		local guid = GetPlayerGUID( sceneId,selfId )
		guid = format("%u", guid)
	    local paramidx = x700081_CSP_GUID_START
	
	    SetFubenData_Param(sceneId, paramidx ,guid )
	else
	    for i= 0 ,memberNum - 1  do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        local guid = GetPlayerGUID( sceneId,memberId )
	        guid = format("%u", guid)
	        local paramidx = x700081_CSP_GUID_START + i
	
	        SetFubenData_Param(sceneId, paramidx ,guid )
	    end
	end

	-- 适应类型: 0-最高等级 1-最低等级 2-平均等级
    x700081_InitAutoLevel_Team(sceneId,selfId, nIndex, memberNum,2)
    

	local bRetSceneID = CreateFuben(sceneId); 										--初始化完成后调用创建副本函数

	--//add in 2009-3-6 for continous fuben
	for i=0, 255 do
		local nValue = sceneParamList[i+1];
		SetFubenData_Param(sceneId, i,nValue);
	end
	--//add end


    if bRetSceneID > 0 then
    	if memberNum < 0 then
    		BeginQuestEvent(sceneId);
	        AddQuestText(sceneId, x700081_g_FuBenCreateOK);
	        EndQuestEvent();
	        DispatchQuestTips(sceneId, selfId);
    	else
	        for i = 0, memberNum - 1 do
	            local memberId = GetNearTeamMember(sceneId, selfId, i);
	            BeginQuestEvent(sceneId);
	            AddQuestText(sceneId, x700081_g_FuBenCreateOK);
	            EndQuestEvent();
	            DispatchQuestTips(sceneId, memberId);
	        end
		end

        --// update in 2009-3-17
		if nMode==1 then
			GamePlayScriptLog(sceneId, selfId, 1003)  --现金副本
		else
			GamePlayScriptLog(sceneId, selfId, 1001)  --正常副本
		end		
		--//update end

    else
		if memberNum < 0 then
			BeginQuestEvent(sceneId);
	            AddQuestText(sceneId, x700081_g_FuBenCreateFailed);
	            EndQuestEvent();
	            DispatchQuestTips(sceneId, selfId);
	
	            -- unlock
	            SetPlayerMutexState( sceneId,selfId ,PLAYER_STATE_READYFUBEN ,0)
		else
	        for i = 0, memberNum - 1 do
	            local memberId = GetNearTeamMember(sceneId, selfId, i);
	            BeginQuestEvent(sceneId);
	            AddQuestText(sceneId, x700081_g_FuBenCreateFailed);
	            EndQuestEvent();
	            DispatchQuestTips(sceneId, memberId);
	
	            -- unlock
	            SetPlayerMutexState( sceneId,memberId ,PLAYER_STATE_READYFUBEN ,0)
	        end
	    end
    end
end


---------------------------------------------------------------------------------------------------
--副本已经准备完毕，此时将附近玩家拉到副本里
---------------------------------------------------------------------------------------------------
function x700081_OnFubenReady(sceneId, destsceneId)

	x700081_OnFubenReady_Team(sceneId, destsceneId)

end

function x700081_OnFubenReady_Team(sceneId, destsceneId)

	
	local leaderguid = GetFubenData_TeamLeader(destsceneId);
	local leaderObjId = Guid2ObjId(sceneId, leaderguid);
	local nIndex = x700081_GetFubenIndex(sceneId, leaderObjId)

	local nScriptId = x700081_g_RegisterFuben[nIndex].id

	
	
	for i=20, 239 do
		SetFubenData_Param(destsceneId,i,0)
	end
	


	
	local nMode = GetFubenData_Param(destsceneId, x700081_CSP_FUBEN_MODE )
	
	SetFubenData_Param(destsceneId, x700081_CSP_FUBEN_SCENE_ID, destsceneId);--保存副本场景号
	
	

	

	if nMode==1 then

		if GetGameOpenById(1022)<=0 then
			return 0
		end

	end
	local	memberNum = GetNearTeamCount(sceneId, leaderObjId);


	--进入副本DEBUG信息
    local msg = "CSD,EnterFuben,"..nScriptId..","..destsceneId..","..memberNum
	
	--// add in 2009-4-3---------------------------
	local j=0
	for i=x700081_CSP_GUID_START, 254-1 do
		local nGuid = GetFubenData_Param(destsceneId,i)

		--nGuid = NumberCastIntToUInt(nGuid)

		if nGuid~=0 then
			local memberId =  Guid2ObjId(sceneId, nGuid);

			local nFromSceneId = GetFubenData_Param(destsceneId, x700081_CSP_BACKSCENEID)
			if nFromSceneId<0 then
				if IsPlayerStateNormal(sceneId,memberId ) > 0 then
					local countryId = GetCurCountry( sceneId, memberId )
					SetFubenData_Param(destsceneId, x700081_CSP_BACKSCENEID, x700081_g_BackSceneList[nIndex][countryId+1]);--设置副本入口场景号
				end
			end

			

			local ErrorCode = x700081_IsPlayerErrorState( sceneId,memberId )
			if ErrorCode == 0 then --正常游戏状态
				
		
				local x = x700081_g_EnterPosList[nIndex][j+1].x
				local z = x700081_g_EnterPosList[nIndex][j+1].z
				
				if CallScriptFunction(COUNTRY_BATTLE_LITE_SCRIPT,"CheckCountryBattleLiteSceneTrans",sceneId,memberId,destsceneId) == 1 then
					NewWorld(sceneId, memberId, destsceneId, x, z, 700081);
					msg = msg..","..nGuid
				end
				
				j = j+1	
				
			end

			if IsPlayerStateNormal(sceneId,memberId ) > 0 then
				-- unlock
				SetPlayerMutexState( sceneId,memberId ,PLAYER_STATE_READYFUBEN ,0)
			end

			
		end
	end
	--// add end-----------------------------------

	--写日志
    WriteLog(1,msg)

end


function x700081_GetBackPosition(sceneId, selfId, nIndex)
	local npos = random(1,6)
	local x1 = x700081_g_BackPosList[nIndex][npos].x
	local z1 = x700081_g_BackPosList[nIndex][npos].z

	return x1,z1
	
end

---------------------------------------------------------------------------------------------------
--玩家进入副本时的处理,设置进入副本的位置
---------------------------------------------------------------------------------------------------
function x700081_OnPlayerEnter(sceneId, selfId)
	local nFubenType = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE)
	local nScriptId = GetFubenData_Param(sceneId, x700081_CSP_SCRIPTID )
	local nIndex =0;
	for i,item in x700081_g_RegisterFuben do
		nIndex = nIndex+1
		if item.id == nScriptId and item.fubentype==nFubenType  then
			break
		end
	end
	--//add in 2009-6-12
	local leaveFlag = GetFubenData_Param(sceneId, x700081_CSP_ISCLOSING);

	if leaveFlag > 0 then

		--提示xx秒后将退出副本
		local leaveCountDown = GetFubenData_Param(sceneId, x700081_CSP_LEAVECOUNTDOWN) + 1;

		local nCloseTick = GetFubenData_Param(sceneId, x700081_CSP_CLOSETICK);
		
		if leaveCountDown >= nCloseTick then
			local oldsceneId = GetFubenData_Param(sceneId, x700081_CSP_BACKSCENEID);
			
			RelivePlayerNM( sceneId,selfId,2) --如果玩家处于死亡状态，自动复活
			SetPlayerMutexState( sceneId,selfId,PLAYER_STATE_DIE,0)
			TimerCommand( sceneId, selfId, 1, 7010, 3, nScriptId, -1, -1 );


			local x,z = x700081_GetBackPosition(sceneId, selfId, nIndex)

			NewWorld(sceneId, humanId, selfId, x, z, nScriptId);
			return
		end
			
	end
	--//add end
	local x,z = x700081_GetBackPosition(sceneId, selfId, nIndex)
	SetPlayerDefaultReliveInfo(sceneId, selfId, "%10", "%10", "%10", sceneId, x, z);

	--//add in 2009-6-2 check if it is the human who have applyed
	local myGuid = GetPlayerGUID( sceneId,selfId )
	myGuid = format("%u",myGuid)
	local bFind =0
	for i= 0 ,6 - 1  do
       
        local paramidx = x700081_CSP_GUID_START + i

        local guid = GetFubenData_Param(sceneId, paramidx )
		guid=format("%u",guid)
		if myGuid==guid then
			bFind =1
			break;
		end
    end

	if bFind==0 and x700081_GetFubenType(nIndex) ~= 2 then
		local nWeekCount = x700081_GetEnterCount(sceneId, selfId, nIndex)
		FubenIllegalEnterLog(sceneId, selfId, 1001,nWeekCount)
	end
	--//add end
end

function x700081_OnPlayerEnterFinished(sceneId, selfId)

	local nFubenType = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE)
	local nScriptId = GetFubenData_Param(sceneId, x700081_CSP_SCRIPTID )
	local nIndex =0;
	local bProcPlayerEnter = 0
	for i,item in x700081_g_RegisterFuben do
		nIndex = nIndex+1
		if item.id == nScriptId and item.fubentype==nFubenType  then
			if item.procPlayerEnter ~= nil and item.procPlayerEnter == 1 then
				bProcPlayerEnter = 1
			end
			break
		end
	end
	local myGuid = GetPlayerGUID( sceneId,selfId )
	myGuid = format("%u",myGuid)
	local bFind =0

	local iIndex =-1
	for i= 0 ,6 - 1  do
       
		iIndex = iIndex+1
        local paramidx = x700081_CSP_GUID_START + i

        local guid = GetFubenData_Param(sceneId, paramidx )
		guid=format("%u",guid)
		if myGuid==guid then
			bFind =1
			break;
		end
    end
	
	if bFind==0 then
		local x,z = x700081_GetBackPosition(sceneId, selfId, nIndex)
		local oldsceneId = GetFubenData_Param(sceneId, x700081_CSP_BACKSCENEID);
		NewWorld(sceneId, selfId, oldsceneId, x, z, nScriptId);	
		
		WriteLog(1,"Fuben KickOut! Reason:".."illeage enter,"..nScriptId..",".. myGuid..","..GetName(sceneId, selfId))
		return
	end

	--处理玩家进入情况，不是所有的副本都有此操作，如果需要此操作，请注册procPlayerEnter标记
	if bProcPlayerEnter == 1 then
		CallScriptFunction(nScriptId,"OnPlayerEnter",sceneId,selfId)
	end
	
	local bLoged = GetFubenData_Param(sceneId, x700081_CSP_PLAYER_ENTER_START+iIndex);
	
	
	if bLoged==0 then
		
		
		local nRet = x700081_OnPlayerFirstEnterFuben(sceneId,selfId, nIndex)
		
		if nRet>0 then
			SetFubenData_Param(sceneId, x700081_CSP_PLAYER_ENTER_START+iIndex, 1 )	
		end
	end
	
end

function x700081_OnPlayerLeave(sceneId, selfId)
	local nFubenType = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE)
	local nScriptId = GetFubenData_Param(sceneId, x700081_CSP_SCRIPTID )
	local nIndex =0;
	local bProcPlayerLeave = 0
	for i,item in x700081_g_RegisterFuben do
		nIndex = nIndex+1
		if item.id == nScriptId and item.fubentype==nFubenType  then
			
			if item.procPlayerLeave ~= nil and item.procPlayerLeave == 1 then
				bProcPlayerLeave = 1
			end
			break
		end
	end
	
	--副本退出处理
	if bProcPlayerLeave == 1 then
		CallScriptFunction(nScriptId,"OnPlayerLeave",sceneId,selfId)
	end
	
end

--function x700081_OnPlayerLeave(sceneId, selfId)
--	local nFubenType = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE)
--	local nScriptId = GetFubenData_Param(sceneId, x700081_CSP_SCRIPTID )
--	local nIndex =0;
--	local bProcPlayerLeave = 0
--	for i,item in x700081_g_RegisterFuben do
--		nIndex = nIndex+1
--		if item.id == nScriptId and item.fubentype==nFubenType  then
--			
--			if item.procPlayerLeave ~= nil and item.procPlayerLeave == 1 then
--				bProcPlayerLeave = 1
--			end
--			break
--		end
--	end
--	
--	--副本退出处理
--	if bProcPlayerLeave == 1 then
--		CallScriptFunction(nScriptId,"OnPlayerLeave",sceneId,selfId)
--	end
--	
--end

function x700081_OnPlayerFirstEnterFuben(sceneId, selfId, nIndex)

		
	local nMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE )
	local nScriptId = GetFubenData_Param(sceneId, x700081_CSP_SCRIPTID )
	local nDateCount = x700081_g_CountUntilList[nIndex]

	local nRet = x700081_CheckOwnerItemRequest(sceneId, selfId, nMode, nIndex) --CHECK ITEM

	if nRet>0 then
		x700081_OnXianJinRequestOk(sceneId, selfId, nIndex, nMode)  --DEL ITEM
		x700081_SetTotalCount(sceneId, selfId, nIndex, nMode)   -- add sanhuan total count
		if( nDateCount > 0 ) then
			x700081_SetEnterCount(sceneId, selfId,nIndex, nMode)		-- add count
		end
	else
		local x,z = x700081_GetBackPosition(sceneId, selfId, nIndex)
		local oldsceneId = GetFubenData_Param(sceneId, x700081_CSP_BACKSCENEID);
		NewWorld(sceneId, selfId, oldsceneId, x, z, nScriptId);	
		
		local myGuid = GetPlayerGUID( sceneId,selfId )
		myGuid = format("%u",myGuid)
		WriteLog(1,"Fuben KickOut! Reason:".."not enough item,"..nScriptId..",".. myGuid..","..GetName(sceneId, selfId))
		return 0
	end
	return 1
end


function x700081_EnterTick(sceneId, nowTickCount, nScriptId, nIndex)
	CallScriptFunction(nScriptId,"EnterTick", sceneId, nowTickCount)
end

---------------------------------------------------------------------------------------------------
--副本定时器处理
---------------------------------------------------------------------------------------------------
function x700081_OnFubenTimer(sceneId, nowTime)
	
	
	
	local nScriptId = GetFubenData_Param(sceneId, x700081_CSP_SCRIPTID )

	local nFubenType = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE)
	local nIndex =0;
	for i,item in x700081_g_RegisterFuben do
		nIndex = nIndex+1
		if item.id == nScriptId and item.fubentype==nFubenType  then
			break
		end
	end

	local nTickTime = GetFubenData_Param(sceneId, x700081_CSP_TICKTIME );
	

	local nowTickCount = GetFubenData_Param(sceneId, x700081_CSP_TICKCOUNT) + 1;
	SetFubenData_Param(sceneId, x700081_CSP_TICKCOUNT, nowTickCount);

	local leaveFlag = GetFubenData_Param(sceneId, x700081_CSP_ISCLOSING);

	if leaveFlag > 0 then

		--提示xx秒后将退出副本
		local leaveCountDown = GetFubenData_Param(sceneId, x700081_CSP_LEAVECOUNTDOWN) + 1;
		SetFubenData_Param(sceneId, x700081_CSP_LEAVECOUNTDOWN, leaveCountDown);
		local nCloseTick = GetFubenData_Param(sceneId, x700081_CSP_CLOSETICK);
		if leaveCountDown >= nCloseTick then
			local oldsceneId = GetFubenData_Param(sceneId, x700081_CSP_BACKSCENEID);
			local humancount = GetFuben_PlayerCount(sceneId);
			for	i = 0, humancount - 1 do
				local humanId = GetFuben_PlayerObjId(sceneId, i);
                RelivePlayerNM( sceneId,humanId,2) --如果玩家处于死亡状态，自动复活
                SetPlayerMutexState( sceneId,humanId,PLAYER_STATE_DIE,0) 
                TimerCommand( sceneId, humanId, 1, 7010, 3, nScriptId, -1, -1 );

                local x,z = x700081_GetBackPosition(sceneId, selfId, nIndex)

				NewWorld(sceneId, humanId, oldsceneId, x, z, nScriptId);
			end
		elseif leaveCountDown < nCloseTick then

			

			local humancount = GetFuben_PlayerCount(sceneId);
			for	i = 0, humancount - 1 do
				local humanId = GetFuben_PlayerObjId(sceneId, i);
 				local str = format(x700081_g_CountDownMessage, (nCloseTick - leaveCountDown) * nTickTime);
  				BeginQuestEvent(sceneId);
  				AddQuestText(sceneId, str);
  				EndQuestEvent(sceneId);

  				DispatchQuestTips(sceneId, humanId);
			end
		end

	else

        if nowTickCount == 1 then
			
			x700081_OnFubenSceneCreated(sceneId, nScriptId, nIndex )
        end

		local humancount = GetFuben_PlayerCount(sceneId);

        if nowTickCount >= 2 then
			if humancount>0 then
				x700081_EnterTick(sceneId, nowTickCount,nScriptId, nIndex )
			end
		end

		local nHoldTime = GetFubenData_Param(sceneId, x700081_CSP_HOLDTIME);
		--副本计时器
        local nTime = ( nHoldTime- nowTickCount )*nTickTime

		
		for i = 0, humancount - 1 do
			local humanId = GetFuben_PlayerObjId(sceneId, i);
            
            TimerCommand( sceneId, humanId, 1, 7010, 3, nScriptId, -1, -1 );

            if nTime > 0 then

                local nEventTime = nTime
                if nTime > 10 then
                    nEventTime = nTime - 10
                end
                TimerCommand( sceneId, humanId, 2, 7010, 3, nScriptId, nTime, nTime );
            end

			-- 检查是否过了场景的生存期
			if nowTickCount == nHoldTime then
				BeginQuestEvent(sceneId);
					AddQuestText(sceneId, x700081_g_TimeOutFailedMessage);
				EndQuestEvent();
				DispatchQuestTips(sceneId, humanId);
			end
		end

        if nowTickCount == nHoldTime then
            SetFubenData_Param(sceneId, x700081_CSP_ISCLOSING,1);
        end
	end

end


---------------------------------------------------------------------------------------------------
--初始化自动等级
---------------------------------------------------------------------------------------------------
function x700081_InitAutoLevel_Team( sceneId,selfId , nIndex, memberNum,autoleveltype )

    if autoleveltype == 0 then          -- 最高等级匹配

        --取得队伍里玩家最高等级
        local maxlevel = 0
        if memberNum < 0 then
        	local level = GetLevel(sceneId,selfId)
	
	        if maxlevel < level then
	            maxlevel = level
	        end
        else
	        for i = 0, memberNum - 1 do
	            local memberId = GetNearTeamMember(sceneId, selfId, i);
	            local level = GetLevel(sceneId,memberId)
	
	            if maxlevel < level then
	                maxlevel = level
	            end
	        end
		end
        SetFubenData_Param(sceneId, x700081_CSP_FUBENLEVEL, maxlevel) ;					    --配置副本等级

    elseif autoleveltype == 1 then      -- 最低等级匹配

        --取得队伍里玩家最低等级
        local minlevel = 1000
        if memberNum < 0 then
        	local level = GetLevel(sceneId,selfId)
	
	            if minlevel > level then
	                minlevel = level
	            end
        else
	        for i = 0, memberNum - 1 do
	            local memberId = GetNearTeamMember(sceneId, selfId, i);
	            local level = GetLevel(sceneId,memberId)
	
	            if minlevel > level then
	                minlevel = level
	            end
	        end
		end
        SetFubenData_Param(sceneId, x700081_CSP_FUBENLEVEL, minlevel) ;					    --配置副本等级

    elseif autoleveltype == 2 then      --平均等级匹配

        --计算平均等级

        local averagelevel = 0
        local levelval1 = 0
        local levelval2 = 0
        
        local maxLevel = 0
        local minLevel = 200
        	
        if memberNum < 0 then
        	 local level = GetLevel(sceneId,selfId)
	
	            levelval1 = levelval1 + level*level
	            levelval2 = levelval2 + level
        else
        	
	        for i = 0, memberNum - 1 do
	            local memberId = GetNearTeamMember(sceneId, selfId, i);
	            local level = GetLevel(sceneId,memberId)
				
	            levelval1 = levelval1 + level*level
	            levelval2 = levelval2 + level
	            
	            if level < minLevel then
					minLevel = level
				end
				if level > maxLevel then
					maxLevel = level
				end
	        end
		end
        averagelevel = levelval1 / levelval2

        SetFubenData_Param(sceneId, x700081_CSP_FUBENLEVEL, averagelevel) ;					--配置副本等级
        
        if nIndex == 35 or nIndex == 36 or nIndex == 37 then --轮回台（经验）
	        if maxLevel - minLevel >= 15 then	--开启新手副本模式
				SetFubenData_Param( sceneId, x700081_CSP_XINSHOU_FLAG, 1)
				--SetFubenData_Param( sceneId, x700022_CSP_XINSHOU_LEVEL, minLevel)
				SetFubenData_Param(sceneId, x700081_CSP_FUBENLEVEL, minLevel )
			end
		end
	end
end


---------------------------------------------------------------------------------------------------
--检查玩家错误状态
---------------------------------------------------------------------------------------------------
function x700081_IsPlayerErrorState( sceneId,selfId )

    local state

    state = IsPlayerStateNormal(sceneId,selfId )
    if state == 0 then
        return 1
    end

    state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_MENTALGAME )
    if state == 1 then
        return 1
    end

    state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_STALL )
    if state == 1 then
        return 1
    end

    state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_DIE )
    if state == 1 then
        return 1
    end

    state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_CRASHBOX )
    if state == 1 then
        return 1
    end

    state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_AUTOPLAY )
    if state == 1 then
        return 1
    end

    state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_SUBTRAIN )
    if state == 1 then
        return 1
    end

    state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_BUS )
    if state == 1 then
        return 1
    end

		state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_ENJAIL )
    if state == 1 then
        return 1
    end	

	--// add in 2-20-2009
	state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_WEDDING )
    if state == 1 then
        return 1
    end

	state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_TONGQUBUFF )
    if state == 1 then
        return 1
    end

	state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_TIESAN )
    if state == 1 then
        return 1
    end
	--// added end


    return 0

end



---------------------------------------------------------------------------------------------------
--取得当前次数
---------------------------------------------------------------------------------------------------
function x700081_GetEnterCount(sceneId, selfId, nIndex)
	
--	if x700081_GetFubenType(nIndex) == 2 then
--		return 100
--	end
	if x700081_g_RegisterFuben[nIndex].fubentype==0 then  --正常副本
		
		
		local n_dateIndex = x700081_md_List[nIndex][1]
		local n_dateCount = x700081_md_List[nIndex][2]

		local n_CountMode = x700081_g_CountModeList[nIndex]
		
		if n_CountMode == 0 then
			return 0
		elseif n_CountMode == 1 then
			local today = GetDayOfYear()
			local lastDay = GetQuestData(sceneId, selfId, n_dateIndex[1], n_dateIndex[2],n_dateIndex[3] )
			if today ~= lastDay then
				return 0
			end
			local dayCount = GetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2],n_dateCount[3] )
			return dayCount
		elseif n_CountMode == 2 then
			local weekIndex = GetWeekIndex()
			local lastWeek = GetQuestData(sceneId, selfId, n_dateIndex[1], n_dateIndex[2],n_dateIndex[3] )
			if lastWeek ~= weekIndex then
				return 0, 0
			end
			local weekcount = GetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2],n_dateCount[3] )
			
			local dayCount = 0
			
			local n_today = x700081_md_List[nIndex][3]
			local n_todayCount = x700081_md_List[nIndex][4]
			if n_today ~= nil and n_todayCount ~= nil then
				local today = GetDayOfYear()
				local lastDay = GetQuestData(sceneId, selfId, n_today[1], n_today[2],n_today[3] )
				if today == lastDay then	
					dayCount = GetQuestData(sceneId, selfId, n_todayCount[1], n_todayCount[2],n_todayCount[3] )
				end
			end
			
			return weekcount, dayCount
		end
	elseif x700081_g_RegisterFuben[nIndex].fubentype==1 then --试炼副本
		local nMDcount = x700081_md_List[nIndex][1]
		local count = GetQuestData(sceneId, selfId, nMDcount[1], nMDcount[2], nMDcount[3])
		return count
	elseif x700081_g_RegisterFuben[nIndex].fubentype==2 then --英雄副本
		return 100
	end

	

end

function x700081_SetTotalCount(sceneId, selfId, nIndex, nMode)
	if x700081_g_RegisterFuben[nIndex].fubentype==0 and x700081_g_RegisterFuben[nIndex].loopindex==1 then
		local count = GetQuestData(sceneId, selfId, MD_FUBEN_SANHUANTOTAL[1], MD_FUBEN_SANHUANTOTAL[2], MD_FUBEN_SANHUANTOTAL[3])
		if nMode == 0 then
			count = count + 1
		elseif nMode == 1 then
			count = count + 3
		elseif nMode == 2 then
			count = count + 21
		end
		SetQuestData(sceneId, selfId, MD_FUBEN_SANHUANTOTAL[1], MD_FUBEN_SANHUANTOTAL[2], MD_FUBEN_SANHUANTOTAL[3], count)
	end
end
---------------------------------------------------------------------------------------------------
--设置当天次数
---------------------------------------------------------------------------------------------------
function x700081_SetEnterCount(sceneId, selfId, nIndex, nMode)
--	if x700081_GetFubenType(nIndex) == 2 then
--		return
--	end
	if x700081_g_RegisterFuben[nIndex].fubentype==0 then
		local n_dateIndex = x700081_md_List[nIndex][1]
		local n_dateCount = x700081_md_List[nIndex][2]
		local n_CountMode = x700081_g_CountModeList[nIndex]
		
		if n_CountMode == 0 then
			return
		end
		
		local today = GetDayOfYear()
		local weekIndex = GetWeekIndex()
		
		local lastDate = GetQuestData(sceneId, selfId, n_dateIndex[1], n_dateIndex[2], n_dateIndex[3])
		local dateCount = GetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3])
		
		if nMode == 0 then
			if n_CountMode == 1 then
				if today ~= lastDate then
					SetQuestData(sceneId, selfId, n_dateIndex[1], n_dateIndex[2], n_dateIndex[3], today)
					SetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3], 1)
				else
					SetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3], dateCount+1)
				end
			elseif n_CountMode == 2 then
				if weekIndex ~= lastDate then
					SetQuestData(sceneId, selfId, n_dateIndex[1], n_dateIndex[2], n_dateIndex[3], weekIndex)
					SetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3], 1)
				else
					SetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3], dateCount+1)
				end
			end
		elseif nMode == 1 then
			if n_CountMode == 1 then
				if today ~= lastDate then
					SetQuestData(sceneId, selfId, n_dateIndex[1], n_dateIndex[2], n_dateIndex[3], today)
					SetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3], x700081_g_CountUntilList[nIndex])
				else
					SetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3], dateCount+x700081_g_CountUntilList[nIndex])
				end
			elseif n_CountMode == 2 then
				if weekIndex ~= lastDate then
					SetQuestData(sceneId, selfId, n_dateIndex[1], n_dateIndex[2], n_dateIndex[3], weekIndex)
					SetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3], x700081_g_SanfanTimes)
				else
					SetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3], dateCount+x700081_g_SanfanTimes)
				end
				
				local n_today = x700081_md_List[nIndex][3]
				local n_todayCount = x700081_md_List[nIndex][4]
				if n_today ~= nil and n_todayCount ~= nil then
					local lastDate_ = GetQuestData(sceneId, selfId, n_today[1], n_today[2], n_today[3])
					local dateCount_ = GetQuestData(sceneId, selfId, n_todayCount[1], n_todayCount[2], n_todayCount[3])
					
					if today ~= lastDate_ then
						SetQuestData(sceneId, selfId, n_today[1], n_today[2], n_today[3], today)
						SetQuestData(sceneId, selfId, n_todayCount[1], n_todayCount[2], n_todayCount[3], 3)
					else
						SetQuestData(sceneId, selfId, n_todayCount[1], n_todayCount[2], n_todayCount[3], dateCount_+3)
					end
				end
			end

		elseif nMode == 2 then
			if n_CountMode == 1 then
				if today ~= lastDate then
					SetQuestData(sceneId, selfId, n_dateIndex[1], n_dateIndex[2], n_dateIndex[3], today)
					SetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3], x700081_g_ZhouSanfanTimes)
				else
					SetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3], dateCount+x700081_g_ZhouSanfanTimes)
				end
			elseif n_CountMode == 2 then
				if weekIndex ~= lastDate then
					SetQuestData(sceneId, selfId, n_dateIndex[1], n_dateIndex[2], n_dateIndex[3], weekIndex)
					SetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3], x700081_g_ZhouSanfanTimes)
				else
					SetQuestData(sceneId, selfId, n_dateCount[1], n_dateCount[2], n_dateCount[3], dateCount+x700081_g_ZhouSanfanTimes)
				end
			end
		end
		
	elseif x700081_g_RegisterFuben[nIndex].fubentype==1 then --试炼副本
		local nMDcount = x700081_md_List[nIndex][1]
		SetQuestData(sceneId, selfId, nMDcount[1], nMDcount[2], nMDcount[3], 1)
	end
	
	
	
end

---------------------------------------------------------------------------------------------------
--设置现金副本次数
---------------------------------------------------------------------------------------------------
--function x700081_SetWeekCount_XJ(sceneId, selfId, nIndex)
--	if x700081_g_RegisterFuben[nIndex].fubentype==0 then
--		local n_weekIndex = x700081_md_List[nIndex][1]
--		local n_weekCount = x700081_md_List[nIndex][2]
--	
--	
--		--local today = GetDayOfYear()
--		local weekIndex = GetWeekIndex()
--	
--		local lastweek = GetQuestData(sceneId, selfId, n_weekIndex[1], n_weekIndex[2], n_weekIndex[3])
--	
--		if lastweek ~= weekIndex then
--			SetQuestData(sceneId, selfId, n_weekIndex[1], n_weekIndex[2], n_weekIndex[3], weekIndex)
--			SetQuestData(sceneId, selfId, n_weekCount[1], n_weekCount[2], n_weekCount[3], x700081_g_CountUntilList[nIndex])
--		else
--			
--			SetQuestData(sceneId, selfId, n_weekCount[1], n_weekCount[2], n_weekCount[3], x700081_g_CountUntilList[nIndex])
--		end
--	end
--end


function x700081_OnDie(sceneId, selfId, killerId)
end
---------------------------------------------------------------------------------------------------
--玩家死亡
---------------------------------------------------------------------------------------------------
function x700081_OnPlayerDie(sceneId, selfId, killerId)
	if GetSceneType(sceneId) ==  1 then
		SetFubenData_Param(sceneId,x700081_CSP_PLAYER_DEAD, 1)
	end
end


----*************************************************************************************************
-- Check Team Function
----*************************************************************************************************

function x700081_CheckAllMemberNear(sceneId, selfId)
    local nNearCount  = GetNearTeamCount( sceneId,selfId )
    local nTotalCount = GetTeamSize( sceneId,selfId )

    if nNearCount ~= nTotalCount then
        return 0
    end

    return 1
end


---------------------------------------------------------------------------------------------------
--检查队伍里附近队友的最小级别
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberMaxLevel(sceneId, selfId, teamnum, nIndex)


	local tips,result

	result = 1

	
	local nLevelMax = x700081_g_LevelRangeList[nIndex][2]

	if(  nLevelMax> 0 ) then
		if teamnum < 0 then
			if GetLevel(sceneId, selfId) > nLevelMax then
				if result == 1 then
					result = 0
					tips = GetName(sceneId, selfId)
				else
					tips = tips..","..GetName(sceneId, selfId)
				end
			end
		else
			for i = 0, teamnum - 1 do
				local memberId = GetNearTeamMember(sceneId, selfId, i);
				if GetLevel(sceneId, memberId) > nLevelMax then
					if result == 1 then
						result = 0
						tips = GetName(sceneId, memberId)
					else
						tips = tips..","..GetName(sceneId, memberId)
					end
				end
			end
		end
	end

	if result == 0 then
		tips = tips..format("的等级超过%d级！", nLevelMax)
	end

	return result,tips;
end


---------------------------------------------------------------------------------------------------
--检查队伍里附近队友的最小级别
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberMinLevel(sceneId, selfId, teamnum, nIndex)


	local tips,result

	result = 1

	local nLevelMin = x700081_g_LevelRangeList[nIndex][1]
	

	if nLevelMin> 0 then
		if teamnum < 0 then
			if GetLevel(sceneId, selfId) < nLevelMin then
				if result == 1 then
					result = 0
					tips = GetName(sceneId, selfId)
				else
					tips = tips..","..GetName(sceneId, selfId)
				end
			end
		else
			for i = 0, teamnum - 1 do
				local memberId = GetNearTeamMember(sceneId, selfId, i);
				if GetLevel(sceneId, memberId) < nLevelMin then
					if result == 1 then
						result = 0
						tips = GetName(sceneId, memberId)
					else
						tips = tips..","..GetName(sceneId, memberId)
					end
				end
			end
		end
	end
	if result == 0 then
		tips = tips..format("的等级不足%d级！", nLevelMin)
	end

	return result,tips;
end

---------------------------------------------------------------------------------------------------
--检查队伍里玩家进入次数
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberEnterCount(sceneId, selfId, teamnum, nMode, nIndex)

	local tips,result

	result = 1

	if nMode==nil then
		nMode=0
	end

	local nType = x700081_GetFubenType(nIndex)
	if nType == 2 then
		return 1,nil
	end
	
	local nCountLimited = x700081_g_CountUntilList[nIndex]
	
	if nCountLimited <= 0 then
		return 1,nil
	end
	
--	local nMaxCount = nWeekLimited
--	if nMode==1 then
--		nMaxCount = 1
--	end

	if nMode == 1 then   --三番模式
		if teamnum < 0 then
			local enterCount = x700081_GetEnterCount(sceneId, selfId, nIndex)
			if enterCount > (nCountLimited - x700081_g_SanfanTimes) then
			
				if result == 1 then
					result = 0
					tips = GetName(sceneId, selfId)
				else
					tips = tips..","..GetName(sceneId, selfId)
				end
			end
		else
			for i = 0, teamnum - 1 do
				local memberId = GetNearTeamMember(sceneId, selfId, i);
				
				local enterCount = x700081_GetEnterCount(sceneId, memberId, nIndex)
				if enterCount > (nCountLimited - x700081_g_SanfanTimes) then
				
					if result == 1 then
						result = 0
						tips = GetName(sceneId, memberId)
					else
						tips = tips..","..GetName(sceneId, memberId)
					end
				end
			end
		end
		if result ~= 0 then
			local str_ = ""
			if teamnum < 0 then
				local enterCount, todayCount = x700081_GetEnterCount(sceneId, selfId, nIndex)
				
				if todayCount ~= nil and todayCount >= 4 then
					if str_ == "" then
						str_ = GetName(sceneId, selfId)
					else
						str_ = str_..","..GetName(sceneId, selfId)
					end
				end
			else
				for i = 0, teamnum - 1 do
					local memberId = GetNearTeamMember(sceneId, selfId, i)
					local enterCount, todayCount = x700081_GetEnterCount(sceneId, memberId, nIndex)
				
					if todayCount ~= nil and todayCount >= 7 then
						if str_ == "" then
							str_ = GetName(sceneId, memberId)
						else
							str_ = str_..","..GetName(sceneId, memberId)
						end
						break
					end
				end
			end
			if str_ ~= "" then
				if result == 1 then
					result = 0
					tips = format("很抱歉！%s今天进入三环副本（三番令）已满3次，请明天再来！", "#G"..str_.."#o")
				else
					tips = tips..","..format("很抱歉！%s今天进入三环副本（三番令）已满3次，请明天再来！", "#G"..str_.."#o")
				end
				return result,tips;
			end
		end
	elseif nMode == 2 then  --周三番模式
		if teamnum < 0 then
			local enterCount = x700081_GetEnterCount(sceneId, selfId, nIndex)
			if enterCount > (nCountLimited - x700081_g_ZhouSanfanTimes) then
				if result == 1 then
					result = 0
					tips = GetName(sceneId, selfId)
				else
					tips = tips..","..GetName(sceneId, selfId)
				end
			end
		else
			for i = 0, teamnum - 1 do
				local memberId = GetNearTeamMember(sceneId, selfId, i);
				local enterCount = x700081_GetEnterCount(sceneId, memberId, nIndex)
				if enterCount > (nCountLimited - x700081_g_ZhouSanfanTimes) then
					if result == 1 then
						result = 0
						tips = GetName(sceneId, memberId)
					else
						tips = tips..","..GetName(sceneId, memberId)
					end
				end
			end
		end
	else                     --普通模式
		if teamnum < 0 then
			local enterCount = x700081_GetEnterCount(sceneId, selfId, nIndex)
			if enterCount  >= nCountLimited then
				if result == 1 then
					result = 0
					tips = GetName(sceneId, selfId)
				else
					tips = tips..","..GetName(sceneId, selfId)
				end
			end
		else
			for i = 0, teamnum - 1 do
				local memberId = GetNearTeamMember(sceneId, selfId, i);
				local enterCount = x700081_GetEnterCount(sceneId, memberId, nIndex)
				if enterCount  >= nCountLimited then
					if result == 1 then
						result = 0
						tips = GetName(sceneId, memberId)
					else
						tips = tips..","..GetName(sceneId, memberId)
					end
				end
			end
		end
	end
	
	if result == 0 then
		if nMode==1 then
			tips = tips.." 本周副本剩余次数不足，无法进入三环副本（三番令）！"
		elseif nMode == 2 then
			tips = tips.." 本周副本剩余次数不足，无法进入黄金三番副本！"		
		else
			tips = tips.." 超过副本次数限制"
		end
	end

	return result,tips;
	--return 1,tips; --TEST

end



---------------------------------------------------------------------------------------------------
--检查队伍中是否有错误状态
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberErrorState( sceneId, selfId, teamnum )

    local result,tips ;

    -- 正常游戏状态
    result,tips = x700081_CheckAllMemberErrorState_NormalState( sceneId,selfId,teamnum )
    if result == 0 then
        return result,tips
    end

    -- 死亡状态
    result,tips = x700081_CheckAllMemberErrorState_Die( sceneId, selfId, teamnum )
    if result == 0 then
        return result,tips
    end

    -- 代练状态
    result,tips = x700081_CheckAllMemberErrorState_AutoPlay( sceneId,selfId,teamnum )
    if result == 0 then
        return result,tips
    end

    -- 摆摊状态
    result,tips = x700081_CheckAllMemberErrorState_Stall( sceneId,selfId,teamnum )
    if result == 0 then
        return result,tips
    end

    -- 答题状态
    result,tips = x700081_CheckAllMemberErrorState_MentalGame( sceneId,selfId,teamnum )
    if result == 0 then
        return result,tips
    end

    -- 运镖状态
    result,tips = x700081_CheckAllMemberErrorState_CrashBox( sceneId,selfId,teamnum )
    if result == 0 then
        return result,tips
    end

    -- BUS状态
    result,tips = x700081_CheckAllMemberErrorState_Bus( sceneId,selfId,teamnum )
    if result == 0 then
        return result,tips
    end

	 -- Enjail状态
    result,tips = x700081_CheckAllMemberErrorState_Enjail( sceneId,selfId,teamnum )
    if result == 0 then
        return result,tips
    end

	--// add in 2-20-2009
	-- 婚礼状态
	result,tips = x700081_CheckAllMemberErrorState_Wedding( sceneId,selfId,teamnum )
    if result == 0 then
        return result,tips
    end

	-- 童趣状态
	result,tips = x700081_CheckAllMemberErrorState_Tongqu( sceneId,selfId,teamnum )
    if result == 0 then
        return result,tips
    end

	-- 铁人三项状态
	result,tips = x700081_CheckAllMemberErrorState_Tiesan( sceneId,selfId,teamnum )
    if result == 0 then
        return result,tips
    end

    -- 暴龙大作战状态
    result,tips = x700081_CheckAllMemberErrorState_Baolong( sceneId,selfId,teamnum )
    if result == 0 then
        return result,tips
    end

	--// added end



    return 1


end


---------------------------------------------------------------------------------------------------
--正常游戏状态
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberErrorState_NormalState( sceneId, selfId, teamnum )
    local tips,result

	result = 1

    -- 检查游戏状态是否正常
    if teamnum == -1 then
    	local state = IsPlayerStateNormal(sceneId,selfId )
    	if state == 0 then
	        if result == 1 then
	            result = 0
	            tips = GetName(sceneId, selfId)
	        else
	            tips = tips..","..GetName(sceneId, selfId)
	        end
	    end
    else
	    for i = 0, teamnum - 1 do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        local state = IsPlayerStateNormal(sceneId,memberId )
	        if state == 0 then
	            if result == 1 then
	                result = 0
	                tips = GetName(sceneId, memberId)
	            else
	                tips = tips..","..GetName(sceneId, memberId)
	            end
	        end
	    end
	end
	if result == 0 then
		tips = tips.." 离线或不在当前场景"
	end

	return result,tips;
end

---------------------------------------------------------------------------------------------------
--处于答题状态
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberErrorState_MentalGame( sceneId, selfId, teamnum )
    local tips,result

	result = 1

    -- 检查游戏状态是否正常
    if teamnum == -1 then
    	 local state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_MENTALGAME )
	        if state == 1 then
	            if result == 1 then
	                result = 0
	                tips = GetName(sceneId, selfId)
	            else
	                tips = tips..","..GetName(sceneId, selfId)
	            end
	     end
    else
	    for i = 0, teamnum - 1 do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        local state = IsPlayerMutexState(sceneId,memberId,PLAYER_STATE_MENTALGAME )
	        if state == 1 then
	            if result == 1 then
	                result = 0
	                tips = GetName(sceneId, memberId)
	            else
	                tips = tips..","..GetName(sceneId, memberId)
	            end
	        end
	    end
	end

	if result == 0 then
		tips = tips.." 处于答题状态"
	end

	return result,tips
end

---------------------------------------------------------------------------------------------------
--处于摆摊状态
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberErrorState_Stall( sceneId, selfId, teamnum )
    local tips,result

	result = 1

    -- 检查游戏状态是否正常
    if teamnum == -1 then
    	local state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_STALL )
	    if state == 1 then
	        if result == 1 then
	            result = 0
	            tips = GetName(sceneId, selfId)
	        else
	            tips = tips..","..GetName(sceneId, selfId)
	        end
	    end
    else
	    for i = 0, teamnum - 1 do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        local state = IsPlayerMutexState(sceneId,memberId,PLAYER_STATE_STALL )
	        if state == 1 then
	            if result == 1 then
	                result = 0
	                tips = GetName(sceneId, memberId)
	            else
	                tips = tips..","..GetName(sceneId, memberId)
	            end
	        end
	    end
	end
	
	if result == 0 then
		tips = tips.." 处于摆摊状态"
	end

	return result,tips
end

---------------------------------------------------------------------------------------------------
--处于死亡状态
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberErrorState_Die( sceneId, selfId, teamnum )
    local tips,result

	result = 1

    -- 检查游戏状态是否正常
    if teamnum == -1 then
     	local state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_DIE )
	    if state == 1 then
	        if result == 1 then
	            result = 0
	            tips = GetName(sceneId, selfId)
	        else
	            tips = tips..","..GetName(sceneId, selfId)
	        end
	    end
    else
	    for i = 0, teamnum - 1 do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        local state = IsPlayerMutexState(sceneId,memberId,PLAYER_STATE_DIE )
	        if state == 1 then
	            if result == 1 then
	                result = 0
	                tips = GetName(sceneId, memberId)
	            else
	                tips = tips..","..GetName(sceneId, memberId)
	            end
	        end
	    end
	end

	if result == 0 then
		tips = tips.." 处于死亡状态"
	end

	return result,tips
end

---------------------------------------------------------------------------------------------------
--处于运镖状态
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberErrorState_CrashBox( sceneId, selfId, teamnum )
    local tips,result

	result = 1

    -- 检查游戏状态是否正常
    if teamnum == -1 then
    	local state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_CRASHBOX )
	    if state == 1 then
	        if result == 1 then
	            result = 0
	            tips = GetName(sceneId, selfId)
	        else
	            tips = tips..","..GetName(sceneId, selfId)
	        end
	    end
    else
	    for i = 0, teamnum - 1 do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        local state = IsPlayerMutexState(sceneId,memberId,PLAYER_STATE_CRASHBOX )
	        if state == 1 then
	            if result == 1 then
	                result = 0
	                tips = GetName(sceneId, memberId)
	            else
	                tips = tips..","..GetName(sceneId, memberId)
	            end
	        end
	    end
	end

	if result == 0 then
		tips = tips.." 处于运镖状态"
	end

	return result,tips
end

---------------------------------------------------------------------------------------------------
--处于代练或挂机状态
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberErrorState_AutoPlay( sceneId, selfId, teamnum )
    local tips,result

	result = 1

    -- 检查游戏状态是否正常
    if teamnum == -1 then
    	local state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_AUTOPLAY )
	    local state2 = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_SUBTRAIN )
	    if state == 1 or state2 == 1 then
	        if result == 1 then
	            result = 0
	            tips = GetName(sceneId, selfId)
	        else
	            tips = tips..","..GetName(sceneId, selfId)
	        end
	    end
    else
	    for i = 0, teamnum - 1 do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        local state = IsPlayerMutexState(sceneId,memberId,PLAYER_STATE_AUTOPLAY )
	        local state2 = IsPlayerMutexState(sceneId,memberId,PLAYER_STATE_SUBTRAIN )
	        if state == 1 or state2 == 1 then
	            if result == 1 then
	                result = 0
	                tips = GetName(sceneId, memberId)
	            else
	                tips = tips..","..GetName(sceneId, memberId)
	            end
	        end
	    end
	end

	if result == 0 then
		tips = tips.." 处于代练或挂机状态"
	end

	return result,tips
end

---------------------------------------------------------------------------------------------------
--处于Bus状态
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberErrorState_Bus( sceneId, selfId, teamnum )
    local tips,result

	result = 1

    -- 检查游戏状态是否正常
     if teamnum == -1 then
    	local state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_BUS )
	    if state == 1 then
	        if result == 1 then
	            result = 0
	            tips = GetName(sceneId, selfId)
	        else
	            tips = tips..","..GetName(sceneId, selfId)
	        end
	    end
    else
	    for i = 0, teamnum - 1 do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        local state = IsPlayerMutexState(sceneId,memberId,PLAYER_STATE_BUS )
	        if state == 1 then
	            if result == 1 then
	                result = 0
	                tips = GetName(sceneId, memberId)
	            else
	                tips = tips..","..GetName(sceneId, memberId)
	            end
	        end
	    end
	end
	if result == 0 then
		tips = tips.." 处于BUS状态"
	end

	return result,tips
end

---------------------------------------------------------------------------------------------------
--处于监狱状态
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberErrorState_Enjail( sceneId, selfId, teamnum )
    local tips,result

	result = 1


    -- 检查游戏状态是否正常
    if teamnum == -1 then
   		local state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_ENJAIL )
	    if state == 1 then
	        if result == 1 then
	            result = 0
	            tips = GetName(sceneId, selfId)
	        else
	            tips = tips..","..GetName(sceneId, selfId)
	        end
	    end
    else
	    for i = 0, teamnum - 1 do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        local state = IsPlayerMutexState(sceneId,memberId,PLAYER_STATE_ENJAIL )
	        if state == 1 then
	            if result == 1 then
	                result = 0
	                tips = GetName(sceneId, memberId)
	            else
	                tips = tips..","..GetName(sceneId, memberId)
	            end
	        end
	    end
	end

	if result == 0 then
		tips = tips.." 处于监禁状态"
	end

	return result,tips
end


---------------------------------------------------------------------------------------------------
--处于婚礼状态
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberErrorState_Wedding( sceneId, selfId, teamnum )
    local tips,result

	result = 1


    -- 检查游戏状态是否正常
    if teamnum == -1 then
    	local state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_WEDDING )
	    if state == 1 then
	        if result == 1 then
	            result = 0
	            tips = GetName(sceneId, selfId)
	        else
	            tips = tips..","..GetName(sceneId, selfId)
	        end
	    end
    else
	    for i = 0, teamnum - 1 do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        local state = IsPlayerMutexState(sceneId,memberId,PLAYER_STATE_WEDDING )
	        if state == 1 then
	            if result == 1 then
	                result = 0
	                tips = GetName(sceneId, memberId)
	            else
	                tips = tips..","..GetName(sceneId, memberId)
	            end
	        end
	    end
	end

	if result == 0 then
		tips = tips.." 处于婚礼状态"
	end

	return result,tips
end


---------------------------------------------------------------------------------------------------
--处于暴龙大作战状态
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberErrorState_Baolong( sceneId, selfId, teamnum )
    local tips,result

	result = 1


    -- 检查游戏状态是否正常
    if teamnum == -1 then
    
    	--是否在游乐场并处于变身状态
		local IsHaveFlag1 = IsHaveSpecificImpact(sceneId, selfId, 7536 )
	    local IsHaveFlag2 = IsHaveSpecificImpact(sceneId, selfId, 7537 )
	    
	    local state =0
	    if IsHaveFlag1 == 1 or IsHaveFlag2 == 1 then
	    	state = 1
	    end
	    
	    if state == 1 then
	        if result == 1 then
	            result = 0
	            tips = GetName(sceneId, selfId)
	        else
	            tips = tips..","..GetName(sceneId, selfId)
	        end
	    end
    else
	    for i = 0, teamnum - 1 do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        --是否在游乐场并处于变身状态
			local IsHaveFlag1 = IsHaveSpecificImpact(sceneId, memberId, 7536 )
		    local IsHaveFlag2 = IsHaveSpecificImpact(sceneId, memberId, 7537 )
		    
		    local state =0
		    if IsHaveFlag1 == 1 or IsHaveFlag2 == 1 then
		    	state = 1
		    end
		    
	        if state == 1 then
	            if result == 1 then
	                result = 0
	                tips = GetName(sceneId, memberId)
	            else
	                tips = tips..","..GetName(sceneId, memberId)
	            end
	        end
	    end
	end

	if result == 0 then
		tips = tips.." 处于暴龙大作战状态"
	end

	return result,tips
end

---------------------------------------------------------------------------------------------------
--处于童趣状态
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberErrorState_Tongqu( sceneId, selfId, teamnum )
    local tips,result

	result = 1


    -- 检查游戏状态是否正常
    if teamnum == -1 then
    	local state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_TONGQUBUFF )
	    if state == 1 then
	        if result == 1 then
	            result = 0
	            tips = GetName(sceneId, selfId)
	        else
	            tips = tips..","..GetName(sceneId, selfId)
	        end
	    end
    else
	    for i = 0, teamnum - 1 do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        local state = IsPlayerMutexState(sceneId,memberId,PLAYER_STATE_TONGQUBUFF )
	        if state == 1 then
	            if result == 1 then
	                result = 0
	                tips = GetName(sceneId, memberId)
	            else
	                tips = tips..","..GetName(sceneId, memberId)
	            end
	        end
	    end
	end
	
	if result == 0 then
		tips = tips.." 处于童趣状态"
	end

	return result,tips
end


---------------------------------------------------------------------------------------------------
--处于铁三状态
---------------------------------------------------------------------------------------------------
function x700081_CheckAllMemberErrorState_Tiesan( sceneId, selfId, teamnum )
    local tips,result

	result = 1


    -- 检查游戏状态是否正常
    if teamnum == -1 then
   	 	local state = IsPlayerMutexState(sceneId,selfId,PLAYER_STATE_TIESAN )
	    if state == 1 then
	        if result == 1 then
	            result = 0
	            tips = GetName(sceneId, selfId)
	        else
	            tips = tips..","..GetName(sceneId, selfId)
	        end
	    end
    else
	    for i = 0, teamnum - 1 do
	        local memberId = GetNearTeamMember(sceneId, selfId, i);
	        local state = IsPlayerMutexState(sceneId,memberId,PLAYER_STATE_TIESAN )
	        if state == 1 then
	            if result == 1 then
	                result = 0
	                tips = GetName(sceneId, memberId)
	            else
	                tips = tips..","..GetName(sceneId, memberId)
	            end
	        end
	    end
	end
	if result == 0 then
		tips = tips.." 处于铁人三项状态"
	end

	return result,tips
end

------------------------------------------------------
-- 记录副本排行榜
---------------------------------------------------------
function x700081_OnFubuenCompleted(sceneId)
	if GetSceneType(sceneId)~=1 then
		return
	end

	

	local nFubenType = GetFubenData_Param(sceneId, 0 )
	local nFubenMode = GetFubenData_Param(sceneId, 255 )

	local nParam = 0
	
	local strFubenName = ""
	if nFubenType == FUBEN_DONGHAIHAIYAN then
		nParam = QIULONGDAO_TOPLIST
		strFubenName = "囚龙岛"
	elseif nFubenType == FUBEN_HESHIBI then
		nParam = HESHIBI_TOPLIST
		strFubenName = "和氏璧"
	elseif nFubenType == FUBEN_ZHULUOJI then
		nParam = CAISHENDIAN_TOPLIST
		strFubenName = "赤血号"
	elseif nFubenType == FUBEN_ZHUJIAZHUANG3 then
		nParam = ZHUJIAZHUANG_TOPLIST
		strFubenName = "祝家庄"
	elseif nFubenType == FUBEN_FUTUTA4 then
		nParam = LUNHUITAI_TOPLIST
		strFubenName = "轮回台"
	elseif nFubenType == FUBEN_TANSUO_ZHANSHENMU_3 then
		nParam = ZHANSHENMU_TOPLIST
		strFubenName = "夏王墓"
	elseif nFubenType == FUBEN_YINDUSHENMIAO3 then
		nParam = INDIANTEMPLE_TOPLIST
		strFubenName = "印度河"
	elseif nFubenType == FUBEN_JIAOTANGMIMI3 then
		nParam = JINGJIAOTANG_TOPLIST
		strFubenName = "大教堂"			
	else
		return
	end

	--连环副本非现金副本不进排行榜
--	if nFubenMode == 0 then
--		return
--	end
	if nFubenType ~= FUBEN_FUTUTA4 then
		if nFubenMode == 0 then
			return
		end
	else
		Type = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE )
		if Type ~= 0 then
			return
		end
	end
	
	local nResult = x700081_CheckFubenTopList(sceneId)
	if nResult~=3 and nResult~=6 then
		return
	end

	local nTick = GetFubenData_Param(sceneId, x700081_CSP_LAST_TICKOUNT )
	local nTickCount = GetFubenData_Param(sceneId, x700081_CSP_TICKCOUNT )

	local humancount = GetFuben_PlayerCount(sceneId);

	--副本时间Start
	local nowTime = (nTick+nTickCount)*5;
	local nHour = floor(nowTime/3600)
	local nMinute = floor(mod(nowTime,3600)/60)
	local nSec = mod(nowTime,60)
	
	local strTime = "恭喜您仅用了"
	if nHour>0 then
		strTime = strTime..format("%d小时", nHour)
	end
	if nMinute>0 then
		strTime = strTime..format("%d分",nMinute)
	end
	if nSec>0 then
		strTime = strTime..format("%d秒",nSec)
	end

	strTime = strTime.."完成了"..strFubenName.."副本";
	
	x700081_ShowTipsToAll(sceneId,strTime)
	--//副本时间End
	for	i = 0, humancount - 1 do
		local humanId = GetFuben_PlayerObjId(sceneId, i);
		SendToplistKeyValue2GL(sceneId,humanId,nParam,(nTick+nTickCount)*5)
	end
	
	
end




--检查副本能不能进排行榜， 0：不能进， 1：能进
function x700081_CheckFubenTopList(sceneId, nCheckMode)
	if GetSceneType(sceneId)~=1 then
		return 1 -- "非副本内"
	end

	
	local bToplistDisabled = GetFubenData_Param(sceneId, x700081_CSP_B_TOPLIST_ABLE )

	if(bToplistDisabled>0) then
		return 2 -- "已经关闭"
	end

	local nScriptId = GetFubenData_Param(sceneId, 1 )

	

	local bFind = 0;
	local nMaxCount = 0;
	local nStdCampId = 0
	for i,item in x700081_g_TopListMonsterLimited do
		if item.scriptid ==  nScriptId then
			bFind = 1;
			nMaxCount = item.count;
			nStdCampId = item.campid
			break;
		end
	end

	if(bFind==0) then
		return 3 --"这个副本没有限制, 可以进入排行榜"
	end

	local nFubenType = GetFubenData_Param(sceneId, 0 )
	local nFubenMode = GetFubenData_Param(sceneId, 255 )

	--连环副本非现金副本不进排行榜
--	if nFubenMode == 0 then
--		return 4 --"不是现金连环副本"
--	end
	if nFubenType ~= FUBEN_FUTUTA4 then
		if nFubenMode == 0 then
			return 4 --"不是现金连环副本"
		end
	else
		Type = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE )
		if Type ~= 0 then
			return
		end
	end
	
	local nCount = 0;
	local nMonsterCount = GetMonsterCount(sceneId)
	for i=1,nMonsterCount do
    	local objid = GetMonsterObjID(sceneId,i-1)

		local nCamp = GetMonsterCamp(sceneId,objid)
    	if nCamp == nStdCampId then  --如果是敌对阵营
    		nCount = nCount + 1
    	end
	end

	if(nCount>nMaxCount) then
		if nCheckMode~=nil then
			if nCheckMode==1 then
			else
				SetFubenData_Param(sceneId, x700081_CSP_B_TOPLIST_ABLE, 1 )
				x700081_ShowTipsToAll(sceneId,"剩余怪物数过多，无法进入排行榜！")
			end
		else
			SetFubenData_Param(sceneId, x700081_CSP_B_TOPLIST_ABLE, 1 )
			x700081_ShowTipsToAll(sceneId,"剩余怪物数过多，无法进入排行榜！")
		end
		 
		return 5, nCount,nMaxCount --"剩余怪物数过多，无法进入排行榜！"
	end
	return 6


	
end


function x700081_GetTopListText(sceneId)
	local nResult, nCount, nMaxCount = x700081_CheckFubenTopList(sceneId, 1)

	---x700081_ShowTipsToAll(sceneId, format("nResult=%d", nResult))
	
	if nResult==5 then
		local str = "\n#Y排行榜说明：#W剩余怪物数过多，无法进入排行榜！"
		return str
	else
		return ""
	end

	


end


function x700081_GetTickTimeByScriptId(sceneId, nScriptId)
	for i,item in x700081_g_SpecialTickTimeList do
		if item.id == nScriptId then
			return item.tick
		end
	end

	return x700081_g_DefaultTickTime;
end



function x700081_GetCloseTickByScriptId(sceneId, nScriptId)
	for i,item in x700081_g_SpecialCloseTickList do
		if item.id == nScriptId then
			return item.tick
		end
	end

	return x700081_g_DefaultCloseTick;
end

----------------------------------------------------
--触发区域进入下一环使用
----------------------------------------------------
function x700081_GetNextLoopIndex(sceneId, nScriptId, nFubenType)

	local nNextScript = 0;
	for i,item in x700081_g_RegisterFuben do
		--print(item.id,nScriptId,item.fubentype,nFubenType)
		if item.id == nScriptId and item.fubentype == nFubenType then
			nNextScript = item.nid
			break;
		end
	end
	--print("nNextScript",nNextScript)
	if nNextScript ~= 0 then
		for i,item in x700081_g_RegisterFuben do
			if item.id == nNextScript and item.fubentype == nFubenType then
				return i
			end
		end
	end
	
	return 0
end
----------------------------------------------------

----------------------------------------------------
function x700081_GetCurrentFubenIndex(sceneId, nScriptId, nFubenType)

	local nNextScript = 0;
	for i,item in x700081_g_RegisterFuben do
		--print(item.id,nScriptId,item.fubentype,nFubenType)
		if item.id == nScriptId and item.fubentype == nFubenType then
			return i
			
		end
	end
	return 0
end

function x700081_NextLoopFuben( sceneId, selfId, nScriptId )
	local nFubenType = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE)
	local nFubenMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE)
	
--	local nIndex = x700081_GetFubenIndex(sceneId, selfId)
--	if nIndex <= 0 then
--		return
--	end
	
	local nIndex = x700081_GetNextLoopIndex(sceneId , nScriptId, nFubenType )
	
	--print("x700081_NextLoopFuben",nScriptId, nIndex, nFubenMode, nFubenType)
	--local nIndex = x700081_GetFubenIndex(sceneId, selfId)
	if nIndex <= 0 then
		local msg = "Error! Next loop fuben is fail, nScriptId= "..nScriptId.."nFubenType= "..nFubenType
		WriteLog(1,msg)
		return
	end
	x700081_SaveFubenIndex( sceneId, selfId, nIndex )
	
	local nFubenType = x700081_g_RegisterFuben[nIndex].fubentype
	SetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE, nFubenType)
	local nFubenMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE)
	
	x700081_OnRequestEnterFuben(sceneId, selfId, nFubenMode,nIndex);	
	
end

function x700081_GetNextLoopFubenDesc( sceneId, selfId, nScriptId )	--获得下一环副本说明文字
	local nFubenType = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE)
	local nFubenMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE)
	
	local nIndex = x700081_GetNextLoopIndex(sceneId , nScriptId, nFubenType )
	
	if nIndex <= 0 or nIndex > getn(x700081_g_EnterInfoList) then
		local msg = "Error! Get Next loop fuben is fail, nScriptId= "..nScriptId.."nFubenType= "..nFubenType
		WriteLog(1,msg)
		return
	end
	
	return x700081_g_EnterInfoList[nIndex]
	
end

function x700081_GetEnterFubenDesc( sceneId, selfId, nScriptId )	--入口菜单说明
	local nFubenType = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE)
	local nFubenMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE)
	
	local nIndex = x700081_GetCurrentFubenIndex(sceneId , nScriptId, nFubenType )
	
	if nIndex <= 0 or nIndex > getn(x700081_g_EnterMenuDescList) then
		local msg = "Error! Get Next loop fuben is fail, nScriptId= "..nScriptId.."nFubenType= "..nFubenType
		WriteLog(1,msg)
		return
	end
	
	return x700081_g_EnterMenuDescList[nIndex]
	
end

function x700081_GetLeaveFubenDesc( sceneId, selfId, nScriptId )	--出口菜单说明
	local nFubenType = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE)
	local nFubenMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE)
	
	local nIndex = x700081_GetCurrentFubenIndex(sceneId , nScriptId, nFubenType )
	
	if nIndex <= 0 or nIndex > getn(x700081_g_LeaveMenuDescList) then
		local msg = "Error! Get Next loop fuben is fail, nScriptId= "..nScriptId.."nFubenType= "..nFubenType
		WriteLog(1,msg)
		return
	end
	
	return x700081_g_LeaveMenuDescList[nIndex]
	
end

function x700081_GetTeleportWangchengDesc( sceneId, selfId, nScriptId )	--出口回王城说明
	local nFubenType = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_TYPE)
	local nFubenMode = GetFubenData_Param(sceneId, x700081_CSP_FUBEN_MODE)
	
	local nIndex = x700081_GetCurrentFubenIndex(sceneId , nScriptId, nFubenType )
	
	if nIndex <= 0 or nIndex > getn(x700081_g_TeleportWangchengDescList) then
		local msg = "Error! Get Next loop fuben is fail, nScriptId= "..nScriptId.."nFubenType= "..nFubenType
		WriteLog(1,msg)
		return
	end
	
	return x700081_g_TeleportWangchengDescList[nIndex]
	
end