--直升道具 60  12030373

------------------------------------------------------------------------------------------
--一般物品的默认脚本

--脚本号

x418043_g_scriptId = 418043
x418043_g_ItemList = {}
x418043_g_LevelMin = 1	
x418043_g_LevelExp = {10,45,140,325,630,1085,1720,2565,3650,5005,6660,8645,10990,13725,16880,20485,24570,29165,34300,68956,95810,120000,150579,187824,201192,222841,259924,302592,310990,1251143,1320651,1390160,1469597,1539105,1618543,1697980,1777418,1856856,3813009,4855871,5085377,5302804,5544390,5785976,6039640,6293305,6559050,6824794,13939491,11446321,11908062,12381955,12880149,19672605,16027280,16646985,17278842,17935000,27364242,28024350,34189707,41700232,50847380,61985378,94430849,105471995,117777061,131488420,200133111,203278075,247418457,301083868,366318707,445604125,903251606,1006824457,1122079362,1250317003,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379,1392981379}	
x418043_g_LevelLim = 60	

--需要的等级


--**********************************
--事件交互入口
--**********************************
function x418043_ProcEventEntry( sceneId, selfId, bagIndex )
-- 不需要这个接口，但要保留空函数
end

--**********************************
--这个物品的使用过程是否类似于技能：
--系统会在执行开始时检测这个函数的返回值，如果返回失败则忽略后面的类似技能的执行。
--返回1：技能类似的物品，可以继续类似技能的执行；返回0：忽略后面的操作。
--**********************************
function x418043_IsSkillLikeScript( sceneId, selfId)
	return 1; --这个脚本需要动作支持
end

--**********************************
--直接取消效果：
--系统会直接调用这个接口，并根据这个函数的返回值确定以后的流程是否执行。
--返回1：已经取消对应效果，不再执行后续操作；返回0：没有检测到相关效果，继续执行。
--**********************************
function x418043_CancelImpacts( sceneId, selfId )
	return 0; --不需要这个接口，但要保留空函数,并且始终返回0。
end

--**********************************
--条件检测入口：
--系统会在技能检测的时间点调用这个接口，并根据这个函数的返回值确定以后的流程是否执行。
--返回1：条件检测通过，可以继续执行；返回0：条件检测失败，中断后续执行。
--**********************************
function x418043_OnConditionCheck( sceneId, selfId )
	
	--校验使用的物品
	
	if(1~=VerifyUsedItem(sceneId, selfId)) then
		return 0
	end
	return 1; --不需要任何条件，并且始终返回1。
end

--**********************************
--消耗检测及处理入口：
--系统会在技能消耗的时间点调用这个接口，并根据这个函数的返回值确定以后的流程是否执行。
--返回1：消耗处理通过，可以继续执行；返回0：消耗检测失败，中断后续执行。
--注意：这不光负责消耗的检测也负责消耗的执行。
--**********************************
function x418043_OnDeplete( sceneId, selfId )
	
	
	--if(DepletingUsedItem(sceneId, selfId)) == 1 then
	--	return 1;
	--end
	--return 0;
	
	return 1;
end

--**********************************
--只会执行一次入口：
--聚气和瞬发技能会在消耗完成后调用这个接口（聚气结束并且各种条件都满足的时候），而引导
--技能也会在消耗完成后调用这个接口（技能的一开始，消耗成功执行之后）。
--返回1：处理成功；返回0：处理失败。
--注：这里是技能生效一次的入口
--**********************************
function x418043_OnActivateOnce( sceneId, selfId, impactId )

	local a = GetLevel(sceneId,selfId)
	local b = x418043_g_LevelLim
	local xExp = 0
	local flag = 0

	for i, item in x418043_g_LevelExp do
		if i == a then
			flag = 1
		end
		if i == b then
			break
		end
		
		if flag == 1 then
				xExp = xExp + item
		end
	end	

	if a < x418043_g_LevelLim then
		AddExpAutoLevelup(sceneId,selfId,xExp)	
		DepletingUsedItem(sceneId, selfId)
	else
		return
	end

end

--**********************************
--引导心跳处理入口：
--引导技能会在每次心跳结束时调用这个接口。
--返回：1继续下次心跳；0：中断引导。
--注：这里是技能生效一次的入口
--**********************************
function x418043_OnActivateEachTick( sceneId, selfId)
	return 1; --不是引导性脚本, 只保留空函数.
end
