--生长点

x301099_g_GrowpointId = 335 --对应生长点ID

x301099_g_Target_ScriptId = 300580



--生成函数开始************************************************************************
function 	x301099_OnCreate(sceneId,growPointType,x,y)
	local ItemBoxId = ItemBoxEnterScene(x, y, x301099_g_GrowpointId, sceneId, 0, -1)
end
--生成函数结束**********************************************************************


--打开前函数开始&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
function	 x301099_OnOpen(sceneId,selfId,targetId)
	CallScriptFunction(x301099_g_Target_ScriptId,"OnClickBox", sceneId,selfId,1)
	return 1
end
--打开前函数结束&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&


--回收函数开始########################################################################
function	 x301099_OnRecycle(sceneId,selfId,targetId)
	return 0;
end
--回收函数结束########################################################################



--打开后函数开始@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
function	x301099_OnProcOver(sceneId,selfId,targetId)
	return 0;
end
--打开后函数结束@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

